[
  {
    "id": "aadce91889d479b1f6525136083ea0eb",
    "url": "https://ca.linkedin.com/jobs/view/senior-software-engineer-at-trust-science-4289878685",
    "title": "Trust Science hiring Senior Software Engineer in Edmonton, Alberta, Canada ",
    "content_text": "We're looking for a Senior Software Engineer and we want someone like you!\n📍 Edmonton HQ (Hybrid), or Remote within Canada 🇨🇦💼 Full-Time \nDo you love solving complex problems, working with big, messy datasets, and building modern, user-focused web apps? We're looking for a creative, senior-level developer who thrives in an entrepreneurial, fast-moving environment.\nYou’ll lead architecture discussions, mentor teammates, shape product direction, and build production-ready solutions that scale. Our stack includes AWS, React, Python, Node.js, and serverless technologies.\n🛠️ What You’ll Be DoingFull-stack web app development (B2B & B2C)Build and scale APIs & front-endsIntegrate external data sourcesAutomate CI/CD pipelines using AWS toolsTackle big data engineering tasksLead code reviews and promote best practicesMentor junior developers and contribute to team culture\n✅ What You BringStrong experience with:AWS (Lambda, API Gateway, DynamoDB, Amplify)JavaScript/TypeScript, Node.js, PythonReact or Vue, HTML/CSS (Tailwind/SASS)Docker, Git, SQL, BashFamiliar with serverless architecture, REST APIs, data wranglingSolid understanding of statistics & modelingAble to pass a criminal background check\n🌟 Bonus If You Have:Knowledge of OAuth, OIDC, JWT, SSOExperience with UX/UI, security models, or NumPyLove for clean documentation and test coverage\n🤝 Why Join Us?We’re a close-knit, innovation-driven team building tech that matters.You'll have real ownership, great flexibility, and the chance to make your mark on products that make a difference, helping deserving people get what they deserve.\nAt Trust Science®, we’re refining the rules of lending. \nBehind every loan application is a human story, and with Credit Bureau 2.0® we’re creating a smarter, fairer way to unlock credit for those overlooked by traditional systems.\nIf you’re passionate about using technology to drive fairness, expand access, and create real-world impact, this is where you belong. \nTogether, we can make finance more inclusive.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>We're looking for a <strong>Senior Software Engineer </strong>and we want someone like you<strong>!</strong></p><p><br></p><p>📍 <strong>Edmonton</strong> HQ (Hybrid), or <strong><em>Remote within Canada</em></strong> 🇨🇦</p><p>💼 Full-Time </p><p><br></p><p>Do you love solving complex problems, working with big, messy datasets, and building modern, user-focused web apps? We're looking for a <strong>creative, senior-level developer</strong> who thrives in an entrepreneurial, fast-moving environment.</p><p><br></p><p>You’ll lead architecture discussions, mentor teammates, shape product direction, and build production-ready solutions that scale. Our stack includes <strong>AWS, React, Python, Node.js, and serverless technologies.</strong></p><p><br></p><p><strong>🛠️ What You’ll Be Doing</strong></p><ul><li>Full-stack web app development (B2B & B2C)</li><li>Build and scale APIs & front-ends</li><li>Integrate external data sources</li><li>Automate CI/CD pipelines using AWS tools</li><li>Tackle big data engineering tasks</li><li>Lead code reviews and promote best practices</li><li>Mentor junior developers and contribute to team culture</li></ul><p><br></p><p><strong>✅ What You Bring</strong></p><p>Strong experience with:</p><ul><li>AWS (Lambda, API Gateway, DynamoDB, Amplify)</li><li>JavaScript/TypeScript, Node.js, Python</li><li>React or Vue, HTML/CSS (Tailwind/SASS)</li><li>Docker, Git, SQL, Bash</li><li>Familiar with serverless architecture, REST APIs, data wrangling</li><li>Solid understanding of statistics & modeling</li><li>Able to pass a criminal background check</li></ul><p><br></p><p><strong>🌟 Bonus If You Have:</strong></p><ul><li>Knowledge of OAuth, OIDC, JWT, SSO</li><li>Experience with UX/UI, security models, or NumPy</li><li>Love for clean documentation and test coverage</li></ul><p><br></p><p><strong>🤝 Why Join Us?</strong></p><p>We’re a close-knit, innovation-driven team building tech that matters.</p><ul><li>You'll have real ownership, great flexibility, and the chance to make your mark on products that make a difference, helping deserving people get what they deserve.</li></ul><p><br></p><p><strong>At Trust Science®</strong>, we’re refining the rules of lending. </p><p><br></p><p>Behind every loan application is a human story, and with Credit Bureau 2.0® we’re creating a smarter, fairer way to unlock credit for those overlooked by traditional systems.</p><p><br></p><p>If you’re passionate about using technology to drive fairness, expand access, and create real-world impact, this is where you belong. </p><p><br></p><p>Together, we can make finance more inclusive.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:48:39.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Trust Science",
    "role": "Senior Software Engineer",
    "location": "Edmonton, Alberta, Canada ",
    "contentPreview": "We're looking for a Senior Software Engineer and we want someone like you! 📍 Edmonton HQ (Hybrid), or Remote within Canada 🇨🇦💼 Full-Time Do you love solving complex problems, working with big, mes...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 85,
    "relevanceReason": "This is a very good match. The candidate's full-stack experience, particularly with React, TypeScript, and Node.js, aligns well with the job requirements. Additionally, the role's emphasis on leadership, mentoring, and architecture aligns with the candidate's experience at Suger and Radix Engineering and Software.",
    "recommendation": "Apply",
    "estimatedCompensation": "120k-180k CAD/year",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "AWS (Lambda, API Gateway, DynamoDB, Amplify), JavaScript/TypeScript, React or Vue, Node.js, Python",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, Tailwind CSS, Golang, AWS\nKey Achievements:\n• Led end-to-end feature development, including task planning, API and UI construction, database modifications, and cloud connections, resulting in successful deployments and improved user experience.\n• Built and scaled reusable API integrations for various platforms (Salesforce, HubSpot, NetSuite, Quickbooks, etc.), streamlining integration processes and enhancing customization capabilities.\n• Mentored three engineers, providing guidance on tasks, code reviews, and debugging, fostering their rapid integration and contribution to larger features from design to deployment.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, Tailwind CSS, HTML, C#, .NET\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization, having left stakeholders impressed by the MVP and wanting to expand its features.\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, HTML, C#, .NET, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes.\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension for refactoring React components, praised for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension praised by the community for fixing a problem that larger and more popular extensions could not.\n• Achieved over 25 Github Stars and 2800 downloads on the VS Code Marketplace.\n\n",
    "coverLetter": "I am incredibly excited to apply for the Senior Software Engineer position at Trust Science. The opportunity to build impactful products that champion fairness and expand access to credit, as described in the job posting, deeply resonates with my values. I’m particularly drawn to Trust Science’s innovative approach to lending and the company's commitment to building something that makes a real difference in people's lives. The chance to work with big data and contribute to a modern, user-focused web app is also a significant draw.\n\nMy experience aligns well with the requirements. Specifically, I’ve built and scaled APIs and front-ends, integrated external data sources, and automated CI/CD pipelines using AWS tools in previous roles, including my work at Suger. I also have a solid understanding of statistics and modeling, as demonstrated by my Chemical Engineering degree and the optimization algorithm I developed. Furthermore, I have experience leading code reviews and mentoring junior developers, which I believe will enable me to quickly contribute to the team's success and help build even better products.\n\nI thrive in entrepreneurial environments and am passionate about continuous learning and improvement. My contributions to open-source projects, such as React Extract, reflect my enthusiasm for sharing knowledge and improving community outcomes. I'm confident in my ability to quickly integrate into your close-knit team, contribute to a positive team culture, and consistently deliver production-ready solutions. I am eager to contribute to Trust Science’s mission, and I am available for an interview at your earliest convenience."
  },
  {
    "id": "1c879121cde27e27e4fbedabff8b8f37",
    "url": "https://ca.linkedin.com/jobs/view/python-developer-at-ampcontrol-4291894082",
    "title": "Ampcontrol hiring Python Developer in Montreal, Quebec, Canada ",
    "content_text": "🚀About Ampcontrol\n\nAmpcontrol is building AI-powered software for optimizing electric vehicle (EV) fleet charging.\n\nWe are a venture backed hybrid team of engineers and energy experts based in Europe, the U.S.A., Canada and South America, building the new way of EV charging. Our primary goal is to enable a simple, reliable & cost efficient transition to zero emission vehicles for fleet operators.\n\nOur company culture includes minimal hierarchy; We make technical decisions based on consensus and aim at simplicity and clarity.\n\n(link to website)\n\n🌎 Our Mission\n\nWe're on a mission to speed up the transition of the automotive and logistic industries to electric fleets and vehicles.\n\nWe believe in a future of self-managing, reliable and affordable charging for companies, fleet operators and humans on our planet.\n\n💻 The Role\n\nYou will be:\n\nBuilding, improving and operating our Python backend, including RabbitMQ, PostgreSQL, TimescaleDB, Redis, asynchronous services and customer facing APIs with FastAPICollaborating with our DevOps team to improve and extend our GCP deploymentMaintaining and improving our extensive test suite, including end-to-end-, BDD-, integration- and unit testsLearning in-depth the EV charging domain, relevant specifications, standards and integrationsWorking with our data science team to build real-time optimization and AI solutionsInvestigating, troubleshooting complex backend issues, make performance improvements and mitigate scalability challengesBuilding, maintaining and migrating databases and accommodate time-series dataContributing to our AI-driven development process by following established dos and don'tsOnboard to our innovative edge server project, learning about ModBus, MQTT and secure websocket protocols\n\n📍 Location\n\nWe're a hybrid team. You can work from Europe, the United States, Canada, or South America, with in-office options in New York, and Erlangen, Germany.\n\nRequirements\n\nYou can apply at all levels, but you have at least 2 years of full-time work experience with a software stack similar to oursYou can elaborate on why you love Python, its ecosystem and components present in our tech stackYou are confident in your Python coding skills to produce clean, well-tested and idiomatic code and learn fast on the job when necessaryYou have hands-on experience with at least one cloud computing platformYou have a good understanding of DevOps tools and methodsYou can communicate in English with clarity about complex technical topicsYou are motivated to work in the EV and sustainability domainYou understand the differences between types of databases and you are comfortable with at least SQL schema design, indexes and migrationsYou appreciate our flat hierarchy, collaborative work environment and understand why we prioritize helping each other first\n\nBenefits\n\nInternationally competitive salaryEquity incentive plansParental leave and 20 days PTOHealthcare and dental plansGlobal offsitesPersonal growth plan and mentoring\n\nPlease note: We're flexible in how we work together. This role can be set up as a contract position, or you can be hired through our Employer of Record (EOR) partner, or directly through our US entity, depending on your location and preference.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>🚀About Ampcontrol<br><br></strong>Ampcontrol is building AI-powered software for optimizing electric vehicle (EV) fleet charging.<br><br>We are a venture backed hybrid team of engineers and energy experts based in Europe, the U.S.A., Canada and South America, building the new way of EV charging. Our primary goal is to enable a simple, reliable & cost efficient transition to zero emission vehicles for fleet operators.<br><br>Our company culture includes minimal hierarchy; We make technical decisions based on consensus and aim at simplicity and clarity.<br><br>(link to website)<br><br><strong>🌎 Our Mission<br><br></strong>We're on a mission to speed up the transition of the automotive and logistic industries to electric fleets and vehicles.<br><br>We believe in a future of self-managing, reliable and affordable charging for companies, fleet operators and humans on our planet.<br><br><strong>💻 The Role<br><br></strong>You will be:<br><br><ul><li>Building, improving and operating our Python backend, including RabbitMQ, PostgreSQL, TimescaleDB, Redis, asynchronous services and customer facing APIs with FastAPI</li><li>Collaborating with our DevOps team to improve and extend our GCP deployment</li><li>Maintaining and improving our extensive test suite, including end-to-end-, BDD-, integration- and unit tests</li><li>Learning in-depth the EV charging domain, relevant specifications, standards and integrations</li><li>Working with our data science team to build real-time optimization and AI solutions</li><li>Investigating, troubleshooting complex backend issues, make performance improvements and mitigate scalability challenges</li><li>Building, maintaining and migrating databases and accommodate time-series data</li><li>Contributing to our AI-driven development process by following established dos and don'ts</li><li>Onboard to our innovative edge server project, learning about ModBus, MQTT and secure websocket protocols<br><br></li></ul><strong>📍 Location<br><br></strong><strong>We're a hybrid team.</strong> You can work from Europe, the United States, Canada, or South America, with in-office options in New York, and Erlangen, Germany.<br><br><strong>Requirements<br><br></strong><ul><li>You can apply at all levels, but you have at least 2 years of full-time work experience with a software stack similar to ours</li><li>You can elaborate on why you love Python, its ecosystem and components present in our tech stack</li><li>You are confident in your Python coding skills to produce clean, well-tested and idiomatic code and learn fast on the job when necessary</li><li>You have hands-on experience with at least one cloud computing platform</li><li>You have a good understanding of DevOps tools and methods</li><li>You can communicate in English with clarity about complex technical topics</li><li>You are motivated to work in the EV and sustainability domain</li><li>You understand the differences between types of databases and you are comfortable with at least SQL schema design, indexes and migrations</li><li>You appreciate our flat hierarchy, collaborative work environment and understand why we prioritize helping each other first<br><br></li></ul><strong>Benefits<br><br></strong><ul><li>Internationally competitive salary</li><li>Equity incentive plans</li><li>Parental leave and 20 days PTO</li><li>Healthcare and dental plans</li><li>Global offsites</li><li>Personal growth plan and mentoring<br><br></li></ul>Please note: We're flexible in how we work together. This role can be set up as a contract position, or you can be hired through our Employer of Record (EOR) partner, or directly through our US entity, depending on your location and preference.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:42:38.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Ampcontrol",
    "role": "Python Developer",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "🚀About Ampcontrol Ampcontrol is building AI-powered software for optimizing electric vehicle (EV) fleet charging. We are a venture backed hybrid team of engineers and energy experts based in Europe, ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 85,
    "relevanceReason": "João's strong Python skills and experience with backend development, databases, and cloud platforms align well with the job requirements. His full-stack experience and leadership skills from previous roles are also valuable.  The hybrid work arrangement is suitable.",
    "recommendation": "Strongly recommended",
    "estimatedCompensation": "120k-160k CAD/year",
    "yearsOfExperienceRequired": "2",
    "hardSkillsRequired": "Python, PostgreSQL, FastAPI",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Golang, Postgres, AWS\nKey Achievements:\n• Built and maintained REST APIs for integrating with external services, demonstrating experience relevant to building customer-facing APIs.\n• Implemented reusable API integrations, showcasing skills in creating efficient and modular code, similar to the task of building backend services.\n• Onboarded and mentored engineers, indicating the ability to collaborate and work within a team, aligning with Ampcontrol's collaborative culture.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow organization, indicating leadership and experience in collaborative development environments.\n• Reduced development time by guiding the team in comprehending requirements, showing project management skills and improving efficiency.\n• Led the implementation of a new interactive 3D visualization, showcasing an innovative approach to complex data analysis, with transferable skills to AI-driven solutions.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, aligning with the job description's requirement of collaborating with the DevOps team to improve deployments.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution, emphasizing efficient code and problem-solving abilities.\n• Consistently delivered user stories within allocated timeframes, highlighting efficient project management skills.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension, demonstrating the ability to work with diverse technologies, including Typescript and VS Code API.\n• Received positive community feedback, showcasing an ability to build solutions to complex problems.\n• Demonstrates project management skills with the ability to fix specific problems that more popular extensions could not.\n\n",
    "coverLetter": "I am incredibly excited by Ampcontrol's mission to revolutionize EV fleet charging. The opportunity to contribute to a company that is actively shaping the future of sustainable transportation, while embracing a culture of innovation and consensus-driven decision-making, is truly compelling. Your commitment to enabling a smooth transition to zero-emission vehicles resonates deeply with my own passion for impactful technology and environmental progress.\n\nMy experience aligns perfectly with the requirements of this role. Specifically, my proficiency in Python, coupled with my experience in building and operating robust backends, including experience with message queues (similar to RabbitMQ), databases (PostgreSQL and time-series databases), and APIs, allows me to immediately contribute to your team. Furthermore, my experience with building and improving extensive test suites will allow me to contribute to your software quality. I am eager to contribute to your AI-driven development process, incorporating my understanding of relevant protocols and specifications, as well as quickly onboarding to the edge server project.\n\nI am drawn to Ampcontrol's emphasis on simplicity, clarity, and minimal hierarchy. My experience in leading teams and collaborating with diverse groups, along with my proactive approach to troubleshooting and problem-solving, makes me confident that I will quickly integrate into your dynamic and collaborative environment. I am eager to learn from your team, share my expertise, and contribute to Ampcontrol’s continued success. I look forward to the opportunity to discuss how my skills and enthusiasm can support your mission.\n"
  },
  {
    "id": "9a56739ae89cda297f8ff1448dcdee98",
    "url": "https://ca.linkedin.com/jobs/view/remote-senior-software-engineer-34123-at-turing-4289873833",
    "title": "Turing hiring Remote Senior Software Engineer - 34123 in Vancouver, British Columbia, Canada ",
    "content_text": "About the projects: We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.\nAbout the Role: We are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. You should have experience working with well-maintained, widely-used repos with 500+ stars. This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality\nWhy Join Us?Turing is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.\nWhat does day-to-day look like:Analyze and triage GitHub issues across trending open-source libraries.Set up and configure code repositories, including Dockerization and environment setup.Evaluating unit test coverage and quality.Modify and run codebases locally to assess LLM performance in bug-fixing scenarios.Collaborate with researchers to design and identify repositories and issues that are challenging for LLMs.Opportunities to lead a team of junior engineers to collaborate on projects.\nRequired Skills:Strong experience with at least one of the following languages: Python, JavaScript, Java, Go, Rust, C/C++, C#, or Ruby. Experience working with well-maintained, widely-used repositories with 500+ starsProficiency with Git, Docker, and basic software pipeline setup.Ability to understand and navigate complex codebases.Comfortable running, modifying, and testing real-world projects locally.Experience contributing to or evaluating open-source projects is a plus.\nNote: Experience working with well-maintained, widely-used repositories (500+ stars) is required.\nNice to Have:Previous participation in LLM research or evaluation projects.Experience building or testing developer tools or automation agents.\nPerks of Freelancing With Turing:Work in a fully remote environment.Opportunity to work on cutting-edge AI projects with leading LLM companies.\nOffer details:Commitment required: 20 hours per week with some overlap with PSTEmployment type: Contractor assignment (no medical/paid leave)Duration of contract: 1 month with expected start date as next weekRates: $40–$100/hour, based on experience and skill level",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>About the projects: </strong></p><p>We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.</p><p><br></p><p><strong>About the Role: </strong></p><p>We are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. <strong>You should have experience working with well-maintained, widely-used repos with 500+ stars. </strong>This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality</p><p><br></p><p><strong>Why Join Us?</strong></p><p>Turing is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.</p><p><br></p><p><strong>What does day-to-day look like:</strong></p><ul><li>Analyze and triage GitHub issues across trending open-source libraries.</li><li>Set up and configure code repositories, including Dockerization and environment setup.</li><li>Evaluating unit test coverage and quality.</li><li>Modify and run codebases locally to assess LLM performance in bug-fixing scenarios.</li><li>Collaborate with researchers to design and identify repositories and issues that are challenging for LLMs.</li><li>Opportunities to lead a team of junior engineers to collaborate on projects.</li></ul><p><br></p><p><strong>Required Skills:</strong></p><ul><li>Strong experience with at least one of the following languages: Python, JavaScript, Java, Go, Rust, C/C++, C#, or Ruby. </li><li><strong>Experience working with well-maintained, widely-used repositories with 500+ stars</strong></li><li>Proficiency with Git, Docker, and basic software pipeline setup.</li><li>Ability to understand and navigate complex codebases.</li><li>Comfortable running, modifying, and testing real-world projects locally.</li><li>Experience contributing to or evaluating open-source projects is a plus.</li></ul><p><br></p><p><strong>Note: Experience working with well-maintained, widely-used repositories (500+ stars) is required.</strong></p><p><br></p><p><strong>Nice to Have:</strong></p><ul><li>Previous participation in LLM research or evaluation projects.</li><li>Experience building or testing developer tools or automation agents.</li></ul><p><br></p><p><strong>Perks of Freelancing With Turing:</strong></p><ul><li>Work in a fully remote environment.</li><li>Opportunity to work on cutting-edge AI projects with leading LLM companies.</li></ul><p><br></p><p><strong>Offer details:</strong></p><ul><li>Commitment required: 20 hours per week with some overlap with PST</li><li>Employment type: Contractor assignment (no medical/paid leave)</li><li>Duration of contract: 1 month with expected start date as next week</li><li>Rates: $40–$100/hour, based on experience and skill level</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:45:36.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Turing",
    "role": "Remote Senior Software Engineer - 34123",
    "location": "Vancouver, British Columbia, Canada ",
    "contentPreview": "About the projects: We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 78,
    "relevanceReason": "The candidate's experience with TypeScript, JavaScript, and Go, along with their full-stack background, aligns well with the job requirements. The role's focus on AI and LLMs provides an exciting opportunity for growth, and the remote nature is a good match. However, the contract-based position might not be ideal if the candidate is looking for a full-time role.",
    "recommendation": "Consider",
    "estimatedCompensation": "$40-$100 USD/hour",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Python, JavaScript, Git, Docker",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, Golang, AWS\nKey Achievements:\n• Built reusable API integrations for Salesforce, HubSpot, and others, streamlining development and enabling easier integration with various platforms.\n• Planned and delivered features end-to-end, including API and UI development, database changes, and cloud integrations, demonstrating full-stack capabilities.\n• Ran ten technical interviews, evaluating candidates and contributing to hiring decisions.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, ThreeJS, C#\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization, providing increased data contextualization and receiving positive stakeholder feedback, showcasing innovative problem-solving skills.\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n• Experience leading a team of developers and providing tailored feedback\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, C#, .NET, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors, demonstrating proficiency in software pipeline setup.\n• Reduced deployment time from 20 minutes to 4 minutes on average.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, demonstrating problem-solving skills and ability to build tools to improve the development workflow, with over 25 Github Stars.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension to fix a problem that larger and more popular extensions could not, with over 25 Github Stars on the repo.\n• Demonstrates an interest in improving development workflows, relevant to the role's requirement of issue triaging.\n\n",
    "coverLetter": "I am incredibly excited by the opportunity to join Turing as a Senior Software Engineer, contributing to the cutting-edge work in LLM evaluation and training datasets. The prospect of influencing the future of AI-assisted software development, as Turing is doing, is profoundly appealing. I am particularly drawn to the project's focus on real-world software engineering problems, which aligns perfectly with my passion for building practical and impactful solutions.\n\nMy experience aligns well with your requirements. I have a strong background in multiple relevant languages (Typescript, Javascript, C# and Go), and experience working with well-maintained repositories, including contributions to open-source projects. My ability to quickly set up and configure code repositories, demonstrated by my work with Dockerization and environment setups at Suger, will allow me to hit the ground running. Furthermore, my experience leading teams and mentoring engineers at Radix, combined with my deep understanding of software development pipelines, will be invaluable in evaluating test coverage and quality and collaborating with researchers.\n\nBeyond technical skills, I am a highly collaborative and results-oriented individual. My experience in demanding environments, such as optimizing complex industrial dashboards, has instilled in me a strong work ethic and a commitment to excellence. I am adept at working both independently and as part of a team, and I am confident in my ability to quickly integrate into the Turing culture and contribute to its innovative and forward-thinking environment. I am eager to learn more about this opportunity and discuss how I can contribute to Turing’s success."
  },
  {
    "id": "fc0383400e9a48860ce31170c05df846",
    "url": "https://ca.linkedin.com/jobs/view/remote-senior-software-engineer-34123-at-turing-4289879550",
    "title": "Turing hiring Remote Senior Software Engineer - 34123 in Toronto, Ontario, Canada ",
    "content_text": "About the projects: We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.\nAbout the Role: We are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. You should have experience working with well-maintained, widely-used repos with 500+ stars. This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality\nWhy Join Us?Turing is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.\nWhat does day-to-day look like:Analyze and triage GitHub issues across trending open-source libraries.Set up and configure code repositories, including Dockerization and environment setup.Evaluating unit test coverage and quality.Modify and run codebases locally to assess LLM performance in bug-fixing scenarios.Collaborate with researchers to design and identify repositories and issues that are challenging for LLMs.Opportunities to lead a team of junior engineers to collaborate on projects.\nRequired Skills:Strong experience with at least one of the following languages: Python, JavaScript, Java, Go, Rust, C/C++, C#, or Ruby. Experience working with well-maintained, widely-used repositories with 500+ starsProficiency with Git, Docker, and basic software pipeline setup.Ability to understand and navigate complex codebases.Comfortable running, modifying, and testing real-world projects locally.Experience contributing to or evaluating open-source projects is a plus.\nNote: Experience working with well-maintained, widely-used repositories (500+ stars) is required.\nNice to Have:Previous participation in LLM research or evaluation projects.Experience building or testing developer tools or automation agents.\nPerks of Freelancing With Turing:Work in a fully remote environment.Opportunity to work on cutting-edge AI projects with leading LLM companies.\nOffer details:Commitment required: 20 hours per week with some overlap with PSTEmployment type: Contractor assignment (no medical/paid leave)Duration of contract: 1 month with expected start date as next weekRates: $40–$100/hour, based on experience and skill level",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>About the projects: </strong></p><p>We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.</p><p><br></p><p><strong>About the Role: </strong></p><p>We are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. <strong>You should have experience working with well-maintained, widely-used repos with 500+ stars. </strong>This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality</p><p><br></p><p><strong>Why Join Us?</strong></p><p>Turing is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.</p><p><br></p><p><strong>What does day-to-day look like:</strong></p><ul><li>Analyze and triage GitHub issues across trending open-source libraries.</li><li>Set up and configure code repositories, including Dockerization and environment setup.</li><li>Evaluating unit test coverage and quality.</li><li>Modify and run codebases locally to assess LLM performance in bug-fixing scenarios.</li><li>Collaborate with researchers to design and identify repositories and issues that are challenging for LLMs.</li><li>Opportunities to lead a team of junior engineers to collaborate on projects.</li></ul><p><br></p><p><strong>Required Skills:</strong></p><ul><li>Strong experience with at least one of the following languages: Python, JavaScript, Java, Go, Rust, C/C++, C#, or Ruby. </li><li><strong>Experience working with well-maintained, widely-used repositories with 500+ stars</strong></li><li>Proficiency with Git, Docker, and basic software pipeline setup.</li><li>Ability to understand and navigate complex codebases.</li><li>Comfortable running, modifying, and testing real-world projects locally.</li><li>Experience contributing to or evaluating open-source projects is a plus.</li></ul><p><br></p><p><strong>Note: Experience working with well-maintained, widely-used repositories (500+ stars) is required.</strong></p><p><br></p><p><strong>Nice to Have:</strong></p><ul><li>Previous participation in LLM research or evaluation projects.</li><li>Experience building or testing developer tools or automation agents.</li></ul><p><br></p><p><strong>Perks of Freelancing With Turing:</strong></p><ul><li>Work in a fully remote environment.</li><li>Opportunity to work on cutting-edge AI projects with leading LLM companies.</li></ul><p><br></p><p><strong>Offer details:</strong></p><ul><li>Commitment required: 20 hours per week with some overlap with PST</li><li>Employment type: Contractor assignment (no medical/paid leave)</li><li>Duration of contract: 1 month with expected start date as next week</li><li>Rates: $40–$100/hour, based on experience and skill level</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:45:32.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Turing",
    "role": "Remote Senior Software Engineer - 34123",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "About the projects: We are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 75,
    "relevanceReason": "João's experience with Typescript, Javascript, and Golang aligns well with the required languages. His experience in leading teams and building software end-to-end, combined with experience working with well-maintained repositories, makes him a good fit. However, the contract-based role and the focus on LLM research, an area where João has limited experience, slightly reduce the overall score.",
    "recommendation": "Recommended",
    "estimatedCompensation": "$40-$100/hour",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Python, JavaScript, Git, Docker",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, Jest, Playwright, Golang, AWS, Docker\nKey Achievements:\n• Built and incremented reusable API integrations, demonstrating experience with software pipeline setup and integration with other platforms.\n• Onboarded and mentored three engineers, providing code reviews and guidance, showcasing leadership skills and the ability to explain complex topics\n• Planned and delivered features end-to-end, demonstrating an understanding of full software engineering lifecycle with task planning, APIs and UIs, database changes, cloud connections, tests and documentation.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, C#, .NET\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helping the team to achieve a productivity increase of up to 100%\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, leaving stakeholders impressed by the MVP and wanting to expand its features.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, C#, .NET, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, thus enabling faster testing cycles and eliminating deployment errors, showcasing practical software engineering skills and the ability to optimize development processes.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, with over 25 Github Stars on the repo, 2800 downloads and a 5/5 review grade on the VS Code Marketplace, praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API, Github\nKey Achievements:\n• Developed and maintained a VS Code extension, demonstrating the ability to create and contribute to open-source projects.\n• Successfully addressed a community need with a solution that others couldn't, showcasing the problem-solving ability.\n\n",
    "coverLetter": "I am writing to express my profound enthusiasm for the Senior Software Engineer position at Turing, as advertised. The opportunity to contribute to the advancement of AI-assisted software development, specifically by working with LLM evaluation and training datasets, resonates deeply with my passion for practical software engineering and innovative technology. The chance to be at the forefront of influencing how LLMs interact with real code is a compelling prospect, aligning perfectly with my career aspirations.\n\nMy experience in full-stack development, particularly my ability to analyze and triage GitHub issues, set up code repositories, and evaluate test coverage, makes me a strong candidate for this role. My experience with well-maintained, widely-used repositories, as evidenced by my work at Suger and Radix Engineering, along with my proficiency in multiple programming languages, including Typescript, Javascript, and C#, directly addresses your requirements. I am confident in my ability to quickly integrate into your team and contribute to the project's success.\n\nI am a proactive and collaborative team player, with experience leading and mentoring engineers. My experience at Radix Engineering, leading teams to improved productivity, demonstrates my ability to foster a supportive and efficient work environment. I am eager to contribute my skills to the Turing team, working alongside like-minded individuals to shape the future of AI. I am excited by the prospect of this unique blend of software engineering and AI research. I am eager to learn more about this exciting opportunity and discuss how my skills and experience align with your needs. Thank you for your time and consideration."
  },
  {
    "id": "cd56e5bd2594f6e6fc13e8e3d73b9b84",
    "url": "https://ca.linkedin.com/jobs/view/analyste-en-assurance-qualit%C3%A9-at-go-rock-it-4272190787",
    "title": "GO ROCK IT hiring Analyste en assurance qualité in Montreal, Quebec, Canada ",
    "content_text": "Mise à jour: 27 aout 2025Localisation: Montréal, QcMode hybride: 2 jours par semaine au bureau37,5h/semaine--\nGO ROCK IT, c’est l’incontournable Agence de talents spécialisée dans les secteurs des technologies de l’information (TI) et du marketing numérique.\nNotre Agence se démarque pour la diversité et la richesse de l’expertise de ses talents, et pour le savoir-faire de son équipe de recrutement et de gestion de talents. Nous sommes au service de nos talents, pour répondre aux besoins de clients.\nEn recherche d’amélioration continue, nous sommes déterminés à garantir des pratiques de recrutement justes et équitables pour tous. Notre processus de recrutement est entièrement transparent. Si le rôle qu’on te propose aujourd’hui n'est pas le bon pour toi, trouvons-en un qui le soit! Travaillons ensemble pour s’assurer que tu atteignes tes objectifs professionnels 💪\n👇 À propos du poste :Nous recherchons actuellement un(e) Analyste en assurance qualité pour rejoindre l'équipe de l'un de nos partenaires stratégiques à Montréal.\n🛠️ Ce que tu feras :Analyser en amont les besoins d'affaires afin de planifier les tests à différents niveaux;Élaborer la stratégie de test en tenant compte des réalités technologiques et de la pyramide de test;Influencer le développement d'un point de vue client pour l'application mobile, web ou nos systèmes backend;Écriture et maintenir les tests automatisés avec des outils comme Cypress, Postman, Rest Assured, Detox, Selenium;Participer à l'élaboration du monitoring, des tests de sécurité et de performance avec les équipes d'opération ou de livraison;Capaciter de challenger le statu quo en faveur d'une meilleure qualité;Créer, gérer et maintenir des jeux de données;Travailler de près avec les développeurs et les orchestrateurs dans une philosophie de \"shift-left\", d'accompagnement et de travail en amont;Participer à l'évolution de la pratique avec des partages de connaissance avec l'ensemble de l'équipe;Placer la qualité au centre de l'équipe pour éviter les embouteillage dans le flux de livraison;Identifier les opportunités d'amélioration continue des processus de développement;Participer à la conception et à l'élaboration des solution proposées;\n🧠 Qualifications recherchées :Baccalauréat avec spécialité Technologie de l’Information, un diplôme en assurance qualité, ou toute autre expérience pertinente équivalente;Minimum 5 ans d'expérience démontrée dans un rôle d'analyste de qualité;Connaissance des processus d'automatisation de test, avec des outils reconnus;Connaissance et expérience avec les outils DevOps (Git, GitHub, Docker, Datadog, etc.);Expérience démontrée avec les concepts de développement orienté test (TDD), tests orienté sur le comportement (BDD), l’intégration continue (CI), et le déploiement automatisé de logiciel (CD);Expérience avec les services de cloud AWS appréciée;Capacité à structurer et documenter de façon rigoureuse, à suivre et livrer plusieurs initiatives simultanées;\nPostule directement ici! 💪\nMême si tu es simplement curieux(se), fais-nous signe.\nChez GO ROCK IT, nous valorisons l'équité, la diversité et l'inclusion. Nous sommes impatients de discuter avec toi et de découvrir comment nous pouvons t'aider à progresser dans ta carrière, dans un environnement dynamique et axé sur l’innovation où tu te sentiras respecté et valorisé.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>Mise à jour: 27 aout 2025</p><p>Localisation: Montréal, Qc</p><p>Mode hybride: 2 jours par semaine au bureau</p><p>37,5h/semaine</p><p>--</p><p><br></p><p><strong>GO ROCK IT</strong>, c’est l’incontournable Agence de talents spécialisée dans les secteurs des technologies de l’information (TI) et du marketing numérique.</p><p><br></p><p>Notre Agence se démarque pour la diversité et la richesse de l’expertise de ses talents, et pour le savoir-faire de son équipe de recrutement et de gestion de talents. Nous sommes au service de nos talents, pour répondre aux besoins de clients.</p><p><br></p><p>En recherche d’amélioration continue, nous sommes déterminés à garantir des pratiques de recrutement justes et équitables pour tous. Notre processus de recrutement est entièrement transparent. Si le rôle qu’on te propose aujourd’hui n'est pas le bon pour toi, trouvons-en un qui le soit! Travaillons ensemble pour s’assurer que tu atteignes tes objectifs professionnels 💪</p><p><br></p><p>👇 <strong>À propos du poste :</strong></p><p>Nous recherchons actuellement un(e) <strong>Analyste en assurance qualité</strong> pour rejoindre l'équipe de l'un de nos partenaires stratégiques à Montréal.</p><p><br></p><p>🛠️ <strong>Ce que tu feras :</strong></p><ul><li>Analyser en amont les besoins d'affaires afin de planifier les tests à différents niveaux;</li><li>Élaborer la stratégie de test en tenant compte des réalités technologiques et de la pyramide de test;</li><li>Influencer le développement d'un point de vue client pour l'application mobile, web ou nos systèmes backend;</li><li>Écriture et maintenir les tests automatisés avec des outils comme Cypress, Postman, Rest Assured, Detox, Selenium;</li><li>Participer à l'élaboration du monitoring, des tests de sécurité et de performance avec les équipes d'opération ou de livraison;</li><li>Capaciter de challenger le statu quo en faveur d'une meilleure qualité;</li><li>Créer, gérer et maintenir des jeux de données;</li><li>Travailler de près avec les développeurs et les orchestrateurs dans une philosophie de \"shift-left\", d'accompagnement et de travail en amont;</li><li>Participer à l'évolution de la pratique avec des partages de connaissance avec l'ensemble de l'équipe;</li><li>Placer la qualité au centre de l'équipe pour éviter les embouteillage dans le flux de livraison;</li><li>Identifier les opportunités d'amélioration continue des processus de développement;</li><li>Participer à la conception et à l'élaboration des solution proposées;</li></ul><p><br></p><p>🧠 <strong>Qualifications recherchées :</strong></p><ul><li>Baccalauréat avec spécialité Technologie de l’Information, un diplôme en assurance qualité, ou toute autre expérience pertinente équivalente;</li><li>Minimum 5 ans d'expérience démontrée dans un rôle d'analyste de qualité;</li><li>Connaissance des processus d'automatisation de test, avec des outils reconnus;</li><li>Connaissance et expérience avec les outils DevOps (Git, GitHub, Docker, Datadog, etc.);</li><li>Expérience démontrée avec les concepts de développement orienté test (TDD), tests orienté sur le comportement (BDD), l’intégration continue (CI), et le déploiement automatisé de logiciel (CD);</li><li>Expérience avec les services de cloud AWS appréciée;</li><li>Capacité à structurer et documenter de façon rigoureuse, à suivre et livrer plusieurs initiatives simultanées;</li></ul><p><br></p><p><strong>Postule directement ici!</strong> 💪</p><p><br></p><p>Même si tu es simplement curieux(se), fais-nous signe.</p><p><br></p><p>Chez <strong>GO ROCK IT</strong>, nous valorisons l'équité, la diversité et l'inclusion. Nous sommes impatients de discuter avec toi et de découvrir comment nous pouvons t'aider à progresser dans ta carrière, dans un environnement dynamique et axé sur l’innovation où tu te sentiras respecté et valorisé.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:28:16.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "GO ROCK IT",
    "role": "Analyste en assurance qualité",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "Mise à jour: 27 aout 2025Localisation: Montréal, QcMode hybride: 2 jours par semaine au bureau37,5h/semaine-- GO ROCK IT, c’est l’incontournable Agence de talents spécialisée dans les secteurs des tec...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 68,
    "relevanceReason": "The candidate's strong experience with TypeScript, JavaScript, and cloud technologies like AWS aligns well with the requirements. While the role is for a Quality Assurance Analyst, the candidate's experience in full-stack development and leading teams, combined with their existing DevOps knowledge (Git, GitHub), makes this a moderate match. The role is located in Montreal, QC, a region not explicitly mentioned in the prompt; thus, the candidate should consider applying.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-110k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Test Automation, DevOps (Git, GitHub, Docker), Cloud (AWS)",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, Jest, Playwright, Postgres, AWS\nKey Achievements:\n• Built and incremented reusable API integrations, streamlining integration processes and enabling easier customization. (Relevant to the need to influence development)\n• Planned and delivered features end-to-end, including testing and documentation, demonstrating experience in quality assurance practices.\n• Onboarded and mentored three engineers, sharing knowledge and best practices related to testing, code review, and development, demonstrating ability to influence a team.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization, having left stakeholders impressed by the MVP and wanting to expand its features.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, HTML, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, with over 25 Github Stars on the repo, 2800 downloads and a 5/5 review grade on the VS Code Marketplace, praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API, Typescript API, Mocha\nKey Achievements:\n• Developed a VS Code extension to refactor React components, demonstrating initiative in solving complex challenges in web development.\n• Received positive feedback and high ratings from the community for providing a solution to a problem that other, more popular solutions were unable to address.\n\n",
    "coverLetter": "I am incredibly excited to apply for the Analyste en assurance qualité position at GO ROCK IT, as advertised on August 27th. The opportunity to contribute to a company that prioritizes its talent and champions transparency in its recruitment process truly resonates with me. I am drawn to GO ROCK IT's mission to serve its talents and clients, and I am eager to contribute to a team-oriented environment focused on continuous improvement, where I can grow professionally. The hybrid work model, allowing for in-office collaboration, is also a huge plus. \n\nWith my background in software engineering and a proven track record of delivering high-quality results, I'm confident I can bring significant value to your team. My experience building and maintaining automated tests using tools like Playwright and Jest, coupled with my understanding of CI/CD pipelines, aligns perfectly with the requirements. My experience, such as optimizing application performance and performance tests, and ability to work closely with developers, will enable me to contribute to the quality assurance of the mobile and web applications. Furthermore, I'm enthusiastic about influencing development from a client perspective to bring value to the projects.\n\nI'm a collaborative and results-oriented individual with a passion for quality and a \"shift-left\" approach to development. My experience in leading teams and mentoring colleagues has instilled in me a strong belief in knowledge sharing and continuous improvement. I am confident in my ability to quickly integrate into your team, challenge the status quo for the better, and contribute to GO ROCK IT's continued success. I am eager to discuss how my skills and experience align with your needs. Thank you for your time and consideration. "
  },
  {
    "id": "2dcb7c6e667f3b282a95d389027988f6",
    "url": "https://ca.linkedin.com/jobs/view/full-stack-developer-at-insight-global-4291901415",
    "title": "Insight Global hiring full stack developer in Toronto, Ontario, Canada ",
    "content_text": "JOB DESCRIPTIONInsight Global is seeking a Senior Full Stack Developer with strong AWS expertise to support the end-to-end modernization of a legacy KYC (Know Your Customer) platform. This hybrid role, based in Toronto, involves working closely with cross-functional teams and long-standing vendor partners to deliver a robust, cloud-first solution. \nKey Responsibilities • Lead AWS cloud development for KYC platform components • Redevelop and modernize core elements of the legacy KYC system • Collaborate with QA teams to ensure secure and reliable deployments • Integrate and deploy new KYC modules in partnership with external vendors • Ensure compliance, performance, and security across cloud environments\nREQUIRED SKILLS AND EXPERIENCE• 6+ years of Java development experience (Spring Boot) • 2+ years of hands-on AWS cloud development • 2+ years Angular experience. • 2+years experience leading small-scale initiatives\nNICE TO HAVE SKILLS AND EXPERIENCE• Familiarity with PostgreSQL • Background in banking or financial services",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>JOB DESCRIPTION</strong></p><p>Insight Global is seeking a Senior Full Stack Developer with strong AWS expertise to support the end-to-end modernization of a legacy KYC (Know Your Customer) platform. This hybrid role, based in Toronto, involves working closely with cross-functional teams and long-standing vendor partners to deliver a robust, cloud-first solution. </p><p><br></p><p>Key Responsibilities </p><p>• Lead AWS cloud development for KYC platform components </p><p>• Redevelop and modernize core elements of the legacy KYC system </p><p>• Collaborate with QA teams to ensure secure and reliable deployments </p><p>• Integrate and deploy new KYC modules in partnership with external vendors </p><p>• Ensure compliance, performance, and security across cloud environments</p><p><br></p><p><strong>REQUIRED SKILLS AND EXPERIENCE</strong></p><p>• 6+ years of Java development experience (Spring Boot) </p><p>• 2+ years of hands-on AWS cloud development </p><p>• 2+ years Angular experience. </p><p>• 2+years experience leading small-scale initiatives</p><p><br></p><p><strong>NICE TO HAVE SKILLS AND EXPERIENCE</strong></p><p>• Familiarity with PostgreSQL </p><p>• Background in banking or financial services</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T14:45:03.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Insight Global",
    "role": "full stack developer",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "JOB DESCRIPTIONInsight Global is seeking a Senior Full Stack Developer with strong AWS expertise to support the end-to-end modernization of a legacy KYC (Know Your Customer) platform. This hybrid role...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 65,
    "relevanceReason": "The candidate has strong experience with TypeScript, React, and AWS, aligning well with the role's requirements. However, the primary language requested is Java, and while the candidate has diverse experience with multiple other technologies, Java is not one of them. Therefore, this is a moderate match, but the candidate's other skills and leadership experience make it worth considering.",
    "recommendation": "Consider",
    "estimatedCompensation": "100k-140k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "Java, AWS, Angular",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, Postgres, AWS\nKey Achievements:\n• Engineered end-to-end features, including API integrations and UI components, demonstrating full-stack proficiency and delivering complete solutions. This is relevant to leading AWS cloud development for KYC platform components.\n• Built and enhanced reusable API integrations (Salesforce, HubSpot, etc.) facilitating easier development and customization; showing ability to work with external vendors.\n• Led and mentored three engineers through design to deployment of larger features.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization, showcasing the ability to lead initiatives and bring innovation to the table.\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow organization, with an estimated 50% to 100% increase in productivity. This aligns with the 2+years experience leading small-scale initiatives requirement.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors, demonstrating DevOps skills relevant to ensuring secure and reliable deployments.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, demonstrating ability to work within deadlines and ensuring performance.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, demonstrating problem-solving abilities and a proactive approach to improving developer workflows. (similar to modernizing a legacy platform)\nTechnologies: Typescript, React\nKey Achievements:\n• Developed a widely-used VS Code extension praised for fixing a problem that other extensions could not. Demonstrating expertise and attention to detail.\n• The extension has over 25 Github Stars on the repo, 2800 downloads and a 5/5 review grade on the VS Code Marketplace\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Full Stack Developer position at Insight Global, as advertised. The opportunity to modernize a legacy KYC platform using AWS aligns perfectly with my passion for building robust, cloud-first solutions and my career goals. I am particularly drawn to Insight Global's commitment to supporting impactful projects within the financial sector and its collaborative approach to problem-solving, as evidenced by the emphasis on working closely with cross-functional teams and external vendors.\n\nWith over four years of experience as a full-stack developer, including hands-on experience in AWS, I am confident in my ability to contribute significantly to this project. I have a proven track record of leading initiatives, from planning and delivery to implementation and deployment, as demonstrated by my work at Suger and Radix Engineering and Software. My experience in optimizing performance, particularly the work I did to optimize a Dashboard with multiple charts containing hundreds of thousands of points, using caching and lazy loading to bring memory consumption to a third of its value, aligns perfectly with the requirements. Moreover, my experience building and leading teams will allow me to efficiently contribute to the team.\n\nBeyond my technical skills, I thrive in collaborative environments and am adept at quickly integrating into new teams. My experience mentoring junior engineers and contributing to code reviews at Suger, showcases my ability to foster a supportive and productive atmosphere. My commitment to continuous learning and my strong communication skills, honed through working in remote settings, ensure effective collaboration and successful project delivery. I am eager to bring my expertise and enthusiasm to Insight Global and am confident I can make a meaningful contribution to the modernization of the KYC platform. I am available for an interview at your earliest convenience and look forward to discussing my qualifications further."
  },
  {
    "id": "8e700bf6c08fe59b25b5f42e34133132",
    "url": "https://ca.linkedin.com/jobs/view/product-manager-search-and-embeddings-at-cohere-4267608860",
    "title": "Cohere hiring Product Manager, Search and Embeddings in Toronto, Ontario, Canada ",
    "content_text": "Who are we?\n\nOur mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences like content generation, semantic search, RAG, and agents. We believe that our work is instrumental to the widespread adoption of AI.\n\nWe obsess over what we build. Each one of us is responsible for contributing to increasing the capabilities of our models and the value they drive for our customers. We like to work hard and move fast to do what’s best for our customers.\n\nCohere is a team of researchers, engineers, designers, and more, who are passionate about their craft. Each person is one of the best in the world at what they do. We believe that a diverse range of perspectives is a requirement for building great products.\n\nJoin us on our mission and shape the future!\n\nProduct Management At Cohere\n\nOur team is responsible for driving the direction of Cohere’s technology to the world through our interfaces. We’ve released generative models like Command A, Retrieval models like Embed 4 and Rerank 3.5, and products such as North and Compass. At Cohere, PMs work on the core models, APIs, and end-to-end products that serve our enterprises and developers.\n\nWe view the role that PMs play at Cohere to be “full-stack” in the sense that you will work with cross-functional stakeholders at every step of the way when training and evaluating the models, delivering product, ensuring successful GTM and customer happiness.\n\nAbout The Search And Embeddings Role\n\nOne of the most exciting applications for generative AI is in its use in Retrieval Augmented Generation (RAG) and Agents - Search and Embeddings plays a critical role in ensuring that LLMs have the correct context in order to answer the user needs. The focus of this PM will not only be on the role that search plays in RAG/Agents but also in traditional search. The expectation is that you have experience with working on Search products and Embedding / Cross-Encoder models.\n\nThe Search and Embedding PM manages the following models and products:\n\nEmbeddings (Embed-v4.0)Rerank (Rerank-v3.5) Compass (Cohere’s Search Solution) Evaluation of Search performance across all products and models\n\nIn This Role, You Will\n\nDefine strategic priorities and roadmap for improving retrieval model performance, focusing on enterprise needs and emerging capabilities. Use data and customer engagements to better understand user needs and guide future product and model development.Collaborate with a wide range of stakeholders, including teams in product, finance, go-to-market, engineering, and marketing.Drive product strategy and monetization through a deep understanding of the increasingly dynamic and competitive AI Landscape. Read lots of papers and collaborate with ML on ensuring our models remain SOTA\n\nIn order to be successful in this role, you have:\n\nAt least 4+ years of product management experience, understanding customer needs, and launching successful products.At least 1+ years of working on search products and embedding/reranking models.Obtained a Bachelor’s or postgrad degree in CS, ML or related field, or a background in machine learning, algorithms, large scale systems, and statistics.Have proven experience working in a technical environment with cross-functional teams to drive product vision, define requirements, and guide the team through key milestones.Showcase strong leadership, organizational, and execution skills, along with proven communication abilities.\n\nIf some of the above doesn’t line up perfectly with your experience, we still encourage you to apply! If you want to work really hard on a glorious mission with teammates that want the same thing, Cohere is the place for you.\n\nWe value and celebrate diversity and strive to create an inclusive work environment for all. We welcome applicants from all backgrounds and are committed to providing equal opportunities. Should you require any accommodations during the recruitment process, please submit an Accommodations Request Form, and we will work together to meet your needs.\n\nFull-Time Employees At Cohere Enjoy These Perks\n\n🤝 An open and inclusive culture and work environment\n\n🧑💻 Work closely with a team on the cutting edge of AI research\n\n🍽 Weekly lunch stipend, in-office lunches & snacks\n\n🦷 Full health and dental benefits, including a separate budget to take care of your mental health\n\n🐣 100% Parental Leave top-up for 6 months for employees based in Canada, the US, and the UK\n\n🎨 Personal enrichment benefits towards arts and culture, fitness and well-being, quality time, and workspace improvement\n\n🏙 Remote-flexible, offices in Toronto, New York, San Francisco and London and co-working stipend\n\n✈️ 6 weeks of vacation\n\nNote: This post is co-authored by both Cohere humans and Cohere technology.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Who are we?<br><br></strong>Our mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences like content generation, semantic search, RAG, and agents. We believe that our work is instrumental to the widespread adoption of AI.<br><br>We obsess over what we build. Each one of us is responsible for contributing to increasing the capabilities of our models and the value they drive for our customers. We like to work hard and move fast to do what’s best for our customers.<br><br>Cohere is a team of researchers, engineers, designers, and more, who are passionate about their craft. Each person is one of the best in the world at what they do. We believe that a diverse range of perspectives is a requirement for building great products.<br><br>Join us on our mission and shape the future!<br><br><strong>Product Management At Cohere<br><br></strong>Our team is responsible for driving the direction of Cohere’s technology to the world through our interfaces. We’ve released generative models like Command A, Retrieval models like Embed 4 and Rerank 3.5, and products such as North and Compass. At Cohere, PMs work on the core models, APIs, and end-to-end products that serve our enterprises and developers.<br><br>We view the role that PMs play at Cohere to be “full-stack” in the sense that you will work with cross-functional stakeholders at every step of the way when training and evaluating the models, delivering product, ensuring successful GTM and customer happiness.<br><br><strong>About The Search And Embeddings Role<br><br></strong>One of the most exciting applications for generative AI is in its use in Retrieval Augmented Generation (RAG) and Agents - Search and Embeddings plays a critical role in ensuring that LLMs have the correct context in order to answer the user needs. The focus of this PM will not only be on the role that search plays in RAG/Agents but also in traditional search. The expectation is that you have experience with working on Search products and Embedding / Cross-Encoder models.<br><br>The Search and Embedding PM manages the following models and products:<br><br><ul><li>Embeddings (Embed-v4.0)</li><li>Rerank (Rerank-v3.5) </li><li>Compass (Cohere’s Search Solution) </li><li>Evaluation of Search performance across all products and models<br><br></li></ul><strong>In This Role, You Will<br><br></strong><ul><li>Define strategic priorities and roadmap for improving retrieval model performance, focusing on enterprise needs and emerging capabilities. </li><li>Use data and customer engagements to better understand user needs and guide future product and model development.</li><li>Collaborate with a wide range of stakeholders, including teams in product, finance, go-to-market, engineering, and marketing.</li><li>Drive product strategy and monetization through a deep understanding of the increasingly dynamic and competitive AI Landscape. </li><li>Read lots of papers and collaborate with ML on ensuring our models remain SOTA<br><br></li></ul><strong>In order to be successful in this role, you have:<br><br></strong><ul><li>At least 4+ years of product management experience, understanding customer needs, and launching successful products.</li><li>At least 1+ years of working on search products and embedding/reranking models.</li><li>Obtained a Bachelor’s or postgrad degree in CS, ML or related field, or a background in machine learning, algorithms, large scale systems, and statistics.</li><li>Have proven experience working in a technical environment with cross-functional teams to drive product vision, define requirements, and guide the team through key milestones.</li><li>Showcase strong leadership, organizational, and execution skills, along with proven communication abilities.<br><br></li></ul>If some of the above doesn’t line up perfectly with your experience, we still encourage you to apply! If you want to work really hard on a glorious mission with teammates that want the same thing, Cohere is the place for you.<br><br>We value and celebrate diversity and strive to create an inclusive work environment for all. We welcome applicants from all backgrounds and are committed to providing equal opportunities. Should you require any accommodations during the recruitment process, please submit an Accommodations Request Form, and we will work together to meet your needs.<br><br><strong>Full-Time Employees At Cohere Enjoy These Perks<br><br></strong>🤝 An open and inclusive culture and work environment<br><br>🧑💻 Work closely with a team on the cutting edge of AI research<br><br>🍽 Weekly lunch stipend, in-office lunches & snacks<br><br>🦷 Full health and dental benefits, including a separate budget to take care of your mental health<br><br>🐣 100% Parental Leave top-up for 6 months for employees based in Canada, the US, and the UK<br><br>🎨 Personal enrichment benefits towards arts and culture, fitness and well-being, quality time, and workspace improvement<br><br>🏙 Remote-flexible, offices in Toronto, New York, San Francisco and London and co-working stipend<br><br>✈️ 6 weeks of vacation<br><br><em>Note: This post is co-authored by both Cohere humans and Cohere technology.</em></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T13:03:03.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Cohere",
    "role": "Product Manager, Search and Embeddings",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Who are we? Our mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 45,
    "relevanceReason": "The candidate's software engineering background and full-stack experience don't directly align with this Product Manager role focused on search and embeddings. While the candidate has experience with relevant technologies like TypeScript and React, the role's emphasis is on product management, and the candidate lacks explicit experience in this area. It's unlikely the candidate would be considered.",
    "recommendation": "Skip",
    "estimatedCompensation": "150k-200k CAD/year",
    "yearsOfExperienceRequired": "4",
    "hardSkillsRequired": "Search Products, Embedding/Reranking Models, Product Management",
    "tailoredResume": "",
    "coverLetter": ""
  }
]