[
  {
    "id": "dc21a77c28bde9c0af4c6119bae4d223",
    "url": "https://www.linkedin.com/jobs/view/software-engineer-fullstack-at-pinterest-4290282984",
    "title": "Pinterest hiring Software Engineer, Fullstack in San Francisco, CA ",
    "content_text": "About Pinterest\n\nMillions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product.\n\nDiscover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility to do your best work. Creating a career you love? It’s Possible.\n\nWe are looking for inquisitive, well-rounded Full-stack engineers to join our engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.\n\nWhat You’ll Do\n\nBuild out full-stack Pinner-facing features to power the future of inspiration on PinterestContribute to and lead each step of the product development process, from ideation to implementation to release; from rapidly prototyping, running A/B tests, to architecting and building solutions that can scale to support millions of usersPartner with design, product, and backend teams to build end-to-end functionalityPut on your Pinner hat to suggest new product ideas and featuresEmploy automated testing to build features with a high degree of technical quality, taking responsibility for the components and features you developGrow as an engineer by working with world-class peers on varied and high impact projects\n\n\nWhat We’re Looking For\n\nBachelor’s degree in Computer Science, a related field or equivalent experience.1+ year of industry full-stack development experience, building consumer or business facing productsProficiency in one or more common backend and frontend tech stacks: e.g. Javascript, React, API, storage, caching and data processing.Experience in following best practices in writing reliable and maintainable code that may be used by many other engineersAbility to keep up-to-date with new technologies to understand what should be incorporatedStrong collaboration and communication skills\n\n\nFull-stack Monetization Engineering Teams\n\nMeasurement Foundation\n\nThis position is not eligible for relocation assistance.\n\nAt Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. This position will pay a base salary of $145,700 to $258,700. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.\n\nInformation regarding the culture at Pinterest and benefits available for this position can be found at https://www.pinterestcareers.com/pinterest-life/.\n\nAt Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.\n\nInformation regarding the culture at Pinterest and benefits available for this position can be found here.\n\nUS based applicants only\n\n$118,938—$244,872 USD\n\nOur Commitment To Inclusion\n\nPinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require a medical or religious accommodation during the job application process, please complete this form for support.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Pinterest<br><br></strong>Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product.<br><br>Discover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility to do your best work. Creating a career you love? It’s Possible.<br><br>We are looking for inquisitive, well-rounded Full-stack engineers to join our engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.<br><br><strong>What You’ll Do<br><br></strong><ul><li>Build out full-stack Pinner-facing features to power the future of inspiration on Pinterest</li><li>Contribute to and lead each step of the product development process, from ideation to implementation to release; from rapidly prototyping, running A/B tests, to architecting and building solutions that can scale to support millions of users</li><li>Partner with design, product, and backend teams to build end-to-end functionality</li><li>Put on your Pinner hat to suggest new product ideas and features</li><li>Employ automated testing to build features with a high degree of technical quality, taking responsibility for the components and features you develop</li><li>Grow as an engineer by working with world-class peers on varied and high impact projects<br><br><br></li></ul><strong>What We’re Looking For<br><br></strong><ul><li>Bachelor’s degree in Computer Science, a related field or equivalent experience.</li><li>1+ year of industry full-stack development experience, building consumer or business facing products</li><li>Proficiency in one or more common backend and frontend tech stacks: e.g. Javascript, React, API, storage, caching and data processing.</li><li>Experience in following best practices in writing reliable and maintainable code that may be used by many other engineers</li><li>Ability to keep up-to-date with new technologies to understand what should be incorporated</li><li>Strong collaboration and communication skills<br><br><br></li></ul><strong>Full-stack Monetization Engineering Teams<br><br></strong>Measurement Foundation<br><br>This position is not eligible for relocation assistance.<br><br>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. This position will pay a base salary of $145,700 to $258,700. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<br><br>Information regarding the culture at Pinterest and benefits available for this position can be found at https://www.pinterestcareers.com/pinterest-life/.<br><br>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<br><br><em>Information regarding the culture at Pinterest and benefits available for this position can be found here.<br><br></em>US based applicants only<br><br>$118,938—$244,872 USD<br><br><strong>Our Commitment To Inclusion<br><br></strong>Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require a medical or religious accommodation during the job application process, please complete this form for support.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-23T18:20:33.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Pinterest",
    "role": "Software Engineer, Fullstack",
    "location": "San Francisco, CA ",
    "contentPreview": "About Pinterest Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a...",
    "publishedDate": "2025-08-23",
    "relevanceScore": 85,
    "relevanceReason": "João is a strong match due to his 4+ years of full-stack experience, proficiency in relevant technologies like TypeScript and React, and experience leading teams. The role aligns with his career progression and includes growth opportunities within a well-established company.",
    "recommendation": "Apply",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, AWS\nKey Achievements:\n• Led the end-to-end delivery of features, encompassing task planning, API and UI development, database changes, cloud connections, testing, and documentation, directly contributing to product innovation.\n• Developed and expanded reusable API integrations for platforms like Salesforce and HubSpot, streamlining the development of new integrations and enhancing customization capabilities.\n• Mentored three engineers, facilitating their rapid onboarding and contribution by providing code reviews and pairing sessions, particularly on complex feature development.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, CSS, ThreeJS, .NET\nKey Achievements:\n• Spearheaded the implementation of an interactive 3D visualization, impressing stakeholders and leading to further feature expansion.\n• Led a team of four developers, providing tailored feedback and workflow organization that resulted in an estimated 50-100% increase in productivity, measured by reduced time for delivering user stories.\n• Collaborated with cross-functional teams to deliver a new user experience, highlighting an ability to translate product vision into actionable engineering tasks.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, HTML, CSS, .NET\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, allowing for faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, showcasing efficient project execution.\n• Collaborated with the team to optimize application performance and scalability, which is critical for a platform with millions of users.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, recognized by the community for solving a problem that other extensions could not, demonstrating an ability to identify and solve complex technical challenges.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a popular VS Code extension that addressed a key need within the React development community.\n• Received positive reviews and downloads, validating the effectiveness of the solution.\n• Demonstrated ability to create valuable tools for developers, improving their workflow and productivity.\n\n",
    "coverLetter": "I'm incredibly excited by the opportunity to join Pinterest and contribute to a platform that empowers millions to find inspiration and create a life they love. The mission resonates deeply with me, and I'm particularly drawn to Pinterest's commitment to innovation and the collaborative environment described in the job description. I'm eager to be part of a team that values courageous thinking and offers the chance to drive new initiatives from inception to release. \n\nWith over four years of full-stack experience, I'm well-equipped to build robust features and contribute to the end-to-end product development process. My experience at Suger, where I built reusable API integrations and mentored engineers, honed my ability to deliver high-quality, scalable solutions. Furthermore, my work optimizing performance for data-intensive dashboards demonstrates my capacity to tackle complex technical challenges. I'm confident in my ability to quickly integrate with your teams and contribute to creating delightful user experiences.\n\nI'm passionate about building user-facing features and embracing a collaborative environment. My experience leading teams and participating in the hiring process aligns perfectly with Pinterest's emphasis on teamwork and growth. I am a self-starter with a track record of delivering high-impact results, and I'm excited by the prospect of working alongside world-class peers on varied and impactful projects. I'm eager to contribute my skills to Pinterest's mission and to help build the future of inspiration. I look forward to discussing how I can contribute to your team's success.\n"
  }
]