[
  {
    "id": "8e700bf6c08fe59b25b5f42e34133132",
    "url": "https://ca.linkedin.com/jobs/view/product-manager-search-and-embeddings-at-cohere-4267608860",
    "title": "Cohere hiring Product Manager, Search and Embeddings in Toronto, Ontario, Canada ",
    "content_text": "Who are we?\n\nOur mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences like content generation, semantic search, RAG, and agents. We believe that our work is instrumental to the widespread adoption of AI.\n\nWe obsess over what we build. Each one of us is responsible for contributing to increasing the capabilities of our models and the value they drive for our customers. We like to work hard and move fast to do what’s best for our customers.\n\nCohere is a team of researchers, engineers, designers, and more, who are passionate about their craft. Each person is one of the best in the world at what they do. We believe that a diverse range of perspectives is a requirement for building great products.\n\nJoin us on our mission and shape the future!\n\nProduct Management At Cohere\n\nOur team is responsible for driving the direction of Cohere’s technology to the world through our interfaces. We’ve released generative models like Command A, Retrieval models like Embed 4 and Rerank 3.5, and products such as North and Compass. At Cohere, PMs work on the core models, APIs, and end-to-end products that serve our enterprises and developers.\n\nWe view the role that PMs play at Cohere to be “full-stack” in the sense that you will work with cross-functional stakeholders at every step of the way when training and evaluating the models, delivering product, ensuring successful GTM and customer happiness.\n\nAbout The Search And Embeddings Role\n\nOne of the most exciting applications for generative AI is in its use in Retrieval Augmented Generation (RAG) and Agents - Search and Embeddings plays a critical role in ensuring that LLMs have the correct context in order to answer the user needs. The focus of this PM will not only be on the role that search plays in RAG/Agents but also in traditional search. The expectation is that you have experience with working on Search products and Embedding / Cross-Encoder models.\n\nThe Search and Embedding PM manages the following models and products:\n\nEmbeddings (Embed-v4.0)Rerank (Rerank-v3.5) Compass (Cohere’s Search Solution) Evaluation of Search performance across all products and models\n\nIn This Role, You Will\n\nDefine strategic priorities and roadmap for improving retrieval model performance, focusing on enterprise needs and emerging capabilities. Use data and customer engagements to better understand user needs and guide future product and model development.Collaborate with a wide range of stakeholders, including teams in product, finance, go-to-market, engineering, and marketing.Drive product strategy and monetization through a deep understanding of the increasingly dynamic and competitive AI Landscape. Read lots of papers and collaborate with ML on ensuring our models remain SOTA\n\nIn order to be successful in this role, you have:\n\nAt least 4+ years of product management experience, understanding customer needs, and launching successful products.At least 1+ years of working on search products and embedding/reranking models.Obtained a Bachelor’s or postgrad degree in CS, ML or related field, or a background in machine learning, algorithms, large scale systems, and statistics.Have proven experience working in a technical environment with cross-functional teams to drive product vision, define requirements, and guide the team through key milestones.Showcase strong leadership, organizational, and execution skills, along with proven communication abilities.\n\nIf some of the above doesn’t line up perfectly with your experience, we still encourage you to apply! If you want to work really hard on a glorious mission with teammates that want the same thing, Cohere is the place for you.\n\nWe value and celebrate diversity and strive to create an inclusive work environment for all. We welcome applicants from all backgrounds and are committed to providing equal opportunities. Should you require any accommodations during the recruitment process, please submit an Accommodations Request Form, and we will work together to meet your needs.\n\nFull-Time Employees At Cohere Enjoy These Perks\n\n🤝 An open and inclusive culture and work environment\n\n🧑💻 Work closely with a team on the cutting edge of AI research\n\n🍽 Weekly lunch stipend, in-office lunches & snacks\n\n🦷 Full health and dental benefits, including a separate budget to take care of your mental health\n\n🐣 100% Parental Leave top-up for 6 months for employees based in Canada, the US, and the UK\n\n🎨 Personal enrichment benefits towards arts and culture, fitness and well-being, quality time, and workspace improvement\n\n🏙 Remote-flexible, offices in Toronto, New York, San Francisco and London and co-working stipend\n\n✈️ 6 weeks of vacation\n\nNote: This post is co-authored by both Cohere humans and Cohere technology.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Who are we?<br><br></strong>Our mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences like content generation, semantic search, RAG, and agents. We believe that our work is instrumental to the widespread adoption of AI.<br><br>We obsess over what we build. Each one of us is responsible for contributing to increasing the capabilities of our models and the value they drive for our customers. We like to work hard and move fast to do what’s best for our customers.<br><br>Cohere is a team of researchers, engineers, designers, and more, who are passionate about their craft. Each person is one of the best in the world at what they do. We believe that a diverse range of perspectives is a requirement for building great products.<br><br>Join us on our mission and shape the future!<br><br><strong>Product Management At Cohere<br><br></strong>Our team is responsible for driving the direction of Cohere’s technology to the world through our interfaces. We’ve released generative models like Command A, Retrieval models like Embed 4 and Rerank 3.5, and products such as North and Compass. At Cohere, PMs work on the core models, APIs, and end-to-end products that serve our enterprises and developers.<br><br>We view the role that PMs play at Cohere to be “full-stack” in the sense that you will work with cross-functional stakeholders at every step of the way when training and evaluating the models, delivering product, ensuring successful GTM and customer happiness.<br><br><strong>About The Search And Embeddings Role<br><br></strong>One of the most exciting applications for generative AI is in its use in Retrieval Augmented Generation (RAG) and Agents - Search and Embeddings plays a critical role in ensuring that LLMs have the correct context in order to answer the user needs. The focus of this PM will not only be on the role that search plays in RAG/Agents but also in traditional search. The expectation is that you have experience with working on Search products and Embedding / Cross-Encoder models.<br><br>The Search and Embedding PM manages the following models and products:<br><br><ul><li>Embeddings (Embed-v4.0)</li><li>Rerank (Rerank-v3.5) </li><li>Compass (Cohere’s Search Solution) </li><li>Evaluation of Search performance across all products and models<br><br></li></ul><strong>In This Role, You Will<br><br></strong><ul><li>Define strategic priorities and roadmap for improving retrieval model performance, focusing on enterprise needs and emerging capabilities. </li><li>Use data and customer engagements to better understand user needs and guide future product and model development.</li><li>Collaborate with a wide range of stakeholders, including teams in product, finance, go-to-market, engineering, and marketing.</li><li>Drive product strategy and monetization through a deep understanding of the increasingly dynamic and competitive AI Landscape. </li><li>Read lots of papers and collaborate with ML on ensuring our models remain SOTA<br><br></li></ul><strong>In order to be successful in this role, you have:<br><br></strong><ul><li>At least 4+ years of product management experience, understanding customer needs, and launching successful products.</li><li>At least 1+ years of working on search products and embedding/reranking models.</li><li>Obtained a Bachelor’s or postgrad degree in CS, ML or related field, or a background in machine learning, algorithms, large scale systems, and statistics.</li><li>Have proven experience working in a technical environment with cross-functional teams to drive product vision, define requirements, and guide the team through key milestones.</li><li>Showcase strong leadership, organizational, and execution skills, along with proven communication abilities.<br><br></li></ul>If some of the above doesn’t line up perfectly with your experience, we still encourage you to apply! If you want to work really hard on a glorious mission with teammates that want the same thing, Cohere is the place for you.<br><br>We value and celebrate diversity and strive to create an inclusive work environment for all. We welcome applicants from all backgrounds and are committed to providing equal opportunities. Should you require any accommodations during the recruitment process, please submit an Accommodations Request Form, and we will work together to meet your needs.<br><br><strong>Full-Time Employees At Cohere Enjoy These Perks<br><br></strong>🤝 An open and inclusive culture and work environment<br><br>🧑💻 Work closely with a team on the cutting edge of AI research<br><br>🍽 Weekly lunch stipend, in-office lunches & snacks<br><br>🦷 Full health and dental benefits, including a separate budget to take care of your mental health<br><br>🐣 100% Parental Leave top-up for 6 months for employees based in Canada, the US, and the UK<br><br>🎨 Personal enrichment benefits towards arts and culture, fitness and well-being, quality time, and workspace improvement<br><br>🏙 Remote-flexible, offices in Toronto, New York, San Francisco and London and co-working stipend<br><br>✈️ 6 weeks of vacation<br><br><em>Note: This post is co-authored by both Cohere humans and Cohere technology.</em></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T13:03:03.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Cohere",
    "role": "Product Manager, Search and Embeddings",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Who are we? Our mission is to scale intelligence to serve humanity. We’re training and deploying frontier models for developers and enterprises who are building AI systems to power magical experiences...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 55,
    "relevanceReason": "The candidate has a solid full-stack development background and experience in several relevant technologies like TypeScript and React, but the role is for a Product Manager specializing in Search and Embeddings which is outside of the candidate's skillset. The candidate's years of experience align with the role's requirements. The job is in Toronto, Canada, the location isn't an issue since the candidate is based on the remote.",
    "recommendation": "Consider",
    "estimatedCompensation": "120k-180k CAD/year",
    "yearsOfExperienceRequired": "4",
    "hardSkillsRequired": "Search products, Embedding/reranking models, CS, ML or related field",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "834a47c093afe14545509181e56ac27c",
    "url": "https://ca.linkedin.com/jobs/view/software-engineer-ii-android-at-pinterest-4291686989",
    "title": "Pinterest hiring Software Engineer II, Android in Toronto, Ontario, Canada ",
    "content_text": "About Pinterest\n\nMillions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product.\n\nDiscover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility to do your best work. Creating a career you love? It’s Possible.\n\nWe are looking for inquisitive, well-rounded Android engineers to join our platform Engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.\n\nWhat You’ll Do\n\nSupport millions of users and enable colleagues by ensuring excellence in core pieces that are shared throughout the applicationIdentify app-wide challenges; propose, test, and ship solutionsDrive changes that improve the entire app such as modularization, implementing image/video loading, RTL text, dependency injection, and reusable UI componentsEnable developers to work more effectively by improving app architecture, testing capabilities and release cyclesSolve hard-to-see user pain points that often affect the entire app such as performance, monitoring crash rates and solving user metric anomaliesGrow as a developer by working with world-class peers on varied and high impact projects\n\n\nWhat We’re Looking For\n\nBachelor’s degree in a relevant field such as Computer Science, or equivalent experience.Deep understanding of Android development and best practices in Kotlin and/or Java, e.g. Activity Lifecycle, memory management, etc.2+ years of industry Android application development experience, building consumer or business facing productsExperience in following best practices in writing reliable and maintainable code that may be used by many other engineersAbility to keep up-to-date with new technologies to understand what should be incorporatedStrong collaboration and communication skills\n\n\nIn-Office Requirement Statement\n\nWe let the type of work you do guide the collaboration style. That means we're not always working in an office, but we continue to gather for key moments of collaboration and connection.This role will need to be in the office for in-person collaboration 1-2 times/quarter and therefore can be situated anywhere in the country.\n\n\nRelocation Statement:\n\nThis position is not eligible for relocation assistance and candidates that apply should be based and legally authorized to work in Canada. Visit our PinFlex page to learn more about our working model.\n\n\nOur Commitment To Inclusion\n\nPinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require a medical or religious accommodation during the job application process, please complete this form for support.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Pinterest<br><br></strong>Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product.<br><br>Discover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility to do your best work. Creating a career you love? It’s Possible.<br><br>We are looking for inquisitive, well-rounded Android engineers to join our platform Engineering teams. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks & features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release.<br><br><strong>What You’ll Do<br><br></strong><ul><li>Support millions of users and enable colleagues by ensuring excellence in core pieces that are shared throughout the application</li><li>Identify app-wide challenges; propose, test, and ship solutions</li><li>Drive changes that improve the entire app such as modularization, implementing image/video loading, RTL text, dependency injection, and reusable UI components</li><li>Enable developers to work more effectively by improving app architecture, testing capabilities and release cycles</li><li>Solve hard-to-see user pain points that often affect the entire app such as performance, monitoring crash rates and solving user metric anomalies</li><li>Grow as a developer by working with world-class peers on varied and high impact projects<br><br><br></li></ul><strong>What We’re Looking For<br><br></strong><ul><li>Bachelor’s degree in a relevant field such as Computer Science, or equivalent experience.</li><li>Deep understanding of Android development and best practices in Kotlin and/or Java, e.g. Activity Lifecycle, memory management, etc.</li><li>2+ years of industry Android application development experience, building consumer or business facing products</li><li>Experience in following best practices in writing reliable and maintainable code that may be used by many other engineers</li><li>Ability to keep up-to-date with new technologies to understand what should be incorporated</li><li>Strong collaboration and communication skills<br><br><br></li></ul><strong>In-Office Requirement Statement<br><br></strong><ul><li>We let the type of work you do guide the collaboration style. That means we're not always working in an office, but we continue to gather for key moments of collaboration and connection.</li><li>This role will need to be in the office for in-person collaboration 1-2 times/quarter and therefore can be situated anywhere in the country.<br><br><br></li></ul><strong>Relocation Statement:<br><br></strong><ul><li>This position is not eligible for relocation assistance and candidates that apply should be based and legally authorized to work in Canada. Visit our PinFlex page to learn more about our working model.<br><br><br></li></ul><strong>Our Commitment To Inclusion<br><br></strong>Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require a medical or religious accommodation during the job application process, please complete this form for support.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T09:16:08.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Pinterest",
    "role": "Software Engineer II, Android",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "About Pinterest Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 45,
    "relevanceReason": "The role requires Android development expertise (Kotlin/Java) which is not present in the candidate's skillset, significantly lowering the technical skills match. While the candidate has strong full-stack experience and leadership skills, the lack of Android experience makes this a poor fit. The role also requires the candidate to be based in Canada and the candidate's location is not specified.",
    "recommendation": "Skip",
    "estimatedCompensation": "Not available",
    "yearsOfExperienceRequired": "2",
    "hardSkillsRequired": "Kotlin, Java, Android",
    "tailoredResume": "",
    "coverLetter": ""
  }
]