[
  {
    "id": "c94aee12952f2e25a3fd34d5b2c19816",
    "url": "https://ca.linkedin.com/jobs/view/frontend-developer-react-typescript-at-ludex-labs-4292029561",
    "title": "Ludex Labs hiring Frontend Developer - React Typescript in Montreal, Quebec, Canada ",
    "content_text": "Ludex Labs is a Montreal development studio that partners with a diverse range of clients to bring their digital projects to life. In addition to building high-quality products, we provide end-to-end project management support to ensure successful delivery.This role specifically focuses on working with clients in the iGaming (Crypto) industry, contributing to innovative and engaging projects in a fast-paced, evolving sector.\nRole DescriptionFront-End Developer specializing in React, NextJS, Typescript located in Montreal, QC. The Front-End Developer will be responsible for developing and maintaining the front-end services, ensuring the integrity and performance of web applications, and collaborating with back-end developers. Daily tasks will include coding, testing, and debugging programs, as well as contributing to system design and architecture.This is a full-time hybrid role, the team works on Tuesdays and Thursdays from home.Our frontend tech stack includes: React, NodeJS, Typescript, GraphQL, Prisma, PostgreSQL and Redis and more.\nQualificationsBachelors of Computer Science or related field or equivalent experience in software developmentAt least 2 year of experience in ReactJSAt least 2 year of experience in TypescriptInterest in web3 developmentExcellent problem-solving skills and attention to detailAbility to work both independently and as part of a team\nPreferred QualificationsExperience with GraphQL APIsExperience with a complex ReactJS state manager like redux with rxjs, or mobxExperience in NodeJS + expressJS backendExperience with relational databases and SQLExperience in web3 (solana or evm) development is a plusExperience with any other frontend framework is a plusCoursework or experience in cryptography is a plus",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>Ludex Labs is a Montreal development studio that partners with a diverse range of clients to bring their digital projects to life. In addition to building high-quality products, we provide end-to-end project management support to ensure successful delivery.This role specifically focuses on working with clients in the iGaming (Crypto) industry, contributing to innovative and engaging projects in a fast-paced, evolving sector.</p><p><br></p><p><strong>Role Description</strong></p><p>Front-End Developer specializing in <strong>React, NextJS, Typescript</strong> located in Montreal, QC. The Front-End Developer will be responsible for developing and maintaining the front-end services, ensuring the integrity and performance of web applications, and collaborating with back-end developers. Daily tasks will include coding, testing, and debugging programs, as well as contributing to system design and architecture.This is a full-time hybrid role, the team works on Tuesdays and Thursdays from home.Our frontend tech stack includes: React, NodeJS, Typescript, GraphQL, Prisma, PostgreSQL and Redis and more.</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelors of Computer Science or related field or equivalent experience in software development</li><li>At least 2 year of experience in ReactJS</li><li>At least 2 year of experience in Typescript</li><li>Interest in web3 development</li><li>Excellent problem-solving skills and attention to detail</li><li>Ability to work both independently and as part of a team</li></ul><p><br></p><p><strong>Preferred Qualifications</strong></p><ul><li>Experience with GraphQL APIs</li><li>Experience with a complex ReactJS state manager like redux with rxjs, or mobx</li><li>Experience in NodeJS + expressJS backend</li><li>Experience with relational databases and SQL</li><li>Experience in web3 (solana or evm) development is a plus</li><li>Experience with any other frontend framework is a plus</li><li>Coursework or experience in cryptography is a plus</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:06:28.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Ludex Labs",
    "role": "Frontend Developer - React Typescript",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "Ludex Labs is a Montreal development studio that partners with a diverse range of clients to bring their digital projects to life. In addition to building high-quality products, we provide end-to-end ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 85,
    "relevanceReason": "João's extensive experience in React and Typescript, coupled with his full-stack background, aligns very well with the job requirements. His experience with GraphQL and various backend technologies further enhances the match.  The role's focus on the iGaming industry is a slight divergence, but not a major detractor.",
    "recommendation": "Apply",
    "estimatedCompensation": "80k-120k CAD/year",
    "yearsOfExperienceRequired": "2",
    "hardSkillsRequired": "React, Typescript, GraphQL",
    "tailoredResume": "RELEVANT EXPERIENCE\nFull Stack Developer - Level IV\nRadix Engineering and Software | Sep. 2024–Oct. 2024\nTechnologies: React, Next JS, Typescript, GraphQL, Tailwind CSS\nKey Achievements:\n• Optimized performance and usability of a data visualization dashboard, crucial for the iGaming industry, using React and Next.js, by implementing caching, lazy loading, request splitting, and pre-fetching, resulting in up to a 95% reduction in request duration and significant improvements in user experience.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: React, Typescript, ThreeJS, Tailwind CSS, HTML\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, showcasing data contextualization. Successfully led a team of four developers by providing tailored feedback, helping team members to achieve an estimated 50% to 100% increase in productivity.\n• Applied React and Typescript to develop and maintain front-end services.\n\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, Postgres, AWS, HTML\nKey Achievements:\n• Built reusable API integrations, improving development efficiency. Built and delivered full-stack features, which included front-end and back-end implementation.\n• Participated in the hiring process by interviewing, evaluating, and participating in the hiring decision of candidates\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines on Azure DevOps, enabling faster testing cycles and eliminating deployment errors.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: React, Typescript, VS Code API\nKey Achievements:\n• Developed a VS Code extension in React and Typescript, showcasing strong front-end and Typescript skills.\n• Demonstrated proficiency in React by building a feature-rich and highly rated extension.\n• Successfully addressed a specific developer need, demonstrating problem-solving skills.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Frontend Developer position at Ludex Labs, as advertised on [Platform where you saw the ad]. The opportunity to contribute to innovative projects within the iGaming (Crypto) industry, coupled with Ludex Labs' commitment to delivering high-quality digital solutions, deeply resonates with my professional goals. I am particularly drawn to your focus on end-to-end project management and the opportunity to work in a fast-paced, evolving sector in Montreal, a city I am eager to work in.\n\nWith over four years of experience building and maintaining front-end services using React and Typescript, I am confident in my ability to significantly contribute to your team. My experience in optimizing performance and usability, such as my work at Radix Engineering and Software where I improved dashboard performance, demonstrates my ability to deliver performant and engaging user experiences. Furthermore, my experience with GraphQL APIs and relational databases will allow me to integrate seamlessly within your tech stack. My experience leading development teams, as I did at Radix, will ensure I can provide value to the team.\n\nI am eager to become a part of the Ludex Labs team, contributing to your collaborative and results-driven environment. My passion for problem-solving, paired with my experience working both independently and as part of a team, aligns well with your hybrid work model. I am excited by the prospect of contributing to the iGaming (Crypto) industry, and I believe my skills and enthusiasm make me a strong candidate. I am available for an interview at your earliest convenience to discuss how I can help Ludex Labs succeed. Thank you for your time and consideration."
  },
  {
    "id": "3441083cd6ead7cc0a79a2a8b8c4c1fc",
    "url": "https://ca.linkedin.com/jobs/view/net-fullstack-developer-at-techso-4292023871",
    "title": "Techso hiring .NET Fullstack Developer in Montreal, Quebec, Canada ",
    "content_text": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).\n\nFounded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.\n\nTechso is looking to expand its development team. You will work as a .NET Developer to meet the needs of our customers based in Montreal and internationally.\n\nResponsibilities\n\nAs part of your duties, you will participate in the design and development of our customers' projects (new applications, development of new functionalities on existing applications, problem correction and maintenance, ...).Following a needs analysis, you will help define the architecture of innovative solutions to meet our customers' objectives and requirements.You will be responsible for defining technical and functional specifications.You will participate in the evaluation of development efforts for new solutions or improvements.You will put developed solutions into production and manage change.You will take part in management's pre-sales efforts (effort evaluations, technology analysis, etc.).You will guarantee the highest development standards by following the software development cycle (code review, unit testing, etc.).You will support the continuous improvement of development activities (agility, code assembly, automated testing, deployment, etc.).You will provide support to your colleagues and help mentor more junior ones.You will keep abreast of new solutions and technologies on the market.You will work with Agile - Scrum teams.\n\nSkills Required\n\nBachelor's degree in computer science or softwareMinimum 6 years' experience with Microsoft .Net C#, ASP.NET, Web API technologiesSolid knowledge of Front-End development (React, Angular, VueJS, ...)Strong relational database skills (use of ORMs and DAOs such as Entity Framework, SQL language, ETL, etc.). Knowledge of noSQL databases a plusGood knowledge of basic DevOps concepts (Azure DevOps is a plus)Knowledge of other programming languages: Java, PHP, Node.JS, Python...Knowledge of: MAUI, Xamarin and Telerik are a valuable assetUsed to working in an Agile and collaborative environmentKnowledge of Linux and Windows environmentsMobile for assignments in the Montreal areaAbility to communicate in English, both orally and in writing, as some of your customers will be English-speakingGood interpersonal skills and a love of teamwork!\n\nBenefits\n\nA hybrid telecommuting policy (we adapt to the customer)A beautiful workspace located in the heart of Old Montreal with a terraceBreakfast, coffee, snacks and beer available in the officeAn active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).The opportunity to get involved in great internal projectsA team of experts to share their expertise with youPrivate group insurance",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).<br><br>Founded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.<br><br>Techso is looking to expand its development team. You will work as a .NET Developer to meet the needs of our customers based in Montreal and internationally.<br><br><strong>Responsibilities<br><br></strong><ul><li>As part of your duties, you will participate in the design and development of our customers' projects (new applications, development of new functionalities on existing applications, problem correction and maintenance, ...).</li><li>Following a needs analysis, you will help define the architecture of innovative solutions to meet our customers' objectives and requirements.</li><li>You will be responsible for defining technical and functional specifications.</li><li>You will participate in the evaluation of development efforts for new solutions or improvements.</li><li>You will put developed solutions into production and manage change.</li><li>You will take part in management's pre-sales efforts (effort evaluations, technology analysis, etc.).</li><li>You will guarantee the highest development standards by following the software development cycle (code review, unit testing, etc.).</li><li>You will support the continuous improvement of development activities (agility, code assembly, automated testing, deployment, etc.).</li><li>You will provide support to your colleagues and help mentor more junior ones.</li><li>You will keep abreast of new solutions and technologies on the market.</li><li>You will work with Agile - Scrum teams.<br><br></li></ul><strong>Skills Required<br><br></strong><ul><li>Bachelor's degree in computer science or software</li><li>Minimum 6 years' experience with Microsoft .Net C#, ASP.NET, Web API technologies</li><li>Solid knowledge of Front-End development (React, Angular, VueJS, ...)</li><li>Strong relational database skills (use of ORMs and DAOs such as Entity Framework, SQL language, ETL, etc.). Knowledge of noSQL databases a plus</li><li>Good knowledge of basic DevOps concepts (Azure DevOps is a plus)</li><li>Knowledge of other programming languages: Java, PHP, Node.JS, Python...</li><li>Knowledge of: MAUI, Xamarin and Telerik are a valuable asset</li><li>Used to working in an Agile and collaborative environment</li><li>Knowledge of Linux and Windows environments</li><li>Mobile for assignments in the Montreal area</li><li>Ability to communicate in English, both orally and in writing, as some of your customers will be English-speaking</li><li>Good interpersonal skills and a love of teamwork!<br><br></li></ul><strong>Benefits<br><br></strong><ul><li>A hybrid telecommuting policy (we adapt to the customer)</li><li>A beautiful workspace located in the heart of Old Montreal with a terrace</li><li>Breakfast, coffee, snacks and beer available in the office</li><li>An active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).</li><li>The opportunity to get involved in great internal projects</li><li>A team of experts to share their expertise with you</li><li>Private group insurance</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:49.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": ".NET Fullstack Developer",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application d...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 85,
    "relevanceReason": "João's extensive experience with .NET, React, and SQL aligns well with the job requirements. His experience mentoring junior developers and his proficiency in English also contribute to a strong match. The role is a good fit for his skills and experience in full-stack development.",
    "recommendation": "Apply",
    "estimatedCompensation": "85k-110k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": ".NET, C#, React",
    "tailoredResume": "RELEVANT EXPERIENCE\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: C#, .NET, React, Typescript, MS SQL\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, exceeding stakeholder expectations and demonstrating the ability to define and deliver innovative solutions.\n• Led a team of four developers, providing tailored feedback and mentorship to enhance performance and understanding of requirements, resulting in a 50-100% increase in team productivity and faster user story delivery.\n• Collaborated with stakeholders to define technical and functional specifications for the 3D visualization project.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: C#, .NET, React, Typescript, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors, contributing to continuous improvement of development activities.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, demonstrating effective project management and meeting client objectives.\n\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Golang, Postgres, AWS\nKey Achievements:\n• Planned and delivered features end-to-end, including task planning, API development, UI design, database changes, and cloud connections, demonstrating experience across the software development cycle.\n• Built reusable API integrations, showcasing the ability to contribute to development efforts and support colleagues.\n• Ran technical interviews and mentored junior engineers, showing experience in code review, mentoring and participating in the hiring decision\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension for refactoring React components, praised for fixing problems larger extensions could not.\nTechnologies: React, Typescript, VS Code API\nKey Achievements:\n• Developed and maintained a VS Code extension, demonstrating proactive problem-solving and the ability to identify and address community needs.\n• Built a tool that solved a problem the community was facing and that was not solved by larger extensions, indicating ability to create innovative solutions.\n• Managed an open source project with over 25 stars on Github, highlighting project management skills.\n\n",
    "coverLetter": "I am writing to express my strong interest in the .NET Fullstack Developer position at Techso, as advertised. As a Software Engineer with over four years of experience, I'm particularly drawn to Techso’s commitment to digital transformation and its work with prestigious clients across various sectors. The opportunity to contribute to innovative solutions, from new applications to existing enhancements, within a fast-growing company aligns perfectly with my career aspirations. I am eager to apply my skills to meet and exceed the needs of your Montreal-based and international clientele.\n\nMy experience allows me to bring substantial value to Techso. For example, I have optimized application performance and usability, significantly improving user experience while reducing resource consumption. I have led teams, providing tailored feedback to enhance performance and foster a collaborative environment. My expertise with .NET C#, ASP.NET, and Web API technologies, combined with my strong Front-End development skills in React, will enable me to contribute to the design, development, and maintenance of high-quality solutions. Moreover, my proficiency in Agile-Scrum methodologies ensures seamless collaboration within your teams.\n\nI am confident I would be a great cultural fit and team member. I've consistently supported continuous improvement in development activities, mentoring junior engineers and striving for the highest development standards. My passion for technology and dedication to producing high-quality work, combined with my strong communication and interpersonal skills, makes me an effective collaborator. I am excited about the prospect of joining Techso's dynamic team and contributing to its continued success. I am available for an interview at your earliest convenience."
  },
  {
    "id": "10a77df80dc0fd7e6be874be5b4494c4",
    "url": "https://ca.linkedin.com/jobs/view/data-scientist-customer-engineering-at-datarobot-4290307730",
    "title": "DataRobot hiring Data Scientist, Customer Engineering in Greater Toronto Area, Canada ",
    "content_text": "Job Description:\n\nDataRobot delivers AI that maximizes impact and minimizes business risk. Our platform and applications integrate into core business processes so teams can develop, deliver, and govern AI at scale. DataRobot empowers practitioners to deliver predictive and generative AI, and enables leaders to secure their AI assets. Organizations worldwide rely on DataRobot for AI that makes sense for their business — today and in the future.\n\nJob Description\n\nThe Data Scientist role in the Customer Engineering team plays a pivotal role at the intersection of AI/ML engineering, solution development, and go-to-market strategy. We are looking for an experienced data scientist who excels in hands-on problem-solving, can lead technical initiatives, and can serve as a trusted advisor to both internal teams and customers.\n\nYour work will focus on designing, developing, and delivering production-ready AI solutions that accelerate customer adoption of the DataRobot platform, with a particular focus on SAP workflows.\n\nBeyond solution development, you will work directly with clients in various industries as the DataRobot product and data science subject matter expert.\n\nThis role is ideal for a motivated data scientist with proven experience who wants to work hands-on with Python, pandas, and modern AI tooling while making a significant impact on customer success and AI adoption. If you thrive in a fast-paced, highly autonomous environment and want to build AI solutions that truly scale, we'd love to hear from you!\n\nKey Responsibilities:\n\n\nDesign and develop sophisticated, production-ready assets that accelerate AI/ML adoption for customers, ranging from reusable solution templates to deployable frameworks.Lead the implementation of AI/ML workflows using Python, pandas, and modern AI tooling, ensuring they are scalable, maintainable, and customer-ready.Establish and champion engineering best practices to improve performance, scalability, and maintainability of AI/ML solutions.Work within existing infrastructure to support scalable AI deployments, including CI/CD automation, API integrations, and containerized environments (Docker, Kubernetes).Create comprehensive testing strategies and implement automated tests for AI/ML workflows.Lead cross-functional collaboration with product, sales, and marketing teams to scale high-impact solutions.Address complex real-world deployment challenges, including monitoring, logging, and improving reliability in AI/ML workflows.Serve as a technical liaison in customer engagements, representing the DataRobot product to various personas from data scientists to C-level executives.Lead proof of value processes and quantify the business impact of DataRobot solutions.Ensure the success of our customers by collaborating with business stakeholders to ensure that AI solutions deliver successful business outcomesStay ahead of industry trends, continuously refining our approaches and advocating for best practices in AI/ML engineering.Work closely with enablement teams to develop documentation, content, and training materials that scale adoption of our solutions.\n\n\nWhat this Role is Not:\n\n\nA SWAT demo team - while you will be customer-facing, this role is about building reusable solutions, not one-off demos.A technical marketing role - you'll collaborate with marketing but won't be driving content strategy.A pure research role - we need hands-on builders who can ship working solutions that make an impact.\n\n\nKnowledge, Skills and Abilities:\n\n\nStrong Python ecosystem expertise with the ability to design, develop, and troubleshoot complex ML workflows using libraries like pandas, NumPy, scikit-learn, and web server tools like FastAPI.3-5 years of experience in data science, machine learning, or AI development with a proven track record of delivering production solutions.Experience with ML model development, deployment, and evaluation. You should be comfortable leading data-to-insights projects and optimizing predictive models.Strong data engineering capabilities, including working with structured/unstructured data, feature engineering, and optimizing ML pipelines.Proficiency in writing efficient, maintainable, and well-structured code, with an emphasis on reusability, scalability, and production readiness.Experience with software engineering best practices, including containerization (Docker), CI/CD automation, and cloud-based ML deployment.Experience with APIs, SDK development, or ML platform integrations.Proven experience in consultative sales processes in the data/analytics marketplace, with the ability to translate complex technical concepts into business value.Excellent communication skills, with the ability to influence stakeholders at various technical and business levels.Self-motivated, driven, and eager to take on challenges. We're looking for someone who thrives in a fast-moving, high-growth, and high-autonomy environment.\n\n\nNice to Have:\n\n\nExperience with SAP workflows and integration pointsExperience with cloud platforms (AWS, Azure, GCP) for AI/ML deploymentStrong knowledge of automated testing and test-driven developmentFamiliarity with generative AI solutions like RAG, finetuning, etc.Experience with DataRobot platform or similar enterprise AI platformsMasters' degree in Data Science, Computer Science, or related fieldExperience presenting at conferences or creating technical content\n\n\nWhy Join Us?\n\n\nHands-on, high-impact work - you'll be building real, production-ready AI solutions that customers actually use.Small, elite team with direct influence - you'll work closely with product, engineering, and go-to-market teams to shape AI adoption strategies.Fast learning environment - we invest in our people, providing opportunities to grow and expand your skills.Clear career trajectory - whether you want to specialize in data science, transition into engineering, or take on leadership, we'll help you get there.Work on cutting-edge AI solutions that have real-world impact and are used by enterprises worldwide.\n\n\nThis is a unique opportunity to build AI applications, ensuring that data scientists and developers can seamlessly create, customize, and deploy AI solutions at scale. If you're passionate about impacting the future of AI adoption, we'd love to hear from you.\n\nThe talent and dedication of our employees are at the core of DataRobot’s journey to be an iconic company. We strive to attract and retain the best talent by providing competitive pay and benefits with our employees’ well-being at the core. Here’s what your benefits package may include depending on your location and local legal requirements: Medical, Dental & Vision Insurance, Flexible Time Off Program, Paid Holidays, Paid Parental Leave, Global Employee Assistance Program (EAP) and more!\n\nDataRobot Operating Principles:\n\n\nWow Our CustomersSet High StandardsBe Better Than YesterdayBe RigorousAssume Positive IntentHave the Tough ConversationsBe Better TogetherDebate, Decide, CommitDeliver ResultsOvercommunicate\n\n\nResearch shows that many women only apply to jobs when they meet 100% of the qualifications while many men apply to jobs when they meet 60%. At DataRobot we encourage ALL candidates, especially women, people of color, LGBTQ+ identifying people, differently abled, and other people from marginalized groups to apply to our jobs, even if you do not check every box. We’d love to have a conversation with you and see if you might be a great fit.\n\nDataRobot is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. DataRobot is committed to working with and providing reasonable accommodations to applicants with physical and mental disabilities. Please see the United States Department of Labor’s EEO poster and EEO poster supplement for additional information.\n\nAll applicant data submitted is handled in accordance with our Applicant Privacy Policy.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Job Description:<br><br></strong>DataRobot delivers AI that maximizes impact and minimizes business risk. Our platform and applications integrate into core business processes so teams can develop, deliver, and govern AI at scale. DataRobot empowers practitioners to deliver predictive and generative AI, and enables leaders to secure their AI assets. Organizations worldwide rely on DataRobot for AI that makes sense for their business — today and in the future.<br><br><strong>Job Description<br><br></strong>The Data Scientist role in the Customer Engineering team plays a pivotal role at the intersection of AI/ML engineering, solution development, and go-to-market strategy. We are looking for an experienced data scientist who excels in hands-on problem-solving, can lead technical initiatives, and can serve as a trusted advisor to both internal teams and customers.<br><br>Your work will focus on designing, developing, and delivering production-ready AI solutions that accelerate customer adoption of the DataRobot platform, with a particular focus on SAP workflows.<br><br>Beyond solution development, you will work directly with clients in various industries as the DataRobot product and data science subject matter expert.<br><br>This role is ideal for a motivated data scientist with proven experience who wants to work hands-on with Python, pandas, and modern AI tooling while making a significant impact on customer success and AI adoption. If you thrive in a fast-paced, highly autonomous environment and want to build AI solutions that truly scale, we'd love to hear from you!<br><br><strong>Key Responsibilities:<br><br><br></strong><ul><li>Design and develop sophisticated, production-ready assets that accelerate AI/ML adoption for customers, ranging from reusable solution templates to deployable frameworks.</li><li>Lead the implementation of AI/ML workflows using Python, pandas, and modern AI tooling, ensuring they are scalable, maintainable, and customer-ready.</li><li>Establish and champion engineering best practices to improve performance, scalability, and maintainability of AI/ML solutions.</li><li>Work within existing infrastructure to support scalable AI deployments, including CI/CD automation, API integrations, and containerized environments (Docker, Kubernetes).</li><li>Create comprehensive testing strategies and implement automated tests for AI/ML workflows.</li><li>Lead cross-functional collaboration with product, sales, and marketing teams to scale high-impact solutions.</li><li>Address complex real-world deployment challenges, including monitoring, logging, and improving reliability in AI/ML workflows.</li><li>Serve as a technical liaison in customer engagements, representing the DataRobot product to various personas from data scientists to C-level executives.</li><li>Lead proof of value processes and quantify the business impact of DataRobot solutions.</li><li>Ensure the success of our customers by collaborating with business stakeholders to ensure that AI solutions deliver successful business outcomes</li><li>Stay ahead of industry trends, continuously refining our approaches and advocating for best practices in AI/ML engineering.</li><li>Work closely with enablement teams to develop documentation, content, and training materials that scale adoption of our solutions.<br><br><br></li></ul><strong>What this Role is Not:<br><br><br></strong><ul><li>A SWAT demo team - while you will be customer-facing, this role is about building reusable solutions, not one-off demos.</li><li>A technical marketing role - you'll collaborate with marketing but won't be driving content strategy.</li><li>A pure research role - we need hands-on builders who can ship working solutions that make an impact.<br><br><br></li></ul><strong>Knowledge, Skills and Abilities:<br><br><br></strong><ul><li>Strong Python ecosystem expertise with the ability to design, develop, and troubleshoot complex ML workflows using libraries like pandas, NumPy, scikit-learn, and web server tools like FastAPI.</li><li>3-5 years of experience in data science, machine learning, or AI development with a proven track record of delivering production solutions.</li><li>Experience with ML model development, deployment, and evaluation. You should be comfortable leading data-to-insights projects and optimizing predictive models.</li><li>Strong data engineering capabilities, including working with structured/unstructured data, feature engineering, and optimizing ML pipelines.</li><li>Proficiency in writing efficient, maintainable, and well-structured code, with an emphasis on reusability, scalability, and production readiness.</li><li>Experience with software engineering best practices, including containerization (Docker), CI/CD automation, and cloud-based ML deployment.</li><li>Experience with APIs, SDK development, or ML platform integrations.</li><li>Proven experience in consultative sales processes in the data/analytics marketplace, with the ability to translate complex technical concepts into business value.</li><li>Excellent communication skills, with the ability to influence stakeholders at various technical and business levels.</li><li>Self-motivated, driven, and eager to take on challenges. We're looking for someone who thrives in a fast-moving, high-growth, and high-autonomy environment.<br><br><br></li></ul><strong>Nice to Have:<br><br><br></strong><ul><li>Experience with SAP workflows and integration points</li><li>Experience with cloud platforms (AWS, Azure, GCP) for AI/ML deployment</li><li>Strong knowledge of automated testing and test-driven development</li><li>Familiarity with generative AI solutions like RAG, finetuning, etc.</li><li>Experience with DataRobot platform or similar enterprise AI platforms</li><li>Masters' degree in Data Science, Computer Science, or related field</li><li>Experience presenting at conferences or creating technical content<br><br><br></li></ul><strong>Why Join Us?<br><br><br></strong><ul><li>Hands-on, high-impact work - you'll be building real, production-ready AI solutions that customers actually use.</li><li>Small, elite team with direct influence - you'll work closely with product, engineering, and go-to-market teams to shape AI adoption strategies.</li><li>Fast learning environment - we invest in our people, providing opportunities to grow and expand your skills.</li><li>Clear career trajectory - whether you want to specialize in data science, transition into engineering, or take on leadership, we'll help you get there.</li><li>Work on cutting-edge AI solutions that have real-world impact and are used by enterprises worldwide.<br><br><br></li></ul>This is a unique opportunity to build AI applications, ensuring that data scientists and developers can seamlessly create, customize, and deploy AI solutions at scale. If you're passionate about impacting the future of AI adoption, we'd love to hear from you.<br><br>The talent and dedication of our employees are at the core of DataRobot’s journey to be an iconic company. We strive to attract and retain the best talent by providing competitive pay and benefits with our employees’ well-being at the core. Here’s what your benefits package may include depending on your location and local legal requirements: Medical, Dental & Vision Insurance, Flexible Time Off Program, Paid Holidays, Paid Parental Leave, Global Employee Assistance Program (EAP) and more!<br><br><strong>DataRobot Operating Principles:<br><br><br></strong><ul><li>Wow Our Customers</li><li>Set High Standards</li><li>Be Better Than Yesterday</li><li>Be Rigorous</li><li>Assume Positive Intent</li><li>Have the Tough Conversations</li><li>Be Better Together</li><li>Debate, Decide, Commit</li><li>Deliver Results</li><li>Overcommunicate<br><br><br></li></ul>Research shows that many women only apply to jobs when they meet 100% of the qualifications while many men apply to jobs when they meet 60%. <strong>At DataRobot we encourage ALL candidates, especially women, people of color, LGBTQ+ identifying people, differently abled, and other people from marginalized groups to apply to our jobs, even if you do not check every box.</strong> We’d love to have a conversation with you and see if you might be a great fit.<br><br>DataRobot is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. DataRobot is committed to working with and providing reasonable accommodations to applicants with physical and mental disabilities. Please see the United States Department of Labor’s EEO poster and EEO poster supplement for additional information.<br><br>All applicant data submitted is handled in accordance with our Applicant Privacy Policy.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:08:49.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "DataRobot",
    "role": "Data Scientist, Customer Engineering",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "Job Description: DataRobot delivers AI that maximizes impact and minimizes business risk. Our platform and applications integrate into core business processes so teams can develop, deliver, and govern...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 78,
    "relevanceReason": "This role aligns well with the candidate's experience in data science, machine learning, and full-stack development. The candidate's proficiency in Python, experience with cloud platforms (AWS, Azure), and understanding of software engineering best practices provide a solid foundation. The candidate's leadership experience and ability to translate technical concepts into business value also match the requirements.",
    "recommendation": "Consider",
    "estimatedCompensation": "120k-180k CAD/year",
    "yearsOfExperienceRequired": "3",
    "hardSkillsRequired": "Python, pandas, machine learning, cloud platforms",
    "tailoredResume": "RELEVANT EXPERIENCE\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, Tailwind CSS, ThreeJS\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, demonstrating expertise in developing complex, data-driven solutions. This resulted in increased data contextualization and positive stakeholder feedback, mirroring the design and development of production-ready AI solutions.\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow, while also aiding in comprehension of requirements and their implications. This is aligned with the role's need to be a trusted advisor to both internal teams and customers.\n• Improved team productivity by an estimated 50% to 100%, a key metric of success in developing scalable and maintainable AI/ML solutions.\n\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, Golang, Postgres, AWS\nKey Achievements:\n• Built and incremented reusable API integrations for various platforms, demonstrating an ability to design and develop modular solutions, similar to the development of solution templates and deployable frameworks.\n• Onboarded and mentored three engineers, providing technical guidance and support, which is transferable to the customer-facing aspects of this role.\n\nFull Stack Developer - Level IV\nRadix Engineering and Software | Sep. 2024–Oct. 2024\nTechnologies: Typescript, Next JS, React, Javascript, Tailwind CSS, GraphQL, ThreeJS\nKey Achievements:\n• Optimized performance and usability of a dashboard displaying industrial data with multiple charts. This experience aligns with the data-driven focus of the role and showcases skills in improving the performance of AI/ML solutions.\n• Used strategies like caching and lazy loading to improve memory consumption and request optimization to reduce request duration. This is analogous to establishing engineering best practices to improve the performance of AI/ML solutions.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, Redux, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors. This experience aligns with establishing engineering best practices to improve the performance of AI/ML solutions and will lead to customer success\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, showcasing project management and time management skills in the development of AI/ML solutions.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension that received positive community feedback, showcasing ability to solve technical problems and attention to detail\n• Demonstrates ability to design, and develop solutions with strong focus on customer needs\n\n",
    "coverLetter": "I am writing to express my keen interest in the Data Scientist, Customer Engineering role at DataRobot, as advertised on [Platform where you saw the job posting]. DataRobot’s mission to deliver AI that maximizes impact and minimizes business risk resonates deeply with my own professional aspirations. I am particularly drawn to the opportunity to contribute to the development and deployment of production-ready AI solutions, especially those focused on SAP workflows, as this aligns perfectly with my experience in building scalable and maintainable solutions.\n\nMy experience in full-stack development, combined with my proficiency in Python, pandas, and modern AI tooling, allows me to quickly design, develop, and implement sophisticated AI/ML workflows. In my previous role at Suger, I built and incremented reusable API integrations, and at Radix Engineering and Software I led the implementation of a new interactive 3D visualization, demonstrating my ability to lead technical initiatives and deliver impactful results. I'm confident I can quickly become a trusted advisor, working hands-on to drive customer success and accelerate AI adoption within DataRobot.\n\nI thrive in fast-paced, autonomous environments and am eager to contribute to a collaborative team. My experience mentoring junior engineers and leading development efforts, as well as my strong communication skills, allow me to seamlessly integrate with new teams and projects. The opportunity to make a significant impact on AI adoption aligns perfectly with my passion for building AI solutions that truly scale. I am excited by the prospect of contributing to DataRobot’s future success and would welcome the opportunity to discuss how my skills and experience can benefit your team. Thank you for your time and consideration."
  },
  {
    "id": "373d046feec40513f5dac92405d76782",
    "url": "https://ca.linkedin.com/jobs/view/java-fullstack-developer-at-techso-4292025675",
    "title": "Techso hiring Java fullstack developer in Montreal, Quebec, Canada ",
    "content_text": "A world leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).\n\nFounded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.\n\nTechso is looking to expand its development team. You will work as a Java developer to meet the needs of our customers based in Canada.\n\nResponsibilities\n\nAs part of your duties, you will participate in the design and development of our customers' projects (new applications, development of new functionalities on existing applications, problem correction and maintenance, etc.).Following a needs analysis, you will help define the architecture of innovative solutions to meet our customers' objectives and requirements.You will be responsible for defining technical and functional specifications.You will participate in the evaluation of development efforts for new solutions or improvements.You will put developed solutions into production and manage change.You will take part in management's pre-sales efforts (effort evaluations, technology analysis, etc.).You will guarantee the highest development standards by following the software development cycle (code review, unit testing, etc.).You will support the continuous improvement of development activities (agility, code assembly, automated testing, deployment, etc.).You will provide support to your colleagues and help mentor more junior ones.You will keep abreast of new solutions and technologies on the market.You will work with Agile - Scrum teams.\n\nSkills Required\n\nBachelor's degree in computer science or softwareMinimum 6 years' experience in Java developmentSolid knowledge of object-oriented development in Java and Springboot framework Solid knowledge of Front-End development (React, Angular, VueJS, etc.)Strong relational database skills (use of ORMs and DAOs such as Hibernate, SQL language, ETL, etc.). Knowledge of noSQL databases a plusGood knowledge of basic DevOps concepts (Azure DevOps is a plus)Knowledge of other programming languages: C#, PHP, Node.JS, PythonUsed to working in an Agile and collaborative environmentKnowledge of Linux and Windows environmentsGood communication skills in English and French, both written and spoken, as some of our customers will be English or French speakers.Good interpersonal skills and a love of teamwork!\n\nBenefits\n\nA hybrid telecommuting policy: we adapt to our clients' needsBeautiful workspace located in the heart of Old Montreal, with a terraceBreakfast, coffee, snacks and beer available in the officeAn active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).The opportunity to travel - a lump sum for mobile consultantsThe opportunity to get involved in exciting in-house projectsA team of experts to share their expertise with youPossession of a driver's licensePrivate group insurance",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>A world leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).<br><br>Founded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.<br><br>Techso is looking to expand its development team. You will work as a Java developer to meet the needs of our customers based in Canada.<br><br><strong>Responsibilities<br><br></strong><ul><li>As part of your duties, you will participate in the design and development of our customers' projects (new applications, development of new functionalities on existing applications, problem correction and maintenance, etc.).</li><li>Following a needs analysis, you will help define the architecture of innovative solutions to meet our customers' objectives and requirements.</li><li>You will be responsible for defining technical and functional specifications.</li><li>You will participate in the evaluation of development efforts for new solutions or improvements.</li><li>You will put developed solutions into production and manage change.</li><li>You will take part in management's pre-sales efforts (effort evaluations, technology analysis, etc.).</li><li>You will guarantee the highest development standards by following the software development cycle (code review, unit testing, etc.).</li><li>You will support the continuous improvement of development activities (agility, code assembly, automated testing, deployment, etc.).</li><li>You will provide support to your colleagues and help mentor more junior ones.</li><li>You will keep abreast of new solutions and technologies on the market.</li><li>You will work with Agile - Scrum teams.<br><br></li></ul><strong>Skills Required<br><br></strong><ul><li>Bachelor's degree in computer science or software</li><li>Minimum 6 years' experience in Java development</li><li>Solid knowledge of object-oriented development in Java and Springboot framework </li><li>Solid knowledge of Front-End development (React, Angular, VueJS, etc.)</li><li>Strong relational database skills (use of ORMs and DAOs such as Hibernate, SQL language, ETL, etc.). Knowledge of noSQL databases a plus</li><li>Good knowledge of basic DevOps concepts (Azure DevOps is a plus)</li><li>Knowledge of other programming languages: C#, PHP, Node.JS, Python</li><li>Used to working in an Agile and collaborative environment</li><li>Knowledge of Linux and Windows environments</li><li>Good communication skills in English and French, both written and spoken, as some of our customers will be English or French speakers.</li><li>Good interpersonal skills and a love of teamwork!<br><br></li></ul><strong>Benefits<br><br></strong><ul><li>A hybrid telecommuting policy: we adapt to our clients' needs</li><li>Beautiful workspace located in the heart of Old Montreal, with a terrace</li><li>Breakfast, coffee, snacks and beer available in the office</li><li>An active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).</li><li>The opportunity to travel - a lump sum for mobile consultants</li><li>The opportunity to get involved in exciting in-house projects</li><li>A team of experts to share their expertise with you</li><li>Possession of a driver's license</li><li>Private group insurance</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:47.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": "Java fullstack developer",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "A world leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application de...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 75,
    "relevanceReason": "The candidate's full-stack experience and React/Typescript proficiency align well with the job requirements. While the role focuses on Java and Springboot, the candidate's skills in related frontend technologies, DevOps concepts, and leadership experience offer good transferable skills.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-110k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "Java, Springboot, React",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, Golang, Postgres, AWS\nKey Achievements:\n• Designed and delivered full-stack features, including APIs, UIs, and database changes, demonstrating end-to-end project ownership.\n• Built and maintained reusable API integrations for various platforms, streamlining development and improving integration efficiency.\n• Conducted technical interviews, evaluated candidates, and contributed to hiring decisions, showcasing leadership and team-building skills.\n• Onboarded and mentored junior engineers, providing code reviews and guidance to accelerate their contributions and promote knowledge sharing.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, CSS, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers in the implementation of a new interactive 3D visualization, providing tailored feedback, workflow organization, and continuous testing.\n• Improved team productivity by an estimated 50% to 100% through tailored feedback and workflow organization, directly impacting project delivery times.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, Redux, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes.\n\nSoftware Development Intern\nRadix Engineering and Software | May 2021–Aug. 2022\nTechnologies: Typescript, Angular, Javascript, CSS, HTML, C#, .NET, MS SQL, Postgres\nKey Achievements:\n• Quickly learned and mastered a full stack of web development technologies from scratch, demonstrating a strong aptitude for rapid learning and problem-solving.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, demonstrating independent problem-solving and initiative.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension for refactoring React components, addressing a problem that larger extensions could not solve.\n• Achieved over 25 GitHub stars and 2800 downloads, praised by the community for fixing a key issue.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Java Full Stack Developer position at Techso. Your company's commitment to digital transformation and its reputation for delivering high-quality projects to prestigious clients deeply resonates with me. I am particularly drawn to the opportunity to contribute to innovative solutions across diverse sectors, aligning perfectly with my passion for impactful software development.\n\nWith over four years of experience in full-stack development, I bring a strong foundation in Java, Springboot, and front-end technologies. My experience in leading development teams, defining technical specifications, and implementing solutions end-to-end, like building API integrations, makes me confident in my ability to contribute to your customers' projects. Furthermore, my proficiency in Agile methodologies, including Scrum, will allow me to seamlessly integrate with your teams and contribute effectively from day one.\n\nI am confident that my collaborative spirit and commitment to continuous improvement align well with Techso’s values. My experience in mentoring junior engineers and providing support to colleagues demonstrates my ability to foster a positive and productive team environment. I am eager to learn new solutions and technologies to contribute to the team's pre-sales efforts, code reviews, and unit testing efforts. I am excited about the prospect of joining a dynamic company like Techso and contributing to its continued success. I look forward to the opportunity to discuss my application further."
  },
  {
    "id": "5dcb05bf9d06b861d5e595380ce4eff0",
    "url": "https://ca.linkedin.com/jobs/view/d%C3%A9veloppeur-fullstack-net-at-techso-4292027493",
    "title": "Techso hiring Développeur Fullstack .NET in Montreal, Quebec, Canada ",
    "content_text": "Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologique (TI), le développement spécifique d’application (DEV) et la gestion de cycle de vie du produit (PLM).\n\nFondée en 2014, Techso s’est forgée une réputation pour la qualité de ses projets livrés à de prestigieux clients et ce, dans différents secteurs tels que l’automobile, l’aéronautique, l’évènementiel, l’horlogerie, les finances, et bien d’autres.\n\nTechso cherche à agrandir son équipe de développement. Vous interviendrez en tant que Développeur .NET pour répondre aux besoins de nos clients basés à Montréal et à l'international.\n\nResponsabilités\n\nDans le cadre de vos missions vous participerez à la conception et aux développements des projets de nos clients (nouvelles applications, développement de nouvelles fonctionnalités sur des applications existantes, correction de problèmes et maintenance, …).À la suite de l’analyse du besoin, vous contribuerez à la définition de l’architecture de solutions innovantes permettant d’atteindre les objectifs et exigences de nos clients.Vous prendrez en charge la définition des spécifications techniques et fonctionnelles.Vous participerez à l’évaluation des efforts de développements pour des nouvelles solutions ou des améliorations.Vous mettrez en production les solutions développées et effectuerez la gestion du changement.Vous prendrez part aux efforts de prévente de la direction (évaluations d'efforts, analyse de technologies, ...).Vous garantirez les normes de développement les plus élevées en suivant le cycle de développement de logiciels (revue de code, tests unitaires, …).Vous aiderez à l’amélioration continue des activités de développement (agilité, assemblage du code, tests automatisés, déploiement, …).Vous fournirez un soutien à vos collègues et contribuerez au mentorat de ceux plus juniors.Vous suivrez l'évolution des nouvelles solutions / technologies du marché.Vous travaillerez avec des équipes Agile – Scrum.\n\nCompétences Requises\n\nBaccalauréat en informatique ou logicielMinimum 6 ans d'expérience avec les technologies Microsoft .Net C#, ASP.NET, Web APISolides connaissances en développement Front-End (React, Angular, VueJS, ...)Solides compétences en bases de données relationnelles (Utilisation des ORM et DAO comme Entity Framework, langage SQL, ETL, …). La connaissance des bases de données noSQL est un plusBonnes connaissances des concepts de base DevOps (Azure DevOps est un plus)Connaissances d'autres langages de programmation: Java, PHP, Node.JS, Python...Connaissances de: MAUI, Xamarin et Telerik sont un atout précieuxHabitué d’évoluer au sein d’un environnement Agile et collaboratifConnaissance des environnements Linux et WindowsMobile pour des missions dans les alentours de MontréalVous êtes capable de communiquer en anglais, à l'écrit comme à l'oral, puisque certains de vos clients seront anglphonesBon relationnel et amour du travail d'équipe !\n\nAvantages\n\nUne politique de télétravail hybride (on s’adapte au client)Un bel espace de travail situé en plein coeur du vieux-Montréal avec une terrassePetits déjeuners, café, collations, bières sont offerts au bureauUn club social actif avec plusieurs activités budgétées par Techso (camping, chalet, croisière, soirée de Noël, etc).La possibilité de s’impliquer au sein de beaux projets à l’interneUne équipe d’experts pour te partager son expertiseAssurance collective privée",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologique (TI), le développement spécifique d’application (DEV) et la gestion de cycle de vie du produit (PLM).<br><br>Fondée en 2014, Techso s’est forgée une réputation pour la qualité de ses projets livrés à de prestigieux clients et ce, dans différents secteurs tels que l’automobile, l’aéronautique, l’évènementiel, l’horlogerie, les finances, et bien d’autres.<br><br>Techso cherche à agrandir son équipe de développement. Vous interviendrez en tant que Développeur .NET pour répondre aux besoins de nos clients basés à Montréal et à l'international.<br><br><strong>Responsabilités<br><br></strong><ul><li>Dans le cadre de vos missions vous participerez à la conception et aux développements des projets de nos clients (nouvelles applications, développement de nouvelles fonctionnalités sur des applications existantes, correction de problèmes et maintenance, …).</li><li>À la suite de l’analyse du besoin, vous contribuerez à la définition de l’architecture de solutions innovantes permettant d’atteindre les objectifs et exigences de nos clients.</li><li>Vous prendrez en charge la définition des spécifications techniques et fonctionnelles.</li><li>Vous participerez à l’évaluation des efforts de développements pour des nouvelles solutions ou des améliorations.</li><li>Vous mettrez en production les solutions développées et effectuerez la gestion du changement.</li><li>Vous prendrez part aux efforts de prévente de la direction (évaluations d'efforts, analyse de technologies, ...).</li><li>Vous garantirez les normes de développement les plus élevées en suivant le cycle de développement de logiciels (revue de code, tests unitaires, …).</li><li>Vous aiderez à l’amélioration continue des activités de développement (agilité, assemblage du code, tests automatisés, déploiement, …).</li><li>Vous fournirez un soutien à vos collègues et contribuerez au mentorat de ceux plus juniors.</li><li>Vous suivrez l'évolution des nouvelles solutions / technologies du marché.</li><li>Vous travaillerez avec des équipes Agile – Scrum.<br><br></li></ul><strong>Compétences Requises<br><br></strong><ul><li>Baccalauréat en informatique ou logiciel</li><li>Minimum 6 ans d'expérience avec les technologies Microsoft .Net C#, ASP.NET, Web API</li><li>Solides connaissances en développement Front-End (React, Angular, VueJS, ...)</li><li>Solides compétences en bases de données relationnelles (Utilisation des ORM et DAO comme Entity Framework, langage SQL, ETL, …). La connaissance des bases de données noSQL est un plus</li><li>Bonnes connaissances des concepts de base DevOps (Azure DevOps est un plus)</li><li>Connaissances d'autres langages de programmation: Java, PHP, Node.JS, Python...</li><li>Connaissances de: MAUI, Xamarin et Telerik sont un atout précieux</li><li>Habitué d’évoluer au sein d’un environnement Agile et collaboratif</li><li>Connaissance des environnements Linux et Windows</li><li>Mobile pour des missions dans les alentours de Montréal</li><li>Vous êtes capable de communiquer en anglais, à l'écrit comme à l'oral, puisque certains de vos clients seront anglphones</li><li>Bon relationnel et amour du travail d'équipe !<br><br></li></ul><strong>Avantages<br><br></strong><ul><li>Une politique de télétravail hybride (on s’adapte au client)</li><li>Un bel espace de travail situé en plein coeur du vieux-Montréal avec une terrasse</li><li>Petits déjeuners, café, collations, bières sont offerts au bureau</li><li>Un club social actif avec plusieurs activités budgétées par Techso (camping, chalet, croisière, soirée de Noël, etc).</li><li>La possibilité de s’impliquer au sein de beaux projets à l’interne</li><li>Une équipe d’experts pour te partager son expertise</li><li>Assurance collective privée</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:41.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": "Développeur Fullstack .NET",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologi...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 75,
    "relevanceReason": "The candidate has strong experience with .NET, React, and relevant technologies like TypeScript and SQL, aligning well with the job's requirements. The candidate's full stack experience and leadership experience also match the requirements. The job is in Montreal, and the candidate is willing to work remotely, or hybrid, so that's an additional match.",
    "recommendation": "Good match, recommended",
    "estimatedCompensation": "80k-100k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": ".NET, React, SQL",
    "tailoredResume": "RELEVANT EXPERIENCE\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: C#, .NET, MS SQL, Typescript, React, HTML, CSS\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization, exceeding stakeholder expectations and demonstrating the ability to deliver innovative solutions.\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow, resulting in a 50% to 100% increase in productivity, showcasing strong leadership and mentoring skills.\n• Contributed to the definition of technical specifications and functional requirements for new features, demonstrating experience in the full software development lifecycle.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: C#, .NET, MS SQL, Typescript, React, HTML, CSS, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, which enabled faster testing cycles and eliminated deployment errors, demonstrating an ability to improve the software development lifecycle.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution, showcasing problem-solving skills and efficiency gains.\n• Consistently delivered user stories within allocated timeframes, demonstrating effective project management and time management skills.\n\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, Postgres, AWS\nKey Achievements:\n• Planned and delivered features end-to-end: task planning, APIs and UIs, database changes, cloud connections, tests and documentation, showcasing the ability to manage all aspects of the software development process.\n• Built and incremented reusable API integrations demonstrating the ability to create and customize solutions for client needs.\n• Onboarded and mentored three engineers, contributing to the mentorship of junior team members.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, praised for fixing a problem that larger extensions could not.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension demonstrating a problem-solving mindset.\n• Received positive community feedback, showcasing ability to understand and resolve community problems\n\n",
    "coverLetter": ""
  },
  {
    "id": "3d54043453895c8cf5f83dde43772b32",
    "url": "https://ca.linkedin.com/jobs/view/jr-software-engineer-at-aviva-canada-4291943004",
    "title": "Aviva Canada hiring Jr Software Engineer in Markham, Ontario, Canada ",
    "content_text": "Individually we are people, but together we are Aviva. Individually these are just words, but together they are our Values – Care, Commitment, Community, and Confidence.\n\nWe’re looking for a Junior Software Engineer who’s curious, collaborative, and eager to grow. This is an entry-level opportunity to build your skills in software development while contributing to meaningful projects that impact our customers and communities.\n\nAs the introductory role to software engineering, Junior Software Engineer is responsible for assisting their team in the design, develop, maintenance, and improvement of Aviva’s various software applications. Specialized in either front-end or back-end development, they are accountable for developing their own essential skills through work experience, independent training, and collaboration across the team. Their work deliverables include creating and documenting detailed designs for simple software applications or components by applying agreed modelling techniques, standards, patterns and tools, as well as contributing to the design of components of larger software systems. The scope of their role is predominantly task-based.\n\nThe Focus of this role is building knowledge of the business and software engineering, asking questions to understand processes, and prioritizing learning to better serve the team.\n\nWhat You'll Do\n\nAs a Junior Software Engineer, you’ll:\n\nLearn by doing—through hands-on experience, mentorship, and self-directed learningCommunicate openly with your team about your work, progress, and support needsAsk thoughtful questions to deepen your understanding of software engineeringImprove test coverage and documentation for existing codeContribute to the design and development of software components and applicationsCollaborate with senior engineers to deliver well-defined tasks\n\nWhat You'll Bring\n\nYou’re passionate about technology and ready to grow your skills. You bring basic understanding of:\n\nBack-End Development: JAVA, OOP, REST APIs, Spring Boot, Docker, service decompositionCloud & AWS: Cloud fundamentals, AWS Console navigationTesting & Debugging: Unit testing, debugging tools, test assertionsSecurity Best Practices: Input validation, basic authentication, HTTPS, environment variablesCode Quality: Clean, readable code, naming conventions, code reviewsArchitecture & Design: System components, simple feature implementationVersion Control (Git): Commits, branching, pull requestsCollaboration: Strong interpersonal skills and a team-first mindsetIntegrity & Accountability: Logical decision-making and ownership of your workResilience: Ability to stay focused and calm under pressureProblem Solving: Quick resolution of day-to-day issues and knowing when to escalateAgile Mindset: Willingness to learn and apply agile practices\n\nWhat You’ll Get\n\nCompelling rewards package including base compensation, eligibility for annual bonus, retirement savings, share plan, health benefits, personal wellness, and volunteer opportunities.Outstanding Career Development opportunities.We’ll support your professional development education.Competitive vacation package with the option to purchase 5 extra days off per year.Employee driven programs focused on gender, LGBTQ+, origins, diversity, and inclusion.Corporate wellness programs to support our employees’ physical and mental health.Hybrid flexible work model.\n\nPlease note that we may use AI tools to help us through the recruitment process. This is an existing position which has been posted both internally & externally.\n\nAviva Canada has an accommodation process in place to provide accommodations for employees with disabilities. If upon commencement of employment you require a specific accommodation because of a disability, please contact your Talent Acquisition Partner so that an appropriate accommodation can be arranged. This process applies throughout your career with Aviva Canada.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Individually we are people, but together we are Aviva. Individually these are just words, but together they are our Values – Care, Commitment, Community, and Confidence.<br><br>We’re looking for a Junior Software Engineer who’s curious, collaborative, and eager to grow. This is an entry-level opportunity to build your skills in software development while contributing to meaningful projects that impact our customers and communities.<br><br>As the introductory role to software engineering, Junior Software Engineer is responsible for assisting their team in the design, develop, maintenance, and improvement of Aviva’s various software applications. Specialized in either front-end or back-end development, they are accountable for developing their own essential skills through work experience, independent training, and collaboration across the team. Their work deliverables include creating and documenting detailed designs for simple software applications or components by applying agreed modelling techniques, standards, patterns and tools, as well as contributing to the design of components of larger software systems. The scope of their role is predominantly task-based.<br><br>The Focus of this role is building knowledge of the business and software engineering, asking questions to understand processes, and prioritizing learning to better serve the team.<br><br><strong>What You'll Do<br><br></strong>As a Junior Software Engineer, you’ll:<br><br><ul><li>Learn by doing—through hands-on experience, mentorship, and self-directed learning</li><li>Communicate openly with your team about your work, progress, and support needs</li><li>Ask thoughtful questions to deepen your understanding of software engineering</li><li>Improve test coverage and documentation for existing code</li><li>Contribute to the design and development of software components and applications</li><li>Collaborate with senior engineers to deliver well-defined tasks<br><br></li></ul><strong>What You'll Bring<br><br></strong>You’re passionate about technology and ready to grow your skills. You bring basic understanding of:<br><br><ul><li>Back-End Development: JAVA, OOP, REST APIs, Spring Boot, Docker, service decomposition</li><li>Cloud & AWS: Cloud fundamentals, AWS Console navigation</li><li>Testing & Debugging: Unit testing, debugging tools, test assertions</li><li>Security Best Practices: Input validation, basic authentication, HTTPS, environment variables</li><li>Code Quality: Clean, readable code, naming conventions, code reviews</li><li>Architecture & Design: System components, simple feature implementation</li><li>Version Control (Git): Commits, branching, pull requests</li><li>Collaboration: Strong interpersonal skills and a team-first mindset</li><li>Integrity & Accountability: Logical decision-making and ownership of your work</li><li>Resilience: Ability to stay focused and calm under pressure</li><li>Problem Solving: Quick resolution of day-to-day issues and knowing when to escalate</li><li>Agile Mindset: Willingness to learn and apply agile practices<br><br></li></ul><strong>What You’ll Get<br><br></strong><ul><li>Compelling rewards package including base compensation, eligibility for annual bonus, retirement savings, share plan, health benefits, personal wellness, and volunteer opportunities.</li><li>Outstanding Career Development opportunities.</li><li>We’ll support your professional development education.</li><li>Competitive vacation package with the option to purchase 5 extra days off per year.</li><li>Employee driven programs focused on gender, LGBTQ+, origins, diversity, and inclusion.</li><li>Corporate wellness programs to support our employees’ physical and mental health.</li><li>Hybrid flexible work model.<br><br></li></ul>Please note that we may use AI tools to help us through the recruitment process. This is an existing position which has been posted both internally & externally.<br><br>Aviva Canada has an accommodation process in place to provide accommodations for employees with disabilities. If upon commencement of employment you require a specific accommodation because of a disability, please contact your Talent Acquisition Partner so that an appropriate accommodation can be arranged. This process applies throughout your career with Aviva Canada.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:13:27.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Aviva Canada",
    "role": "Jr Software Engineer",
    "location": "Markham, Ontario, Canada ",
    "contentPreview": "Individually we are people, but together we are Aviva. Individually these are just words, but together they are our Values – Care, Commitment, Community, and Confidence. We’re looking for a Junior Sof...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 68,
    "relevanceReason": "The candidate possesses a strong skillset with Typescript, Javascript, and React, but this role emphasizes Java and Spring Boot. The candidate's experience level exceeds the junior role requirements, and the listed location isn't specified, so it's a moderate match.",
    "recommendation": "Consider",
    "estimatedCompensation": "60k-80k CAD/year",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "JAVA, Spring Boot, REST APIs",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, Postgres, AWS\nKey Achievements:\n• Planned and delivered features end-to-end, demonstrating experience in full-stack development including APIs, UIs, and database changes, aligning with the role's focus on software component development.\n• Built and maintained reusable API integrations, contributing to easier and more customized integrations. This highlights the ability to work independently and contribute to system design.\n• Onboarded and mentored three engineers, providing tailored feedback and guidance, showing ability to collaborate and support team members, a key aspect of the role.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, ThreeJS, C#, .NET\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization project, impressing stakeholders and demonstrating initiative in delivering innovative solutions.\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow organization, contributing to a 50% to 100% increase in team productivity. This highlights collaboration and leadership skills.\n• Demonstrated commitment to continuous testing, showing the ability to develop high-quality code.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors. This demonstrates an ability to improve processes and efficiency.\n• Consistently delivered user stories within allocated timeframes, showing the ability to deliver on time.\n\nSoftware Development Intern\nRadix Engineering and Software | May 2021–Aug. 2022\nTechnologies: Typescript, Angular, C#, .NET\nKey Achievements:\n• Gained comprehensive knowledge of web development technologies, indicating eagerness to grow and develop skills.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, which fixes a problem that larger and more popular extensions could not, highlighting the ability to independently problem-solve.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension for refactoring React components, showcasing proficiency in relevant technologies and an ability to contribute to improvements.\n• Received positive community feedback and reviews, showing user satisfaction.\n• Demonstrated strong problem-solving ability in React development.\n\n",
    "coverLetter": "As someone who believes in the power of community and is eager to grow, I was immediately drawn to Aviva Canada and this Junior Software Engineer opportunity. The emphasis on collaboration, continuous learning, and contributing to meaningful projects deeply resonates with my values. I'm particularly excited by the prospect of building my skills within a company that prioritizes Care, Commitment, and Confidence – principles I strive to embody in my own work.\n\nMy diverse experience in full-stack development, including my work at Suger and Radix Engineering, has equipped me with a strong foundation in both front-end and back-end technologies, while also building my abilities of taking initiative, delivering projects from design to deployment, and even mentoring junior engineers. Specifically, my experience in optimizing complex data visualizations at Radix allowed me to hone problem-solving skills and work in new technologies like ThreeJS and GraphQL. I am confident that I can quickly adapt to the specific needs of this role, learn the new stack, and contribute to the team's success.\n\nI'm a highly adaptable, communicative, and results-oriented individual with a passion for technology. My experience in cross-functional teams, coupled with my independent projects like React Extract, demonstrates my ability to not only learn quickly but also to contribute proactively to a team. I am particularly drawn to Aviva's culture of mentorship and continuous development, which aligns perfectly with my eagerness to grow and contribute. I am excited to learn more about this opportunity and discuss how my skills and enthusiasm can benefit Aviva Canada. Thank you for your time and consideration. \n"
  },
  {
    "id": "09bc455153e999f669ae18fd5320548a",
    "url": "https://ca.linkedin.com/jobs/view/d%C3%A9veloppeur-java-at-techso-4292025680",
    "title": "Techso hiring Développeur Java in Montreal, Quebec, Canada ",
    "content_text": "Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologique (TI), le développement spécifique d’application (DEV) et la gestion de cycle de vie du produit (PLM).\n\nFondée en 2014, Techso s’est forgée une réputation pour la qualité de ses projets livrés à de prestigieux clients et ce, dans différents secteurs tels que l’automobile, l’aéronautique, l’évènementiel, l’horlogerie, les finances, et bien d’autres.\n\nTechso cherche à agrandir son équipe de développement. Vous interviendrez en tant que développeur Java pour répondre aux besoins de nos clients basés au Canada.\n\nResponsabilités\n\nDans le cadre de vos missions vous participerez à la conception et aux développements des projets de nos clients (nouvelles applications, développement de nouvelles fonctionnalités sur des applications existantes, correction de problèmes et maintenance, …).À la suite de l’analyse du besoin, vous contribuerez à la définition de l’architecture de solutions innovantes permettant d’atteindre les objectifs et exigences de nos clients.Vous prendrez en charge la définition des spécifications techniques et fonctionnelles.Vous participerez à l’évaluation des efforts de développements pour des nouvelles solutions ou des améliorations.Vous mettrez en production les solutions développées et effectuerez la gestion du changement.Vous prendrez part aux efforts de prévente de la direction (évaluations d'efforts, analyse de technologies, ...).Vous garantirez les normes de développement les plus élevées en suivant le cycle de développement de logiciels (revue de code, tests unitaires, …).Vous aiderez à l’amélioration continue des activités de développement (agilité, assemblage du code, tests automatisés, déploiement, …).Vous fournirez un soutien à vos collègues et contribuerez au mentorat de ceux plus juniors.Vous suivrez l'évolution des nouvelles solutions / technologies du marché.Vous travaillerez avec des équipes Agile – Scrum.\n\nCompétences requises\n\nBaccalauréat en informatique ou logicielUn minimum de 6 ans d'expériences en développement JavaSolides connaissances de développement orienté objet en Java et du framework SpringbootSolides connaissances en développement Front-End (React, Angular, VueJS, …)Solides compétences en bases de données relationnelles (Utilisation des ORM et DAO comme Hibernate, langage SQL, ETL, …). La connaissance des bases de données noSQL est un plusBonnes connaissances des concepts de base DevOps (Azure DevOps est un plus)Connaissances d’autres langages de programmation : C#, PHP, Node.JS, PythonHabitué d’évoluer au sein d’un environnement Agile et collaboratifConnaissance des environnements Linux et WindowsBonne communication en anglais et en français, à l'écrit comme à l'oral, puisque certains des clients seront anglophones ou francophonesBon relationnel et amour du travail d'équipe!\n\nAvantages\n\nUne politique de télétravail hybride: on s’adapte au clientUn bel espace de travail situé en plein coeur du vieux-Montréal avec une terrassePetits déjeuners, café, collations, bières sont offerts au bureauUn club social actif avec plusieurs activités budgétées par Techso (camping, chalet, croisière, soirée de Noël, etc).La possibilité de voyager - un montant forfaitaire pour les consultants mobilesLa possibilité de s’impliquer au sein de beaux projets à l’interneUne équipe d’experts pour te partager son expertisePosséder un permis de conduireAssurance collective privée",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologique (TI), le développement spécifique d’application (DEV) et la gestion de cycle de vie du produit (PLM).<br><br>Fondée en 2014, Techso s’est forgée une réputation pour la qualité de ses projets livrés à de prestigieux clients et ce, dans différents secteurs tels que l’automobile, l’aéronautique, l’évènementiel, l’horlogerie, les finances, et bien d’autres.<br><br>Techso cherche à agrandir son équipe de développement. Vous interviendrez en tant que développeur Java pour répondre aux besoins de nos clients basés au Canada.<br><br><strong>Responsabilités<br><br></strong><ul><li>Dans le cadre de vos missions vous participerez à la conception et aux développements des projets de nos clients (nouvelles applications, développement de nouvelles fonctionnalités sur des applications existantes, correction de problèmes et maintenance, …).</li><li>À la suite de l’analyse du besoin, vous contribuerez à la définition de l’architecture de solutions innovantes permettant d’atteindre les objectifs et exigences de nos clients.</li><li>Vous prendrez en charge la définition des spécifications techniques et fonctionnelles.</li><li>Vous participerez à l’évaluation des efforts de développements pour des nouvelles solutions ou des améliorations.</li><li>Vous mettrez en production les solutions développées et effectuerez la gestion du changement.</li><li>Vous prendrez part aux efforts de prévente de la direction (évaluations d'efforts, analyse de technologies, ...).</li><li>Vous garantirez les normes de développement les plus élevées en suivant le cycle de développement de logiciels (revue de code, tests unitaires, …).</li><li>Vous aiderez à l’amélioration continue des activités de développement (agilité, assemblage du code, tests automatisés, déploiement, …).</li><li>Vous fournirez un soutien à vos collègues et contribuerez au mentorat de ceux plus juniors.</li><li>Vous suivrez l'évolution des nouvelles solutions / technologies du marché.</li><li>Vous travaillerez avec des équipes Agile – Scrum.<br><br></li></ul><strong>Compétences requises<br><br></strong><ul><li>Baccalauréat en informatique ou logiciel</li><li>Un minimum de 6 ans d'expériences en développement Java</li><li>Solides connaissances de développement orienté objet en Java et du framework Springboot</li><li>Solides connaissances en développement Front-End (React, Angular, VueJS, …)</li><li>Solides compétences en bases de données relationnelles (Utilisation des ORM et DAO comme Hibernate, langage SQL, ETL, …). La connaissance des bases de données noSQL est un plus</li><li>Bonnes connaissances des concepts de base DevOps (Azure DevOps est un plus)</li><li>Connaissances d’autres langages de programmation : C#, PHP, Node.JS, Python</li><li>Habitué d’évoluer au sein d’un environnement Agile et collaboratif</li><li>Connaissance des environnements Linux et Windows</li><li>Bonne communication en anglais et en français, à l'écrit comme à l'oral, puisque certains des clients seront anglophones ou francophones</li><li>Bon relationnel et amour du travail d'équipe!<br><br></li></ul><strong>Avantages<br><br></strong><ul><li>Une politique de télétravail hybride: on s’adapte au client</li><li>Un bel espace de travail situé en plein coeur du vieux-Montréal avec une terrasse</li><li>Petits déjeuners, café, collations, bières sont offerts au bureau</li><li>Un club social actif avec plusieurs activités budgétées par Techso (camping, chalet, croisière, soirée de Noël, etc).</li><li>La possibilité de voyager - un montant forfaitaire pour les consultants mobiles</li><li>La possibilité de s’impliquer au sein de beaux projets à l’interne</li><li>Une équipe d’experts pour te partager son expertise</li><li>Posséder un permis de conduire</li><li>Assurance collective privée</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:49.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": "Développeur Java",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "Chef de file mondial en transformation numérique, Techso est une société en pleine croissance proposant des services-conseil dans trois créneaux d’expertise : la gestion de l’infrastructure technologi...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 68,
    "relevanceReason": "The candidate has strong experience with relevant frontend technologies like React, but the job heavily emphasizes Java and Springboot, which are not present in his skillset. Despite the gap, the candidate's experience as a Software Engineer, particularly in leading teams and working on full-stack applications, shows transferable skills that could be valuable.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-110k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "Java, Springboot, React",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, Golang, Postgres, AWS\nKey Achievements:\n• Designed and delivered full-stack features, including API and UI development, database changes, and cloud integrations, contributing to the end-to-end project lifecycle.\n• Built reusable API integrations for platforms like Salesforce, HubSpot, and NetSuite, improving the efficiency and customizability of integrations.\n• Participated in the hiring process by conducting technical interviews, evaluating candidates, and contributing to hiring decisions.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, CSS, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, exceeding stakeholder expectations and showcasing innovative solution architecture.\n• Led a team of four developers, providing tailored feedback, improving workflow, and ensuring continuous testing which increased team productivity by 50% to 100%.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, C#, .NET, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and reducing deployment errors.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, receiving positive community feedback.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension that addresses a common developer challenge, as recognized by the community\n• Published an extension with over 2800 downloads on the VS Code Marketplace.\n• Utilized Typescript API to create a tool with over 25 GitHub Stars on the repo.\n\n",
    "coverLetter": "Enthousiasmé par l'opportunité de rejoindre Techso, un chef de file mondial en transformation numérique, en tant que Développeur Java à Montréal. L'approche de Techso, axée sur l'innovation et la qualité, résonne profondément avec mon désir de contribuer à des projets de développement de pointe et de collaborer avec des clients prestigieux dans divers secteurs. L'engagement de Techso à fournir des solutions de pointe et sa croissance continue sont particulièrement attrayants, et je suis impatient de contribuer à ce succès.\n\nFort de mes quatre années d'expérience en tant que développeur full-stack, je suis prêt à apporter une valeur significative à Techso. Ma capacité à concevoir, développer et déployer des applications, ainsi que ma solide expertise en Java, correspondent parfaitement aux exigences de ce poste. J'ai une expérience avérée en améliorant l'efficacité et la performance des systèmes, comme en témoigne mon travail sur l'optimisation des tableaux de bord de données industrielles. De plus, ma capacité à travailler en équipe, à encadrer les autres et à contribuer à l'amélioration continue des processus de développement, assurera que je peux contribuer à Techso's ongoing success.\n\nJe suis convaincu que mes compétences linguistiques, notamment ma maîtrise de l'anglais et ma connaissance du français, me permettraient de collaborer efficacement avec l'équipe et de communiquer clairement avec les clients. Ma passion pour l'amélioration continue et mon engagement envers les plus hautes normes de développement logiciel s'alignent parfaitement avec l'esprit de Techso. Je suis particulièrement attiré par l'opportunité de travailler dans un environnement stimulant où la collaboration et l'innovation sont valorisées. Je suis disponible pour un entretien afin de discuter plus en détail de la manière dont je peux contribuer au succès de Techso."
  },
  {
    "id": "49b607206e3ed9ced0b19e19f588dfa0",
    "url": "https://ca.linkedin.com/jobs/view/program-manager-at-ontario-health-sant%C3%A9-ontario-4292032181",
    "title": "Ontario Health | Santé Ontario hiring Program Manager in Toronto, Ontario, Canada ",
    "content_text": "Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la période de dépôt des demandes sera prolongée de trois jours.\n\nTo obtain a French translation of the following job posting, please email careers@ontariohealth.ca. Requests will be addressed within three business days, and the application window will be extended by three business days.\n\nAt Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care.  \n\nWhat Ontario Health offers:  \n\nAchieving your career goals is a priority to us. Benefits of working at Ontario Health may include the following based on employment type: \n\nFully paid medical, dental and vision coverage from your first day  a health care spending or wellness spending account a premium defined benefit pension plan  three personal days and two float days annually  three weeks’ vacation to start (for individual contributors), increasing to four weeks after two years career development opportunities  a collaborative values-based team culture  a wellness program a hybrid working model  participation in Communities of Inclusion   \n\nWant to make a difference in your career?  Consider this opportunity.  \n\nHere Is What You Will Be Doing\n\nAs a Program Manager, you will lead the advancement of digital-first practices across Ontario Health portfolios, regions, and Ontario Health Teams (OHTs). You will champion a citizen-centered, digitally connected healthcare system by embedding innovative tools, processes, and mindsets that support transformation and service excellence.\n\nThis role requires strategic leadership, cross-functional collaboration, and the ability to influence change across diverse stakeholder groups, including senior leaders, funders, and external partners.\n\nKey Responsibilities\n\nHere is what you will need to be successful\n\nDigital Transformation Leadership: Drive the adoption of digital-first practices and tools across teams and portfolios to support Ontario Health’s vision for a connected healthcare system.Stakeholder Engagement: Communicate and collaborate effectively with internal and external stakeholders, including executives, funders, and senior leaders.Strategic Planning & Execution: Apply conceptual models and change management methodologies to develop actionable strategies and lead program execution.Innovation & Process Improvement: Interpret data to identify opportunities for innovation and refine existing processes to enhance service delivery.Team Collaboration & Leadership: Provide guidance, mentorship, and subject matter expertise to team members, fostering a culture of collective leadership and continuous improvement.Client Service Excellence: Ensure internal and external stakeholders understand and access service options aligned with their evolving needs.Change Enablement: Lead and support change initiatives within the program, working collaboratively with peers to implement and sustain improvements.Decision-Making & Impact: Make informed decisions with Director-level support that have significant organizational impact and require sophisticated, short- to medium-term solutions.\n\nEducation & Experience\n\nBachelor’s or Master’s degree in Business, Health Studies, Public Administration, or related field.Project Management certification or related designation is an asset.5–7 years of progressive experience in healthcare project/program management.Proven experience leading medium to large-scale initiatives in hybrid work environments.Familiarity with Ontario’s healthcare sector and public service; existing relationships are an asset.Expertise in Project Management LifeCycle, Software Development LifeCycle, and Agile/Scrum methodologies.\n\nCore Competencies\n\nAnalytical Thinking: Strong problem-solving skills with the ability to interpret complex data and identify innovative solutions.Influential Communication: Skilled in navigating high-risk environments, resolving conflicts, and building consensus among diverse stakeholders.Strategic Relationship Building: Ability to form and maintain internal and external relationships to support short- and long-term program goals.Inclusive Leadership: Capacity to coach, inspire, and collaborate across teams with empathy and cultural sensitivity.Delivery Focused: Passionate about achieving program objectives with a strong sense of accountability and adaptability.Political Acuity: Understands how to navigate internal dynamics and government partnerships to support strategic outcomes.Risk Management: Balances transparency and trust with reputational and liability considerations in decision-making and communication.\n\nLocation: Ontario (currently hybrid; subject to change)\n\nOntario Health supports a hybrid work environment and has office locations across the province. We welcome applications from candidates residing anywhere in the province of Ontario.\n\n#LN-AH1\n\nEmployment Type\n\nPermanent Full time\n\nContract Length\n\nN/A\n\nSalary Band\n\nBand 6\n\nExternal Application Deadline Date\n\nSeptember 10, 2025\n\nAll applicants must be a resident of Ontario to be considered for roles at Ontario Health.\n\nOntario Health encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; members of Black and racialized groups; 2SLGBTQIA+ communities; trans and nonbinary individuals; and people living with disabilities. \n\nOntario Health is an accessible employer, and we offer accommodation in all aspects of employment, including the recruitment process. If you require a disability related accommodation in order to participate in the recruitment process, please email careers@ontariohealth.ca and a member of the team will connect with you within 48 hours.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la période de dépôt des demandes sera prolongée de trois jours.<br><br></strong><strong>To obtain a French translation of the following job posting, please email careers@ontariohealth.ca. Requests will be addressed within three business days, and the application window will be extended by three business days.<br><br></strong>At Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care.  <br><br><strong>What Ontario Health offers: </strong> <br><br><strong>Achieving your career goals is a priority to us. Benefits of working at Ontario Health may include the following based on employment type:</strong> <br><br><ul><li>Fully paid medical, dental and vision coverage from your first day  </li><li>a health care spending or wellness spending account </li><li>a premium defined benefit pension plan  </li><li>three personal days and two float days annually  </li><li>three weeks’ vacation to start (for individual contributors), increasing to four weeks after two years </li><li>career development opportunities  </li><li>a collaborative values-based team culture  </li><li>a wellness program </li><li>a hybrid working model  </li><li>participation in Communities of Inclusion   <br><br></li></ul><strong>Want to make a difference in your career?  Consider this opportunity.</strong>  <br><br><strong>Here Is What You Will Be Doing<br><br></strong>As a <strong>Program Manager</strong>, you will lead the advancement of digital-first practices across Ontario Health portfolios, regions, and Ontario Health Teams (OHTs). You will champion a citizen-centered, digitally connected healthcare system by embedding innovative tools, processes, and mindsets that support transformation and service excellence.<br><br>This role requires strategic leadership, cross-functional collaboration, and the ability to influence change across diverse stakeholder groups, including senior leaders, funders, and external partners.<br><br><strong>Key Responsibilities<br><br></strong><strong>Here is what you will need to be successful<br><br></strong><ul><li>Digital Transformation Leadership: Drive the adoption of digital-first practices and tools across teams and portfolios to support Ontario Health’s vision for a connected healthcare system.</li><li>Stakeholder Engagement: Communicate and collaborate effectively with internal and external stakeholders, including executives, funders, and senior leaders.</li><li>Strategic Planning & Execution: Apply conceptual models and change management methodologies to develop actionable strategies and lead program execution.</li><li>Innovation & Process Improvement: Interpret data to identify opportunities for innovation and refine existing processes to enhance service delivery.</li><li>Team Collaboration & Leadership: Provide guidance, mentorship, and subject matter expertise to team members, fostering a culture of collective leadership and continuous improvement.</li><li>Client Service Excellence: Ensure internal and external stakeholders understand and access service options aligned with their evolving needs.</li><li>Change Enablement: Lead and support change initiatives within the program, working collaboratively with peers to implement and sustain improvements.</li><li>Decision-Making & Impact: Make informed decisions with Director-level support that have significant organizational impact and require sophisticated, short- to medium-term solutions.<br><br></li></ul><strong>Education & Experience<br><br></strong><ul><li>Bachelor’s or Master’s degree in Business, Health Studies, Public Administration, or related field.</li><li>Project Management certification or related designation is an asset.</li><li>5–7 years of progressive experience in healthcare project/program management.</li><li>Proven experience leading medium to large-scale initiatives in hybrid work environments.</li><li>Familiarity with Ontario’s healthcare sector and public service; existing relationships are an asset.</li><li>Expertise in Project Management LifeCycle, Software Development LifeCycle, and Agile/Scrum methodologies.<br><br></li></ul><strong>Core Competencies<br><br></strong><ul><li>Analytical Thinking: Strong problem-solving skills with the ability to interpret complex data and identify innovative solutions.</li><li>Influential Communication: Skilled in navigating high-risk environments, resolving conflicts, and building consensus among diverse stakeholders.</li><li>Strategic Relationship Building: Ability to form and maintain internal and external relationships to support short- and long-term program goals.</li><li>Inclusive Leadership: Capacity to coach, inspire, and collaborate across teams with empathy and cultural sensitivity.</li><li>Delivery Focused: Passionate about achieving program objectives with a strong sense of accountability and adaptability.</li><li>Political Acuity: Understands how to navigate internal dynamics and government partnerships to support strategic outcomes.</li><li>Risk Management: Balances transparency and trust with reputational and liability considerations in decision-making and communication.<br><br></li></ul><strong>Location:</strong> Ontario (currently hybrid; subject to change)<br><br><em>Ontario Health supports a hybrid work environment and has office locations across the province. We welcome applications from candidates residing anywhere in the province of Ontario.<br><br></em>#LN-AH1<br><br><strong>Employment Type<br><br></strong>Permanent Full time<br><br><strong>Contract Length<br><br></strong>N/A<br><br><strong>Salary Band<br><br></strong>Band 6<br><br><strong>External Application Deadline Date<br><br></strong>September 10, 2025<br><br><strong>All applicants must be a resident of Ontario to be considered for roles at Ontario Health.<br><br></strong><strong>Ontario Health encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; members of Black and racialized groups; 2SLGBTQIA+ communities; trans and nonbinary individuals; and people living with disabilities. <br><br></strong><strong>Ontario Health is an accessible employer, and we offer accommodation in all aspects of employment, including the recruitment process. If you require a disability related accommodation in order to participate in the recruitment process, please email careers@ontariohealth.ca and a member of the team will connect with you within 48 hours.<br><br></strong></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:13:33.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Ontario Health | Santé Ontario",
    "role": "Program Manager",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 65,
    "relevanceReason": "The candidate's experience in software engineering aligns with the program management role, particularly in digital transformation and stakeholder engagement. While the technical skills match is limited, the candidate's leadership and experience in Agile methodologies show relevant experience. The role does not specify a Vancouver Metro Area, so this is a valid match.",
    "recommendation": "Consider",
    "estimatedCompensation": "Based on salary band 6, a reasonable estimate is 90k-110k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Project Management, Agile/Scrum methodologies, Healthcare sector knowledge",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, Postgres, AWS\nKey Achievements:\n• Built and integrated reusable API solutions (Salesforce, HubSpot, etc.) to streamline integrations, improving development efficiency.\n• Led the end-to-end development of features, including planning, API and UI creation, database modifications, cloud connections, testing, and documentation.\n• Mentored three engineers, fostering a collaborative environment for faster feature development and knowledge sharing.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, ThreeJS, C#, .NET\nKey Achievements:\n• Led a team of four developers in implementing a 3D visualization of an oil refinery plant, enhancing data contextualization and achieving a 50-100% increase in team productivity.\n• Provided tailored feedback and guidance to enhance performance and workflow organization, contributing to efficient project delivery.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, demonstrating efficiency and reliability.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a widely adopted VS Code extension with over 2800 downloads and a 5/5 review grade.\n• Created a solution that addressed a critical need within the React development community, demonstrating problem-solving skills.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Program Manager position at Ontario Health. The opportunity to contribute to a citizen-centered, digitally connected healthcare system deeply resonates with my professional goals. I am particularly drawn to Ontario Health's mission to connect the health system and drive improved outcomes, experiences, and value, and I am eager to contribute to this vision.\n\nWith my diverse experience, including leading end-to-end feature development and mentoring engineering teams, I am confident in my ability to advance digital-first practices across Ontario Health. My experience in building reusable API integrations and optimizing performance, such as my work at Radix Engineering and Software, demonstrates my capability to embed innovative tools and processes. Moreover, my background in both front-end and back-end development, and my work with various cloud platforms, allows me to have a comprehensive understanding of the complexities of building a well-rounded digital product.\n\nI am a strong proponent of collaborative, values-based team culture, aligning perfectly with Ontario Health's values of integrity, inspiration, tenacity, humility, and care. My experience running technical interviews and mentoring junior engineers has honed my ability to work effectively within teams. I am excited about the prospect of joining Ontario Health and contributing to a future where technology enhances healthcare for all. I am available for an interview at your earliest convenience."
  },
  {
    "id": "f4784db4d863257ffed3731d9239fcd1",
    "url": "https://ca.linkedin.com/jobs/view/plm-business-analyst-at-techso-4292028484",
    "title": "Techso hiring PLM Business analyst in Montreal, Quebec, Canada ",
    "content_text": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).\n\nFounded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.\n\nTechso is looking to expand its team. As a Business Analyst, you will play a key role in supporting our customers in their projects. You will participate in all stages, from needs analysis to the delivery of customized solutions for Canadian and international customers.\n\nResponsibilities\n\nParticipate in the analysis of the business context and identify all stakeholders (groups of people or business processes impacted).Identify and understand stakeholder needs to translate them into clear, actionable objectives.Structure, formalize and maintain documentation of functional and non-functional requirements to ensure their constant alignment with business needs.Collaborate with technical and business teams to design solutions adapted to identified challenges.Facilitate interactive workshops with stakeholders to validate and adjust proposed solutions.Work closely with the business process architect to develop the necessary transformation documents and validate business cases once solutions are implemented.Accompany customers through the transformation phases, including change management and business process improvement.Contribute to solution testing, qualification and validation phases to ensure alignment with defined requirements.Support and pass on expertise on business analysis processes to support and guide other teams within the organization.\n\nSkills Required\n\nBachelor's degree in computer science or mechanicsAt least 4 years' professional experience in a similar role and in the aeronautics/aerospace sector Knowledge of one or more PLM solutions (Dassault Systèmes, PTC, Siemens, etc.)In-depth IT skills, particularly with Microsoft applicationsRelational database skills: SQLMastery of tools: Tableau, Power BI, minitab, ...Creation of unique process models and process decomposition using process modeling tools (ARIS, IcePanel C4...)Proficiency in a programming language such as Visual BasicAbility to conduct workshops and user training, as well as presentations to various project stakeholdersMobile for international assignmentsPerfect knowledge of English, as some of your customers will be English-speaking\n\nBenefits\n\nA beautiful workspace in the heart of Old Montreal, with a terraceHybrid work policy: we adapt to our clients' needsBreakfasts, coffee, snacks and beers available in the officeAn active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).The opportunity to travel - a lump sum for mobile consultantsThe opportunity to get involved in exciting in-house projectsA team of experts to share their expertise with youPrivate group insuranc",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).<br><br>Founded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.<br><br>Techso is looking to expand its team. As a Business Analyst, you will play a key role in supporting our customers in their projects. You will participate in all stages, from needs analysis to the delivery of customized solutions for Canadian and international customers.<br><br><strong>Responsibilities<br><br></strong><ul><li>Participate in the analysis of the business context and identify all stakeholders (groups of people or business processes impacted).</li><li>Identify and understand stakeholder needs to translate them into clear, actionable objectives.</li><li>Structure, formalize and maintain documentation of functional and non-functional requirements to ensure their constant alignment with business needs.</li><li>Collaborate with technical and business teams to design solutions adapted to identified challenges.</li><li>Facilitate interactive workshops with stakeholders to validate and adjust proposed solutions.</li><li>Work closely with the business process architect to develop the necessary transformation documents and validate business cases once solutions are implemented.</li><li>Accompany customers through the transformation phases, including change management and business process improvement.</li><li>Contribute to solution testing, qualification and validation phases to ensure alignment with defined requirements.</li><li>Support and pass on expertise on business analysis processes to support and guide other teams within the organization.<br><br></li></ul><strong>Skills Required<br><br></strong><ul><li>Bachelor's degree in computer science or mechanics</li><li>At least 4 years' professional experience in a similar role and in the aeronautics/aerospace sector </li><li>Knowledge of one or more PLM solutions (Dassault Systèmes, PTC, Siemens, etc.)</li><li>In-depth IT skills, particularly with Microsoft applications</li><li>Relational database skills: SQL</li><li>Mastery of tools: Tableau, Power BI, minitab, ...</li><li>Creation of unique process models and process decomposition using process modeling tools (ARIS, IcePanel C4...)</li><li>Proficiency in a programming language such as Visual Basic</li><li>Ability to conduct workshops and user training, as well as presentations to various project stakeholders</li><li>Mobile for international assignments</li><li>Perfect knowledge of English, as some of your customers will be English-speaking<br><br></li></ul><strong>Benefits<br><br></strong><ul><li>A beautiful workspace in the heart of Old Montreal, with a terrace</li><li>Hybrid work policy: we adapt to our clients' needs</li><li>Breakfasts, coffee, snacks and beers available in the office</li><li>An active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).</li><li>The opportunity to travel - a lump sum for mobile consultants</li><li>The opportunity to get involved in exciting in-house projects</li><li>A team of experts to share their expertise with you</li><li>Private group insuranc</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:45.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": "PLM Business analyst",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application d...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 55,
    "relevanceReason": "The candidate has a strong background in full-stack development with relevant technologies, but the job posting emphasizes PLM and business analysis skills, which are not explicitly present in the candidate's profile. The role also requires specific domain expertise in the aeronautics/aerospace sector, which is missing. The role is located in Montreal, Quebec, Canada.",
    "recommendation": "Consider",
    "estimatedCompensation": "Based on industry standards and role level: 80k-110k CAD/year",
    "yearsOfExperienceRequired": "4",
    "hardSkillsRequired": "PLM solutions (Dassault Systèmes, PTC, Siemens, etc.), SQL, Visual Basic",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "ea0e04d808d5f819e1c99e15b9ec93d9",
    "url": "https://ca.linkedin.com/jobs/view/it-service-technical-specialist-at-raas-infotek-4292033228",
    "title": "Raas Infotek hiring IT Service Technical Specialist  in Toronto, Ontario, Canada ",
    "content_text": "Hi,\n\n\nHope you are doing well.\n\n\nI have an immediate requirement with one of my clients. If you are interested please provide me with the updated resume and best time to call you.\n\nRole - End User IT Service Technical Specialist Location - Toronto, ON (Hybrid) Mode - Contract \n\nKey ResponsibilitiesDevice Provisioning and Lifecycle Management:Deploy, configure, and assign laptops, desktops, and mobile devices for new hires and existing staff.Manage device imaging, application installations, security setup, and compliance checks.Enforce provisioning best practices, automate onboarding when possible, and maintain asset inventory.\nTechnical Support:Provide front-line troubleshooting and resolution of hardware and software issues via multiple channels (phone, email, chat, in person).Support meeting room technologies: set up video calls, manage AV equipment, resolve connectivity and presentation issues.Diagnose and resolve incidents related to operating systems, business applications, and network access.\nMobile Device and Application Management:Configure enterprise email, VPN, and corporate app access on mobile devices using MDM solutions.Support iTunes and Intune workflows for Apple device setup, backup, app deployment, and updates.\nSecurity and Compliance:Implement endpoint security measures and drive adherence to IT policies.Ensure all devices are patched and compliant with company standards.User Enablement and Training:Deliver onboarding support—including guides and direct training—for end users.Maintain self-service knowledge base documents to improve user experience.Collaboration and Escalation:Work with other IT team members on complex issues and ongoing improvement projects.Escalate unresolved issues according to defined processes and maintain documentation.\n\nRequired Skills\nTechnical Proficiency:Advanced troubleshooting for laptops, desktops, and mobile devices (Windows, macOS, iOS, Android).Experience in imaging, configuring, and provisioning devices, including zero-touch deployments.Must Have Familiarity with device management platforms (e.g., Microsoft Intune, Apple Business Manager, MDM/UEM tools).Working knowledge of iTunes for Apple device support, backups, and app deployment.Basic networking skills (Wi-Fi, LAN, VPN configuration).Meeting room technology support (video conferencing systems, AV equipment, presentation tools) - Teams, Crestron, Yealink, Ploy\nCustomer Service:Strong interpersonal and communication skills, with a focus on clear written and verbal support.Must have experience dealing with Sr people to resolve Laptop, Desktop, Apple/Android devices and meeting rooms issuesAbility to train users and create guides or documentation for common IT processes.Security Awareness:Understanding of endpoint security protocols, including encryption, anti-malware, and data loss prevention.\n\nOrganizational and Analytical Skills:Effective ticket management, escalation, and documentation.Capability to analyze support trends and contribute to process improvements.Adaptability:Flexibility to respond to urgent requests and operate in dynamic, evolving environments.Commitment to ongoing technical learning and certification.\n\n\n\nThanks,Ravi KumarRaas InfotekNewark, DE 19702Direct No: 302-286-9894Email: Ravi.kumar@raasinfotek.com",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>Hi,</p><p><br></p><p><br></p><p><br></p><p>Hope you are doing well.</p><p><br></p><p><br></p><p><br></p><p>I have an immediate requirement with one of my clients. If you are interested please provide me with the updated resume and best time to call you.</p><p><br></p><p><br></p><p><strong>Role - End User IT Service Technical Specialist </strong></p><p><strong>Location - Toronto, ON (Hybrid) </strong></p><p><strong>Mode - Contract </strong></p><p><br></p><p><br></p><p><strong><u>Key Responsibilities</u></strong></p><p><strong>Device Provisioning and Lifecycle Management:</strong></p><p>Deploy, configure, and assign laptops, desktops, and mobile devices for new hires and existing staff.</p><p>Manage device imaging, application installations, security setup, and compliance checks.</p><p>Enforce provisioning best practices, automate onboarding when possible, and maintain asset inventory.</p><p><br></p><p><strong>Technical Support:</strong></p><p>Provide front-line troubleshooting and resolution of hardware and software issues via multiple channels (phone, email, chat, in person).</p><p>Support meeting room technologies: set up video calls, manage AV equipment, resolve connectivity and presentation issues.</p><p>Diagnose and resolve incidents related to operating systems, business applications, and network access.</p><p><br></p><p><strong>Mobile Device and Application Management:</strong></p><p>Configure enterprise email, VPN, and corporate app access on mobile devices using MDM solutions.</p><p>Support iTunes and Intune workflows for Apple device setup, backup, app deployment, and updates.</p><p><br></p><p><strong>Security and Compliance:</strong></p><p>Implement endpoint security measures and drive adherence to IT policies.</p><p>Ensure all devices are patched and compliant with company standards.</p><p>User Enablement and Training:</p><p>Deliver onboarding support—including guides and direct training—for end users.</p><p>Maintain self-service knowledge base documents to improve user experience.</p><p>Collaboration and Escalation:</p><p>Work with other IT team members on complex issues and ongoing improvement projects.</p><p>Escalate unresolved issues according to defined processes and maintain documentation.</p><p><br></p><p><br></p><p><strong><u>Required Skills</u></strong></p><p><br></p><p><strong>Technical Proficiency:</strong></p><p>Advanced troubleshooting for laptops, desktops, and mobile devices (Windows, macOS, iOS, Android).</p><p>Experience in imaging, configuring, and provisioning devices, including zero-touch deployments.</p><p>Must Have Familiarity with device management platforms (e.g., Microsoft Intune, Apple Business Manager, MDM/UEM tools).</p><p>Working knowledge of iTunes for Apple device support, backups, and app deployment.</p><p>Basic networking skills (Wi-Fi, LAN, VPN configuration).</p><p>Meeting room technology support (video conferencing systems, AV equipment, presentation tools) - Teams, Crestron, Yealink, Ploy</p><p><br></p><p><strong>Customer Service:</strong></p><p>Strong interpersonal and communication skills, with a focus on clear written and verbal support.</p><p>Must have experience dealing with Sr people to resolve Laptop, Desktop, Apple/Android devices and meeting rooms issues</p><p>Ability to train users and create guides or documentation for common IT processes.</p><p>Security Awareness:</p><p>Understanding of endpoint security protocols, including encryption, anti-malware, and data loss prevention.</p><p><br></p><p><br></p><p><strong>Organizational and Analytical Skills:</strong></p><p>Effective ticket management, escalation, and documentation.</p><p>Capability to analyze support trends and contribute to process improvements.</p><p>Adaptability:</p><p>Flexibility to respond to urgent requests and operate in dynamic, evolving environments.</p><p>Commitment to ongoing technical learning and certification.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><strong>Thanks</strong>,</p><p><strong>Ravi Kumar</strong></p><p><strong>Raas Infotek</strong></p><p><strong>Newark, DE 19702</strong></p><p><strong>Direct No: 302-286-9894</strong></p><p><strong>Email: Ravi.kumar@raasinfotek.com</strong></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:04:21.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Raas Infotek",
    "role": "IT Service Technical Specialist ",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Hi, Hope you are doing well. I have an immediate requirement with one of my clients. If you are interested please provide me with the updated resume and best time to call you. Role - End User IT Servi...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 45,
    "relevanceReason": "The candidate's extensive full-stack experience and technical skills in Typescript, React, and Golang are not directly applicable to the IT Service Technical Specialist role, which focuses on device management and end-user support. The role does not seem to require the candidate's primary software engineering skills. As a result, the match is limited.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Windows, macOS, iOS, Android, Microsoft Intune",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "80bc22a70ed0b7e5e6c9b51c6161c770",
    "url": "https://ca.linkedin.com/jobs/view/ing%C3%A9nieur-e-%C3%A9lectrique-en-puissance-at-seneca-4292027515",
    "title": "Seneca hiring Ingénieur(e) électrique en puissance in Montreal, Quebec, Canada ",
    "content_text": "Ingénieur(e) Électrique de puissance\n\nLieu de travail : Anjou, Trois-Rivières\n\nQui nous sommes\n\nNous transformons les défis industriels en perspectives de croissance. En tant que firme de génie-conseil spécialisée en procédés de transformation industrielle, nous collaborons avec d’importantes entreprises des secteurs des ressources, de l’énergie et de la transformation alimentaire. Nous intégrons des technologies de pointe pour optimiser la productivité et la sécurité, tout en étant engagés dans des pratiques responsables. Notre mission est de créer un impact positif et durable sur la société. Nous valorisons la collaboration et construisons de solides alliances pour assurer le succès des projets de nos clients.\n\nNotre Groupe c’est : Seneca Ingénierie, Seneca Construction, Johnston-Vermette, Ultragen et Genimac. Un regroupement d’expertises diverses et complémentaires favorisant la réalisation de projets pérennes qui vous permettent de toujours évoluer.\n\nSommaire du poste\n\nL’ingénieur(e) électrique en puissance relèvent de la Directeur(rice) de l’équipe électrique, instrumentation et automation et participe aux projets liés à son domaine d’expertise.\n\nVos responsabilités\n\nRéaliser des études de réseaux électriques d’écoulement de puissance, de charges, de court-circuit, de protection et coordination, d’énergie incidente et de mise à la terre pour des réseaux de distribution BT et MT (600 V à 25 kV);Réaliser des études sur les réseaux électriques, telles que le calcul des courts-circuits, la coordination des protections, l'analyse des harmoniques et les calculs d'exposition aux arcs électriques (arc flash);Évaluer techniquement les demandes de clients et assurer la conception des installations électriques requises pour répondre aux besoins;Rédiger des rapports techniques, des spécifications, des listes, des devis et des plans pour construction;Assurer la qualité et la livraison ponctuelle des livrables aux différents clients;Spécifier les équipements électriques requis dans le cadre des projets d’ingénierie;Soutenir et superviser des ingénieurs ou techniciens/concepteurs à travers les projets.\n\nVotre bagage\n\nExpérience projet industriel. Design distribution 600v, 25kv;Expérience avec les variateurs à fréquence variable (drive)Maîtrise des outils de conception et de calculs (ETAP, SKM ou équivalent);\n\nVos Qualifications\n\nBaccalauréat en Génie électrique;Membre de l’Ordre des ingénieurs du Québec (OIQ);Minimum de 7-10 années d’expérience pertinente;Cherche continuellement à approfondir ses connaissances;Expériences de chantier ou d’usine;Facilité et excellente aptitude pour le travail en équipe multidisciplinaire;Expérience dans une firme de génie-conseil, un atout;Attestation de l’ASP Construction.Français (anglais considéré comme un atout).\n\nÉvoluer avec nous\n\nSalaires et avantages sociaux concurrentiels;Horaires flexibles, possibilité de télétravail (2 jours/semaine) – bon équilibre de vie professionnelle et personnelle;Assurances collectives incluant télémédecine et programme d’aide aux employés (PAE);Régime d’épargne retraite avec contribution de l’employeur;Programme de recommandation;Possibilités de formations liées à la profession;Club social, activités variées et reconnaissance de service, etc.;La bonne humeur et un brin de folie aussi !\n\nPrenez part à une aventure\n\ncollective, riche de nos différences\n\nDans notre univers, nous célébrons la diversité, l’équité et l’inclusion comme une source de force et d’inspiration. Nous croyons fermement que chaque individu apporte une perspective unique et précieuse. En favorisant un environnement où tous se sentent respectés et valorisés. Nous encourageons l’innovation, la collaboration et la créativité.\n\nJoignez-vous à nous\n\nFaites-nous parvenir votre cv par courriel : rh@seneca.ca",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Ingénieur(e) Électrique de puissance<br><br>Lieu de travail : Anjou, Trois-Rivières<br><br><strong>Qui nous sommes<br><br></strong>Nous transformons les défis industriels en perspectives de croissance. En tant que firme de génie-conseil spécialisée en procédés de transformation industrielle, nous collaborons avec d’importantes entreprises des secteurs des ressources, de l’énergie et de la transformation alimentaire. Nous intégrons des technologies de pointe pour optimiser la productivité et la sécurité, tout en étant engagés dans des pratiques responsables. Notre mission est de créer un impact positif et durable sur la société. Nous valorisons la collaboration et construisons de solides alliances pour assurer le succès des projets de nos clients.<br><br>Notre Groupe c’est : Seneca Ingénierie, Seneca Construction, Johnston-Vermette, Ultragen et Genimac. Un regroupement d’expertises diverses et complémentaires favorisant la réalisation de projets pérennes qui vous permettent de toujours évoluer.<br><br>Sommaire du poste<br><br>L’ingénieur(e) électrique en puissance relèvent de la Directeur(rice) de l’équipe électrique, instrumentation et automation et participe aux projets liés à son domaine d’expertise.<br><br><strong>Vos responsabilités<br><br></strong><ul><li>Réaliser des études de réseaux électriques d’écoulement de puissance, de charges, de court-circuit, de protection et coordination, d’énergie incidente et de mise à la terre pour des réseaux de distribution BT et MT (600 V à 25 kV);</li><li>Réaliser des études sur les réseaux électriques, telles que le calcul des courts-circuits, la coordination des protections, l'analyse des harmoniques et les calculs d'exposition aux arcs électriques (arc flash);</li><li>Évaluer techniquement les demandes de clients et assurer la conception des installations électriques requises pour répondre aux besoins;</li><li>Rédiger des rapports techniques, des spécifications, des listes, des devis et des plans pour construction;</li><li>Assurer la qualité et la livraison ponctuelle des livrables aux différents clients;</li><li>Spécifier les équipements électriques requis dans le cadre des projets d’ingénierie;</li><li>Soutenir et superviser des ingénieurs ou techniciens/concepteurs à travers les projets.<br><br></li></ul><strong>Votre bagage<br><br></strong><ul><li>Expérience projet industriel. Design distribution 600v, 25kv;</li><li>Expérience avec les variateurs à fréquence variable (drive)</li><li>Maîtrise des outils de conception et de calculs (ETAP, SKM ou équivalent);<br><br></li></ul><strong>Vos Qualifications<br><br></strong><ul><li>Baccalauréat en Génie électrique;</li><li>Membre de l’Ordre des ingénieurs du Québec (OIQ);</li><li>Minimum de 7-10 années d’expérience pertinente;</li><li>Cherche continuellement à approfondir ses connaissances;</li><li>Expériences de chantier ou d’usine;</li><li>Facilité et excellente aptitude pour le travail en équipe multidisciplinaire;</li><li>Expérience dans une firme de génie-conseil, un atout;</li><li>Attestation de l’ASP Construction.</li><li>Français (anglais considéré comme un atout).<br><br></li></ul><strong>Évoluer avec nous<br><br></strong><ul><li>Salaires et avantages sociaux concurrentiels;</li><li>Horaires flexibles, possibilité de télétravail (2 jours/semaine) – bon équilibre de vie professionnelle et personnelle;</li><li>Assurances collectives incluant télémédecine et programme d’aide aux employés (PAE);</li><li>Régime d’épargne retraite avec contribution de l’employeur;</li><li>Programme de recommandation;</li><li>Possibilités de formations liées à la profession;</li><li>Club social, activités variées et reconnaissance de service, etc.;</li><li>La bonne humeur et un brin de folie aussi !<br><br></li></ul>Prenez part à une aventure<br><br>collective, riche de nos différences<br><br>Dans notre univers, nous célébrons la diversité, l’équité et l’inclusion comme une source de force et d’inspiration. Nous croyons fermement que chaque individu apporte une perspective unique et précieuse. En favorisant un environnement où tous se sentent respectés et valorisés. Nous encourageons l’innovation, la collaboration et la créativité.<br><br><strong>Joignez-vous à nous<br><br></strong>Faites-nous parvenir votre cv par courriel : rh@seneca.ca</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:46:03.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Seneca",
    "role": "Ingénieur(e) électrique en puissance",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "Ingénieur(e) Électrique de puissance Lieu de travail : Anjou, Trois-Rivières Qui nous sommes Nous transformons les défis industriels en perspectives de croissance. En tant que firme de génie-conseil s...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 45,
    "relevanceReason": "The job requires expertise in power electrical engineering, which is outside of the candidate's software engineering background. While the candidate has strong technical skills in software development, particularly with TypeScript, React, and backend technologies, the role's focus on electrical engineering makes this a poor match. The job is located in Montreal and the candidate has no listed experience or location in Quebec. Therefore, this is a skip.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "7-10",
    "hardSkillsRequired": "ETAP, SKM, Power Electrical Engineering",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "cd7385f6d912495b1dc46564355e6357",
    "url": "https://ca.linkedin.com/jobs/view/business-analyst-flexcube-at-tata-consultancy-services-4258685419",
    "title": "Tata Consultancy Services hiring Business Analyst - Flexcube in Mississauga, Ontario, Canada ",
    "content_text": "Inclusion without Exception\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people’s stories across our workforce and implemented through equitable workplace policies and processes.\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $30 billion in the fiscal year ended March 31, 2025, and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\nJob Description:\nRole Description:Good functional knowledge of corporate bankingHands on experience on Oracle FlexcubeLead product backlog grooming sessions with relevant stakeholders in Biz & Technology and ensure requirements are well understood by allLead the solution for project, as requiredCICD tools exposure (Jenkins/Bitbucket/Lightspeed)Experience with concurrent programming and caching.\nRequired Skill Set:Hands on exp on Oracle FLEXCUBEStrong in SQL, MS Excel and Data AnalysisGood Python experience.Good Functional knowledge of corporate bankingGood knowledge of Trade Finance, Treasury and Lending.Exp as Business AnalystMust have Agile experience.\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodation during the recruitment and selection process, please inform Human Resources.\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>Inclusion without Exception</strong></p><p><br></p><p>Tata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people’s stories across our workforce and implemented through equitable workplace policies and processes.</p><p><br></p><p>TCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $30 billion in the fiscal year ended March 31, 2025, and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.</p><p><br></p><p><strong>Job Description:</strong></p><p><br></p><p>Role Description:</p><ul><li>Good functional knowledge of corporate banking</li><li>Hands on experience on Oracle Flexcube</li><li>Lead product backlog grooming sessions with relevant stakeholders in Biz & Technology and ensure requirements are well understood by all</li><li>Lead the solution for project, as required</li><li>CICD tools exposure (Jenkins/Bitbucket/Lightspeed)</li><li>Experience with concurrent programming and caching.</li></ul><p><br></p><p>Required Skill Set:</p><ul><li>Hands on exp on Oracle FLEXCUBE</li><li>Strong in SQL, MS Excel and Data Analysis</li><li>Good Python experience.</li><li>Good Functional knowledge of corporate banking</li><li>Good knowledge of Trade Finance, Treasury and Lending.</li><li>Exp as Business Analyst</li><li>Must have Agile experience.</li></ul><p><br></p><p><br></p><p>Tata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodation during the recruitment and selection process, please inform Human Resources.</p><p><br></p><p>Thank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.</p><p></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:32:36.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Tata Consultancy Services",
    "role": "Business Analyst - Flexcube",
    "location": "Mississauga, Ontario, Canada ",
    "contentPreview": "Inclusion without Exception Tata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 45,
    "relevanceReason": "The candidate's strong full-stack experience and proficiency in Typescript/React are not directly applicable to this Business Analyst role focused on Oracle Flexcube, SQL, and Python. Although the candidate has some relevant technical skills (SQL, Python), the role's emphasis on domain-specific knowledge and experience with Flexcube make it a limited match. The role is located in Mississauga, Ontario, but it has no mention of remote capabilities.",
    "recommendation": "Skip",
    "estimatedCompensation": "90k-110k CAD/year",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Oracle FLEXCUBE, SQL, MS Excel, Python",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "505a6a99fb4b776e98d9e748aa0d92ca",
    "url": "https://ca.linkedin.com/jobs/view/growth-marketing-manager-at-mama-earth-organics-4292028308",
    "title": "Mama Earth Organics hiring Growth Marketing Manager in Toronto, Ontario, Canada ",
    "content_text": "Our Story Mama Earth is a food experience for people who love to eat, cook, share, and learn about food. Our mission is to help you better the world through your food choices. We provide fresh, local organic produce, chef-crafted meals, sustainable meat and seafood, and everyday essentials, all conveniently delivered to your door with flexible options across the Greater Toronto Area and beyond.\nJob title: Growth Marketing ManagerSalary: $85,000 - $90,000 AnnuallyPosition Type: Full-TimeDepartment: MarketingLocation: TBD, Riverside or Downtown Toronto (Hybrid, 1-2 days per week in office)\nWhat's In It For You:You’ll be joining a team of talented, fun people who take pride in pushing good food forwardComprehensive benefits health and dental benefits package with EAPMostly remote with office optionEmployee discounts at Mama EarthYou’ll be supporting the creation of a local food system, built on principles of sustainability and biodiversity, and demonstrating that this can be both financially sustainable for farmers and affordable for consumers\nWho You Are:\nWe’re looking for a roll-up-your-sleeves growth marketer whose main mission is to grow signups and build brand love across paid, owned, earned, grassroots channels, and our community (especially since word-of-mouth is one of our most powerful tools). You’re just as comfortable crafting strategy as you are executing it yourself, whether that means writing ad copy, building landing pages, optimizing funnels, or pulling performance data. You thrive in a fast-moving, collaborative environment where everyone pitches in, and you see every touchpoint as an opportunity to connect people to great food and the farmers who grow it. Data drives your decisions, but you know the real magic happens when performance meets emotional storytelling.\nWhat you will be doing: \nAcquisition Strategy & Performance MarketingOwn the customer acquisition strategy, with new customer signups as your North Star Metric.Lead and optimize paid media (Meta, Google, TikTok, emerging platforms) in partnership with agencies.Monitor campaigns and KPIs daily, pivoting quickly to improve CPA, ROAS, and payback period.Build and execute a testing roadmap across creative, landing pages, and new channels.Build and optimize prospect-focused email automations, popups, and SMS.Continually assess and evolve our acquisition model for efficiency and growth.\nOnsite Optimization & CRODrive onsite optimization for acquisition, including landing page creation, funnel improvements, SEO, and LLM opportunities.Collaborate with developers to run CRO tests and implement high-impact changes.Manage product merchandising strategies to maximize conversion.\nData, Analytics & ForecastingBuild and monitor dashboards in Metabase, GA4 and Google Sheets, surfacing actionable insights.Forecast acquisition volume and spend; track and report on progress weekly.Align agencies and internal teams on attribution and measurement.\nPartnerships & ActivationsOversee the Partnerships & Activations Manager to deliver grassroots acquisition at healthy CPAs.Support with setup, collateral, logistics, and strategic partner negotiations.\nCollaboration, Budget & StorytellingLead agency relationships, manage budgets, and ensure accurate expense tracking.Collaborate cross-functionally to deliver a cohesive journey from first touch to first order.Partner with purchasing and creative teams to deliver campaigns that combine performance with storytelling rooted in food, farming, and community.\nWhat you will bring to the table: 5+ years in growth marketing, acquisition, or performance roles, ideally in DTC, subscription, or e-commerce.A proven track record of meeting or exceeding CPA and acquisition targets while managing multi-channel paid media portfolios.Hands-on experience building campaigns across Meta, Google, TikTok (and emerging platforms)Comfort with analytics tools like GA4 and Metabase or Tableau (Nice to have: SQL)Strong grasp of onsite optimization: From SEO and landing pages to CRO testing and funnel design, and the ability to execute or directly oversee implementation.Experience creating email automation, SMS, and popup campaigns aimed at converting prospects.High level of comfort managing external agencies and vendors while also executing work yourself.Advanced analytical skills, with the ability to translate data into actionable strategies and clear reporting for stakeholders.A knack for balancing performance metrics with emotional storytelling that connects with audiences.Strong project management skills, including budget tracking, invoice management, and cross-team collaboration.Bonus: Familiarity with food, agriculture, sustainability, or local food systems.\nWorking Conditions:Ability to lift up to 40 lbs and travel locally for in-person events or activations.This role is based in Riverside or Downtown Toronto (TBD) with a hybrid work model. It is mostly remote, with one to two days in office per week and occasional in-person attendance at events, pop-ups, or partner locations.\nOur CommitmentWe thank all interested applicants; however, only those selected for an interview will be contacted.Mama Earth Organics  is an equal opportunity employer committed to diversity and inclusion. We consider all applicants regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, and Indigenous status. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>Our Story </strong></p><p>Mama Earth is a food experience for people who love to eat, cook, share, and learn about food. Our mission is to help you better the world through your food choices. We provide fresh, local organic produce, chef-crafted meals, sustainable meat and seafood, and everyday essentials, all conveniently delivered to your door with flexible options across the Greater Toronto Area and beyond.</p><p><br></p><p><strong>Job title:</strong> Growth Marketing Manager</p><p><strong>Salary:</strong> $85,000 - $90,000 Annually</p><p><strong>Position Type:</strong> Full-Time</p><p><strong>Department: </strong>Marketing</p><p><strong>Location: </strong>TBD, Riverside or Downtown Toronto (Hybrid, 1-2 days per week in office)</p><p><br></p><p><strong>What's In It For You:</strong></p><ul><li>You’ll be joining a team of talented, fun people who take pride in pushing good food forward</li><li>Comprehensive benefits health and dental benefits package with EAP</li><li>Mostly remote with office option</li><li>Employee discounts at Mama Earth</li><li>You’ll be supporting the creation of a local food system, built on principles of sustainability and biodiversity, and demonstrating that this can be both financially sustainable for farmers and affordable for consumers</li></ul><p><br></p><p><strong>Who You Are:</strong></p><p><br></p><p>We’re looking for a roll-up-your-sleeves growth marketer whose main mission is to grow signups and build brand love across paid, owned, earned, grassroots channels, and our community (especially since word-of-mouth is one of our most powerful tools). You’re just as comfortable crafting strategy as you are executing it yourself, whether that means writing ad copy, building landing pages, optimizing funnels, or pulling performance data. You thrive in a fast-moving, collaborative environment where everyone pitches in, and you see every touchpoint as an opportunity to connect people to great food and the farmers who grow it. Data drives your decisions, but you know the real magic happens when performance meets emotional storytelling.</p><p><br></p><p><strong>What you will be doing: </strong></p><p><br></p><p><strong>Acquisition Strategy & Performance Marketing</strong></p><ul><li>Own the customer acquisition strategy, with new customer signups as your North Star Metric.</li><li>Lead and<strong> </strong>optimize paid media (Meta, Google, TikTok, emerging platforms) in partnership with agencies.</li><li>Monitor campaigns and KPIs daily, pivoting quickly to<strong> </strong>improve CPA, ROAS, and payback period.</li><li>Build and execute a testing roadmap across creative, landing pages, and new channels.</li><li>Build and<strong> </strong>optimize prospect-focused email automations, popups, and SMS.</li><li>Continually assess and evolve our acquisition model for efficiency and growth.</li></ul><p><br></p><p><strong>Onsite Optimization & CRO</strong></p><ul><li>Drive onsite optimization for acquisition, including landing page creation, funnel improvements, SEO, and LLM opportunities.</li><li>Collaborate with developers to<strong> </strong>run CRO tests and implement high-impact changes.</li><li>Manage product merchandising strategies to maximize conversion.</li></ul><p><br></p><p><strong>Data, Analytics & Forecasting</strong></p><ul><li>Build and monitor<strong> </strong>dashboards in Metabase, GA4 and Google Sheets, surfacing actionable insights.</li><li>Forecast acquisition volume and spend; track and report on progress weekly.</li><li>Align agencies and internal teams on<strong> </strong>attribution and measurement.</li></ul><p><br></p><p><strong>Partnerships & Activations</strong></p><ul><li>Oversee the Partnerships & Activations Manager to deliver grassroots acquisition at healthy CPAs.</li><li>Support with setup, collateral, logistics, and strategic partner negotiations.</li></ul><p><br></p><p><strong>Collaboration, Budget & Storytelling</strong></p><ul><li>Lead agency relationships, manage budgets, and ensure accurate expense tracking.</li><li>Collaborate cross-functionally to deliver a cohesive journey from first touch to first order.</li><li>Partner with purchasing and creative teams to deliver campaigns that combine performance with<strong> </strong>storytelling rooted in food, farming, and community.</li></ul><p><br></p><p><strong>What you will bring to the table: </strong></p><ul><li>5+ years in growth marketing, acquisition, or performance roles, ideally in<strong> </strong>DTC, subscription, or e-commerce.</li><li>A proven track record of meeting or exceeding CPA and acquisition targets while managing<strong> </strong>multi-channel paid media portfolios.</li><li>Hands-on experience building campaigns across Meta, Google, TikTok (and emerging platforms)</li><li>Comfort with analytics tools like<strong> </strong>GA4 and Metabase or Tableau (Nice to have: SQL)</li><li>Strong grasp of onsite optimization: From SEO and landing pages to CRO testing and funnel design,<strong> </strong>and the ability to execute or directly oversee implementation.</li><li>Experience creating email automation, SMS, and popup campaigns aimed at converting prospects.</li><li>High level of comfort managing external agencies and vendors while also executing work yourself.</li><li>Advanced analytical skills, with the ability to translate data into actionable strategies and clear reporting for stakeholders.</li><li>A knack for<strong> </strong>balancing performance metrics with emotional storytelling that connects with audiences.</li><li>Strong project management skills, including budget tracking, invoice management, and cross-team collaboration.</li><li>Bonus: Familiarity with food, agriculture, sustainability, or local food systems.</li></ul><p><br></p><p><strong>Working Conditions:</strong></p><ul><li>Ability to lift up to 40 lbs and travel locally for in-person events or activations.</li><li>This role is based in Riverside or Downtown Toronto (TBD) with a hybrid work model. It is mostly remote, with<strong> </strong>one to two days in office per week and occasional in-person attendance at events, pop-ups, or partner locations.</li></ul><p><br></p><p><strong>Our Commitment</strong></p><p><em>We thank all interested applicants; however, only those selected for an interview will be contacted.</em></p><p>Mama Earth Organics  is an equal opportunity employer committed to diversity and inclusion. We consider all applicants regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, and Indigenous status. If you require accommodation during the recruitment and selection process, please let us know. We will work with you to provide as seamless a recruitment experience as possible.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:04:33.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Mama Earth Organics",
    "role": "Growth Marketing Manager",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Our Story Mama Earth is a food experience for people who love to eat, cook, share, and learn about food. Our mission is to help you better the world through your food choices. We provide fresh, local ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "This job posting for a Growth Marketing Manager is not a good match for the candidate. The candidate's background is in software engineering and development, with no experience in marketing, making this a poor alignment in terms of technical skills and role requirements.",
    "recommendation": "Skip",
    "estimatedCompensation": "85k-90k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "27d4b8fe11211804e3c188a8d2d47047",
    "url": "https://ca.linkedin.com/jobs/view/data-analytics-specialist-at-teema-4291933757",
    "title": "TEEMA hiring Data Analytics Specialist in Vancouver, British Columbia, Canada ",
    "content_text": "Location: Vancouver, BC (Hybrid – 50% on-site)Contract: 6 months (high likelihood of permanent)\nWe’re looking for a Data Analytics Specialist to join our team on a 6-month contract with a strong possibility of transitioning into a full-time permanent role. This role is ideal for someone who loves working with data analysis, insights, and reporting rather than heavy backend data engineering.\nAbout the RoleIn this role, you’ll focus on building out notebooks and working with gold layers and semantic layers to deliver clear and actionable insights. You’ll spend your time developing data visualizations and dashboards in Power BI, manipulating data for meaningful analysis, and supporting stakeholders with event analytics and decision-making.\nThis is a hands-on analytics role — you’ll work closely with business teams, supporting projects and retiring legacy reporting systems while helping to evolve our modern analytics stack.\nKey Skills & ExperienceWe’re seeking someone with strong analytics and visualization expertise, including:\nPower BI and Power Query (hands-on dashboards, reports, semantic modeling)SQL Server & SSIS plus Azure analytics tools (Azure Synapse, Data Factory, Azure SQL)Experience working with gold layers and semantic layersNotebooks for manipulating datasets and producing insightsAt least 1+ years experience with Microsoft Fabric in an enterprise environment T-SQL programming and JSONStrong ability to analyze, synthesize, and interpret data to produce actionable business insightsExcellent communication skills — comfortable presenting findings to both technical and non-technical stakeholders",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>Location:</strong> Vancouver, BC (Hybrid – 50% on-site)</p><p><strong>Contract:</strong> 6 months (high likelihood of permanent)</p><p><br></p><p>We’re looking for a <strong>Data Analytics Specialist</strong> to join our team on a <strong>6-month contract</strong> with a strong possibility of transitioning into a <strong>full-time permanent role</strong>. This role is ideal for someone who loves working with <strong>data analysis, insights, and reporting</strong> rather than heavy backend data engineering.</p><p><br></p><p><strong>About the Role</strong></p><p>In this role, you’ll focus on <strong>building out notebooks</strong> and working with <strong>gold layers</strong> and <strong>semantic layers</strong> to deliver clear and actionable insights. You’ll spend your time developing <strong>data visualizations</strong> and <strong>dashboards</strong> in <strong>Power BI</strong>, manipulating data for meaningful analysis, and supporting stakeholders with event analytics and decision-making.</p><p><br></p><p>This is a <strong>hands-on analytics role</strong> — you’ll work closely with business teams, supporting projects and retiring legacy reporting systems while helping to evolve our modern analytics stack.</p><p><br></p><p><strong>Key Skills & Experience</strong></p><p>We’re seeking someone with <strong>strong analytics and visualization expertise</strong>, including:</p><p><br></p><ul><li><strong>Power BI</strong> and <strong>Power Query</strong> (hands-on dashboards, reports, semantic modeling)</li><li><strong>SQL Server</strong> & <strong>SSIS</strong> plus <strong>Azure analytics tools</strong> <em>(Azure Synapse, Data Factory, Azure SQL)</em></li><li>Experience working with <strong>gold layers</strong> and <strong>semantic layers</strong></li><li><strong>Notebooks</strong> for manipulating datasets and producing insights</li><li>At least 1+ years experience with <strong>Microsoft Fabric in an enterprise environment </strong></li><li><strong>T-SQL programming</strong> and <strong>JSON</strong></li><li>Strong ability to <strong>analyze, synthesize, and interpret data</strong> to produce actionable business insights</li><li>Excellent <strong>communication skills</strong> — comfortable presenting findings to both technical and non-technical stakeholders</li></ul><p></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:49:17.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "TEEMA",
    "role": "Data Analytics Specialist",
    "location": "Vancouver, British Columbia, Canada ",
    "contentPreview": "Location: Vancouver, BC (Hybrid – 50% on-site)Contract: 6 months (high likelihood of permanent) We’re looking for a Data Analytics Specialist to join our team on a 6-month contract with a strong possi...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "The job posting is for a Data Analytics Specialist, which does not align with the candidate's primary experience in software engineering and full-stack development. The required skills like Power BI, SQL Server, and Azure analytics tools are not strongly present in the candidate's profile. The candidate's profile shows relevant skills on frontend and backend development, but not on data analytics, which makes the match very poor.",
    "recommendation": "Skip",
    "estimatedCompensation": "Not Applicable",
    "yearsOfExperienceRequired": "1",
    "hardSkillsRequired": "Power BI, SQL Server, Azure analytics tools",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "4f10cf280a3519ce72feeff7ca0ae00d",
    "url": "https://ca.linkedin.com/jobs/view/analyste-prix-de-revient-at-aliments-krispy-kernels-4292024703",
    "title": "Aliments Krispy Kernels hiring Analyste prix de revient in Québec, Quebec, Canada ",
    "content_text": "Ta job alléchante chez Aliments Krispy Kernels!\n\nDu genre pinottes ou pistaches? Il y a de la place pour tout le monde chez Krispy Kernels. Et surtout, on a de la place pour toi. L’ingrédient manquant dans notre recette du succès ? Un(e) Analyste prix de revient à temps plein, basé(e) à nos bureaux de Québec.\n\nTu as l'esprit de rigueur, un bon sens de l’analyse et tu veux t’investir dans une entreprise québécoise qui a du croquant depuis 1964 ? Lis bien ce qui suit.\n\nLa saveur que tu apportes à l’équipe : En tant qu’Analyste du prix d revient, tu joueras un rôle clé au sein de notre organisation. Relevant du VP Finances, tu seras responsable d'effectuer différentes tâches en comptabilité de gestion.\n\nProfite D'avantages Aussi Savoureux Que Nos Grignotines\n\nSalaire compétitif pour te récompenser à ta juste valeurProgramme d’aide aux employé.es (PAE) pour te soutenir au quotidienAccès à la plateforme de télémédecine DialogueAssurance collective, y compris dentaire avec contribution de l’employeurTravail à domicile possible lorsque la formation sera terminée (un peu de flexibilité, ça fait du bien !)\n\nTa recette de responsabilités\n\nAnalyser, établir et mettre à jour les prix de revientGénérer plusieurs analyses de rentabilitéValidation du coût de revient dans le nouveau ERPParticiper à l’élaboration des budgets annuelsAnalyse des variances et des écarts (budget, production, coût)Participer aux revues de performance avec les unités d’affairesGestion de la donnée financièreParticiper à la mise en place et suivi d’indicateurs de performanceProposer des améliorations aux divers processus d’affaires en lien le déploiement du nouveau ERPParticiper à toutes autres responsabilités et projets permettant au département des finances de réaliser ses objectifsAssurer un rôle de leadership dans la gestion du département des finances\n\nTon sac à compétences contient-il les assaisonnements que l’on recherche ?\n\nNous Recherchons Un(e) Candidat(e) Qui Possède\n\nUne formation universitaire en sciences de la comptabilité.Un minimum de 6 ans d’expérience dans un poste similaire, idéalement en environnement manufacturier ou de distributionConnaissance des systèmes ERP (Microsoft Dynamics BC/Navision) – un atout.Une excellente maîtrise de la suite Microsoft Office (Excel, Word, Outlook, Teams) .Une rigueur et une minutie exemplaires, assurant la précision des analyses et la qualité des livrables.Une approche collaborative, axée sur le partenariat avec les unités d’affaires et les services internes, favorisant une compréhension commune des enjeux et une prise de décision éclairée.D’excellentes aptitudes communicationnelles et un sens du leadershipUne capacité à vulgariser et à synthétiser l’information financièreUn esprit analytique développé et une bonne capacité d’évaluation, combinés à une organisation efficace.Un sens des priorités affûté et la capacité de gérer plusieurs projets simultanément.\n\nPrêt(e) à rejoindre notre équipe craquante ?\n\nSi tu veux faire partie d'une recette gagnante et que tu carbures aux défis, envoie-nous ta candidature dès maintenant. Chez Krispy Kernels, ton potentiel est notre recette secrète !",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Ta job alléchante chez Aliments Krispy Kernels!<br><br></strong>Du genre pinottes ou pistaches? Il y a de la place pour tout le monde chez Krispy Kernels. Et surtout, on a de la place pour toi. L’ingrédient manquant dans notre recette du succès ? Un(e) <strong>Analyste prix de revient</strong> à temps plein, basé(e) à nos bureaux de Québec.<br><br>Tu as l'esprit de rigueur, un bon sens de l’analyse et tu veux t’investir dans une entreprise québécoise qui a du croquant depuis 1964 ? Lis bien ce qui suit.<br><br>La saveur que tu apportes à l’équipe : En tant qu’Analyste du prix d revient, tu joueras un rôle clé au sein de notre organisation. Relevant du <strong>VP Finances</strong>, tu seras responsable d'effectuer différentes tâches en comptabilité de gestion.<br><br><strong>Profite D'avantages Aussi Savoureux Que Nos Grignotines<br><br></strong><ul><li>Salaire compétitif pour te récompenser à ta juste valeur</li><li>Programme d’aide aux employé.es (PAE) pour te soutenir au quotidien</li><li>Accès à la plateforme de télémédecine Dialogue</li><li>Assurance collective, y compris dentaire avec contribution de l’employeur</li><li>Travail à domicile possible lorsque la formation sera terminée (un peu de flexibilité, ça fait du bien !)<br><br></li></ul><strong>Ta recette de responsabilités<br><br></strong><ul><li>Analyser, établir et mettre à jour les prix de revient</li><li>Générer plusieurs analyses de rentabilité</li><li>Validation du coût de revient dans le nouveau ERP</li><li>Participer à l’élaboration des budgets annuels</li><li>Analyse des variances et des écarts (budget, production, coût)</li><li>Participer aux revues de performance avec les unités d’affaires</li><li>Gestion de la donnée financière</li><li>Participer à la mise en place et suivi d’indicateurs de performance</li><li>Proposer des améliorations aux divers processus d’affaires en lien le déploiement du nouveau ERP</li><li>Participer à toutes autres responsabilités et projets permettant au département des finances de réaliser ses objectifs</li><li>Assurer un rôle de leadership dans la gestion du département des finances<br><br></li></ul><strong>Ton sac à compétences contient-il les assaisonnements que l’on recherche ?<br><br></strong><strong>Nous Recherchons Un(e) Candidat(e) Qui Possède<br><br></strong><ul><li>Une formation universitaire en sciences de la comptabilité.</li><li>Un minimum de 6 ans d’expérience dans un poste similaire, idéalement en environnement manufacturier ou de distribution</li><li>Connaissance des systèmes ERP (Microsoft Dynamics BC/Navision) – un atout.</li><li>Une excellente maîtrise de la suite Microsoft Office (Excel, Word, Outlook, Teams) .</li><li>Une rigueur et une minutie exemplaires, assurant la précision des analyses et la qualité des livrables.</li><li>Une approche collaborative, axée sur le partenariat avec les unités d’affaires et les services internes, favorisant une compréhension commune des enjeux et une prise de décision éclairée.</li><li>D’excellentes aptitudes communicationnelles et un sens du leadership</li><li>Une capacité à vulgariser et à synthétiser l’information financière</li><li>Un esprit analytique développé et une bonne capacité d’évaluation, combinés à une organisation efficace.</li><li>Un sens des priorités affûté et la capacité de gérer plusieurs projets simultanément.<br><br></li></ul><strong>Prêt(e) à rejoindre notre équipe craquante ?<br><br></strong>Si tu veux faire partie d'une recette gagnante et que tu carbures aux défis, envoie-nous ta candidature dès maintenant. Chez Krispy Kernels, ton potentiel est notre recette secrète !</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:45.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Aliments Krispy Kernels",
    "role": "Analyste prix de revient",
    "location": "Québec, Quebec, Canada ",
    "contentPreview": "Ta job alléchante chez Aliments Krispy Kernels! Du genre pinottes ou pistaches? Il y a de la place pour tout le monde chez Krispy Kernels. Et surtout, on a de la place pour toi. L’ingrédient manquant ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "This role is for a Cost Analyst, which is a completely different field than the candidate's software engineering background. The job posting also requires experience in accounting and ERP systems, which the candidate lacks. The candidate's technical skills are not relevant to this role.",
    "recommendation": "Skip",
    "estimatedCompensation": "60k-80k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "Cost accounting, ERP Systems, Microsoft Office Suite (Excel), Budgeting",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "24cc13d77083e96bc9c13fd326c154b7",
    "url": "https://ca.linkedin.com/jobs/view/delmia-solution-architect-digital-manufacturing-at-techso-4292029466",
    "title": "Techso hiring DELMIA Solution Architect/ Digital Manufacturing in Montreal, Quebec, Canada ",
    "content_text": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).\n\nFounded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.\n\nTechso is looking to expand its PLM team. You will work as a DELMIA/Digital Manufacturing Solution Architect to advise, define and deliver solutions for major projects in France, Montreal or abroad.\n\nResponsibilities\n\nTechso is looking to strengthen its expertise in Dassault Systèmes' 3DEXPERIENCE tool by recruiting a DELMIA Solution Architect to meet the needs of its Montreal-based customers.\n\nAs a Solution Architect, you will be in direct contact with the customer, defining the solution architecture and the physical and organizational business perimeter.You will contribute to the design and evolution of the enterprise application, information and technology architecture.You will draw up transition plans between current and target architectures, and recommend the implementation of the resulting projects.You will consolidate project requirements and act as your customer's main contact throughout all phases of the project.You will advise, guide and support the business areas in matters of architecture for global integration.You will find the best solutions for the customer, in partnership with the publisher, whether OOTB or custom solutions.\n\nSkills Required\n\nBachelor's degree in mechanics, industry or ITYou have significant experience in the world of Product Lifecycle Management (PLM) - at least 6 yearsYou have a sound knowledge of Dassault Systèmes tools, in particular 3DEXPERIENCE (ENOVIA, CATIA, DELMIA) or Apriso, Ortems and QuintiqYou are familiar with the various applications in DELMIA: \"Manufacturing Item Definition\", \"Work Instruction\", \"Process Planner\", \"Robotics\", etc. You have already led meetings with different groups in the organization to clarify requirements and deploy the chosen solutions.You have already facilitated meetings with different groups within the organization to clarify needs and the deployment of selected solutionsYou have been able to evolve in an Agile/Scrum environmentYou are able to communicate in English, both written and spoken, as some of your customers will be English-speakingYou wish to evolve in an international environment and be able to work abroad according to our customers' requests (Europe, Asia, Canada, France)Some projects may be subject to defense clearance constraints.\n\nBenefits\n\nA hybrid telecommuting policy: we adapt to the customerA beautiful workspace located in the heart of Old Montreal with a terraceBreakfast, coffee, snacks and beer are available at the officeAn active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).The opportunity to travel - a lump sum for mobile consultantsThe opportunity to get involved in exciting in-house projectsA team of experts to share their expertise with youPrivate group insurance",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application development (DEV) and product lifecycle management (PLM).<br><br>Founded in 2014, Techso has built a reputation for the quality of its projects delivered to prestigious customers in various sectors such as automotive, aerospace, events, watchmaking, finance and many others.<br><br>Techso is looking to expand its PLM team. You will work as a DELMIA/Digital Manufacturing Solution Architect to advise, define and deliver solutions for major projects in France, Montreal or abroad.<br><br><strong>Responsibilities<br><br></strong>Techso is looking to strengthen its expertise in Dassault Systèmes' 3DEXPERIENCE tool by recruiting a DELMIA Solution Architect to meet the needs of its Montreal-based customers.<br><br><ul><li>As a Solution Architect, you will be in direct contact with the customer, defining the solution architecture and the physical and organizational business perimeter.</li><li>You will contribute to the design and evolution of the enterprise application, information and technology architecture.</li><li>You will draw up transition plans between current and target architectures, and recommend the implementation of the resulting projects.</li><li>You will consolidate project requirements and act as your customer's main contact throughout all phases of the project.</li><li>You will advise, guide and support the business areas in matters of architecture for global integration.</li><li>You will find the best solutions for the customer, in partnership with the publisher, whether OOTB or custom solutions.<br><br></li></ul><strong>Skills Required<br><br></strong><ul><li>Bachelor's degree in mechanics, industry or IT</li><li>You have significant experience in the world of Product Lifecycle Management (PLM) - at least 6 years</li><li>You have a sound knowledge of Dassault Systèmes tools, in particular 3DEXPERIENCE (ENOVIA, CATIA, DELMIA) or Apriso, Ortems and Quintiq</li><li>You are familiar with the various applications in DELMIA: \"Manufacturing Item Definition\", \"Work Instruction\", \"Process Planner\", \"Robotics\", etc. You have already led meetings with different groups in the organization to clarify requirements and deploy the chosen solutions.</li><li>You have already facilitated meetings with different groups within the organization to clarify needs and the deployment of selected solutions</li><li>You have been able to evolve in an Agile/Scrum environment</li><li>You are able to communicate in English, both written and spoken, as some of your customers will be English-speaking</li><li>You wish to evolve in an international environment and be able to work abroad according to our customers' requests (Europe, Asia, Canada, France)</li><li>Some projects may be subject to defense clearance constraints.<br><br></li></ul><strong>Benefits<br><br></strong><ul><li>A hybrid telecommuting policy: we adapt to the customer</li><li>A beautiful workspace located in the heart of Old Montreal with a terrace</li><li>Breakfast, coffee, snacks and beer are available at the office</li><li>An active social club with several activities budgeted by Techso (camping, cottage, cruise, Christmas party, etc.).</li><li>The opportunity to travel - a lump sum for mobile consultants</li><li>The opportunity to get involved in exciting in-house projects</li><li>A team of experts to share their expertise with you</li><li>Private group insurance</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:44.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Techso",
    "role": "DELMIA Solution Architect/ Digital Manufacturing",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "A global leader in digital transformation, Techso is a fast-growing company offering consulting services in three niches of expertise: technology infrastructure management (IT), specific application d...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "The candidate's software engineering background doesn't align well with the DELMIA Solution Architect role, which requires deep PLM and Dassault Systèmes 3DEXPERIENCE tool experience. While the candidate has strong software development skills, the job's specialized requirements make it a poor match.",
    "recommendation": "Skip",
    "estimatedCompensation": "Not applicable",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "3DEXPERIENCE, DELMIA, PLM",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "b003ecec0f04d4f88b21db8d8ac49a83",
    "url": "https://ca.linkedin.com/jobs/view/senior-product-manager-at-creative-niche-4291938357",
    "title": "Creative Niche hiring Senior Product Manager in Toronto, Ontario, Canada ",
    "content_text": "We’re seeking a skilled and strategic Senior Product Manager to lead the development and growth of innovative financial products for our established fintech client. In this role, you'll take full ownership of the product lifecycle - from discovery and planning to launch and continuous improvement. You’ll collaborate closely with cross-functional teams to deliver products that are data-informed, customer-centric, and built to scale. A background in fintech and working with modern technologies is a plus.\nKey Responsibilities:• Full Lifecycle Ownership: Lead the end-to-end product process - from idea to execution - ensuring successful outcomes for both customers and the business.• Strategic Planning: Develop and communicate product vision, define roadmaps, and prioritize features based on market needs, user feedback, and business goals.• Cross-functional Collaboration: Work closely with engineering, design, compliance, data, and operations teams to bring product ideas to life.• Customer Focus: Conduct user research, gather insights, and use data to deeply understand customer needs and drive meaningful product decisions.• Data-Informed Product Development: Leverage analytics and experimentation to validate assumptions, optimize performance, and support product iterations.• Tech & Innovation: Partner with data and engineering teams to explore and implement advanced features.• Regulatory Awareness: Ensure product decisions align with industry regulations and data privacy standards.\nQualifications:• Experience: 5-8 years of product management experience, ideally in financial related industries.• Lifecycle Expertise: Proven track record leading products through the full lifecycle in agile environments.• Analytical Skills: Strong analytical and problem-solving abilities with comfort working with metrics, experimentation, and customer data.• Technical Aptitude: Ability to work effectively with engineering and data teams; familiarity with concepts like APIs, data flows, and algorithmic features is helpful.• Collaboration & Communication: Excellent communication and stakeholder management skills; strong ability to influence and align teams through storytelling and product narratives.We look forward to hearing from you.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>We’re seeking a skilled and strategic Senior Product Manager to lead the development and growth of innovative financial products for our established fintech client. In this role, you'll take full ownership of the product lifecycle - from discovery and planning to launch and continuous improvement. You’ll collaborate closely with cross-functional teams to deliver products that are data-informed, customer-centric, and built to scale. A background in fintech and working with modern technologies is a plus.</p><p><br></p><p><strong>Key Responsibilities:</strong></p><p>• <strong>Full Lifecycle Ownership:</strong> Lead the end-to-end product process - from idea to execution - ensuring successful outcomes for both customers and the business.</p><p>• <strong>Strategic Planning:</strong> Develop and communicate product vision, define roadmaps, and prioritize features based on market needs, user feedback, and business goals.</p><p>• <strong>Cross-functional Collaboration:</strong> Work closely with engineering, design, compliance, data, and operations teams to bring product ideas to life.</p><p>• <strong>Customer Focus:</strong> Conduct user research, gather insights, and use data to deeply understand customer needs and drive meaningful product decisions.</p><p>• <strong>Data-Informed Product Development:</strong> Leverage analytics and experimentation to validate assumptions, optimize performance, and support product iterations.</p><p>• <strong>Tech & Innovation:</strong> Partner with data and engineering teams to explore and implement advanced features.</p><p>• <strong>Regulatory Awareness:</strong> Ensure product decisions align with industry regulations and data privacy standards.</p><p><br></p><p><strong>Qualifications:</strong></p><p>• <strong>Experience:</strong> 5-8 years of product management experience, ideally in financial related industries.</p><p>• <strong>Lifecycle Expertise:</strong> Proven track record leading products through the full lifecycle in agile environments.</p><p>• <strong>Analytical Skills:</strong> Strong analytical and problem-solving abilities with comfort working with metrics, experimentation, and customer data.</p><p>• <strong>Technical Aptitude:</strong> Ability to work effectively with engineering and data teams; familiarity with concepts like APIs, data flows, and algorithmic features is helpful.</p><p>• <strong>Collaboration & Communication:</strong> Excellent communication and stakeholder management skills; strong ability to influence and align teams through storytelling and product narratives.We look forward to hearing from you.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:36:03.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Creative Niche",
    "role": "Senior Product Manager",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "We’re seeking a skilled and strategic Senior Product Manager to lead the development and growth of innovative financial products for our established fintech client. In this role, you'll take full owne...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "This role is for a Senior Product Manager, while the candidate is a Software Engineer with strong technical skills. The candidate's experience doesn't align with the product management responsibilities and requirements. This is a mismatch of core skills.",
    "recommendation": "Skip",
    "estimatedCompensation": "120k-180k CAD/year",
    "yearsOfExperienceRequired": "5-8",
    "hardSkillsRequired": "",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "87b3a3a0d52981c6b048f4b1d95b3aeb",
    "url": "https://ca.linkedin.com/jobs/view/core-java-developer-at-vlink-inc-4292028231",
    "title": "VLink Inc hiring Core Java Developer  in Mississauga, Ontario, Canada ",
    "content_text": "Job Title: Core Java DeveloperLocation: Mississauga, ON (Hybrid)Employment: Contract/Full-time opportunityExperience: 10+ years \n\nAbout VLink: Started in 2006 and headquartered in Connecticut, VLink is one of the fastest growing digital technology services and consulting companies. Since its inception, our innovative team members have been solving the most complex business, and IT challenges of our global clients.\nJob Description:We are seeking an experienced Core Java Developer to join our team in Mississauga. The ideal candidate will have deep expertise in building scalable applications using modern Java frameworks, microservices, and cloud technologies.\nMust Have SkillsStrong proficiency in Core Java (10+ years)Spring Boot framework expertiseHands-on experience with Microservices ArchitectureStrong knowledge of AWS Cloud ServicesExperience with Hibernate/JPAProficiency in Multithreading & Concurrency\n\n\nWarm Regards,\nwariya.siraj@vlinkinfo.comD: (289) 633-4046",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>Job Title: Core Java Developer</strong></p><p><strong>Location: Mississauga, ON (Hybrid)</strong></p><p><strong>Employment: Contract/Full-time opportunity</strong></p><p><strong>Experience: 10+ years </strong></p><p><br></p><p><br></p><p><strong>About VLink: </strong>Started in 2006 and headquartered in Connecticut, VLink is one of the fastest growing digital technology services and consulting companies. Since its inception, our innovative team members have been solving the most complex business, and IT challenges of our global clients.</p><p><br></p><p><strong>Job Description:</strong></p><p>We are seeking an experienced Core Java Developer to join our team in Mississauga. The ideal candidate will have deep expertise in building scalable applications using modern Java frameworks, microservices, and cloud technologies.</p><p><br></p><p><strong>Must Have Skills</strong></p><ul><li>Strong proficiency in <strong>Core Java</strong> (10+ years)</li><li><strong>Spring Boot</strong> framework expertise</li><li>Hands-on experience with <strong>Microservices</strong> Architecture</li><li>Strong knowledge of <strong>AWS</strong> Cloud Services</li><li>Experience with <strong>Hibernate</strong>/JPA</li><li>Proficiency in <strong>Multithreading</strong> & Concurrency</li></ul><p><br></p><p><br></p><p><br></p><p><strong>Warm Regards,</strong></p><p><br></p><p>wariya.siraj@vlinkinfo.com</p><p><strong>D:</strong> (289) 633-4046</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:31:31.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "VLink Inc",
    "role": "Core Java Developer ",
    "location": "Mississauga, Ontario, Canada ",
    "contentPreview": "Job Title: Core Java DeveloperLocation: Mississauga, ON (Hybrid)Employment: Contract/Full-time opportunityExperience: 10+ years About VLink: Started in 2006 and headquartered in Connecticut, VLink is ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 35,
    "relevanceReason": "The candidate's profile does not align with the job requirements due to the lack of core Java experience and Spring Boot/Hibernate skills. The candidate has expertise in Typescript, Javascript, and React, but the job posting is focused on Java. The candidate's experience is mainly in full-stack development, whereas the job specifically requires deep expertise in Java.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "10",
    "hardSkillsRequired": "Core Java, Spring Boot, Microservices",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "7def281832f3fb32713ae8c808eb345e",
    "url": "https://ca.linkedin.com/jobs/view/business-data-analyst-at-agilus-work-solutions-4291934897",
    "title": "Agilus Work Solutions hiring Business Data Analyst in Toronto, Ontario, Canada ",
    "content_text": "Must-Have Skills:10+ years of experience as a delivery lead in wealth management or finance systems (e.g. GL conversions)Ability to work with technology stakeholders (Solution Architects, Developers, QA) and business stakeholdersExperience with requirements gathering, analysis and data mapping activities.Comfortable using Microsoft Project for maintaining project schedules.Experience with managing monthly forecastingExperience in leading teams and ensuring project delivery is on time, within budget and high quality5+ years of experience working with QA on root cause analysis, triaging and creating testing metrics.5+ years of experience working on large transformation programs and conversion projectsStrong SDLC experience in waterfall and agile methodologies\n Nice to Have Skills:Previous Data Analyst",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>Must-Have Skills:</strong></p><ul><li>10+ years of experience as a delivery lead in <strong>wealth management or finance systems</strong> (e.g. GL conversions)</li><li>Ability to work with technology stakeholders (<strong>Solution Architects, Developers, QA</strong>) and business stakeholders</li><li>Experience with requirements gathering, analysis and<strong> data mapping</strong> activities.</li><li>Comfortable using Microsoft Project for maintaining project schedules.</li><li>Experience with managing monthly forecasting</li><li>Experience in leading teams and ensuring project delivery is on time, within budget and high quality</li><li>5+ years of experience working with <strong>QA on root cause </strong>analysis, triaging and creating testing metrics.</li><li>5+ years of experience working on large transformation programs and conversion projects</li><li>Strong SDLC experience in waterfall and agile methodologies</li></ul><p><br></p><p><strong> Nice to Have Skills:</strong></p><ul><li>Previous Data Analyst</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:01:53.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Agilus Work Solutions",
    "role": "Business Data Analyst",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Must-Have Skills:10+ years of experience as a delivery lead in wealth management or finance systems (e.g. GL conversions)Ability to work with technology stakeholders (Solution Architects, Developers, ...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 25,
    "relevanceReason": "The candidate's software engineering background and full-stack experience do not align with the Business Data Analyst role. The job posting emphasizes finance systems, data analysis, and project management, which are not the candidate's primary strengths. The role also requires 10+ years of experience as a delivery lead, which far exceeds the candidate's experience.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "10",
    "hardSkillsRequired": "delivery lead, wealth management, finance systems",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "919d659669ccbaf3ff736af4df934623",
    "url": "https://ca.linkedin.com/jobs/view/financial-analyst-at-votorantim-cimentos-north-america-vcna-4290308351",
    "title": "Votorantim Cimentos North America (VCNA) hiring Financial Analyst in East York, Ontario, Canada ",
    "content_text": "WELCOME TO VCNA!\n\nWe are St Marys Cement, part of Votorantim Cimentos North America (VCNA),\n\nAs the North American operations of Votorantim Cimentos, a global building materials and sustainability solutions leader in 11 countries, we are helping to make a positive impact and are transforming our world. We have a culture built on solid partnerships, long-lasting relationships, and opportunities for those who want to learn, grow and be part of a diverse and dynamic culture.\n\nWith solutions that include cement, ready-mix concrete and aggregates, we help to build homes, highways, hospitals, buildings, bridges, and schools across the Canadian and U.S. Great Lakes region and Northeast United States. Our commitment to excellence can be seen in those who invest and believe in what we do, those who share their lives with us, those who trust in our deliveries and those committed to innovation and a sustainable future.\n\nEvery day, we have the chance to accomplish something new and you're invited to be part of it.\n\nWHAT IS THE OPPORTUNITY?\n\nThe Financial Analyst worked closely with Cement Finance team to ensure we deliver accurate and timeliness financial information for strategic decision.\n\nWHAT WILL YOU DO?\n\nSupporting in consolidation of the annual 5 years Strategic Plan / Budget / Rolling Forecast and Monthly forecast and on-going budget adjustments throughout the year.Supporting and coordination in budgeting process for Terminals, SGA, Purchased Finished & other corporate items. Preparation of monthly reconciliation and journal entry for general ledger accounts related to Terminals, SG&A & Purchased Finished Products, ensuring timely follow up on any unusual or unexpected variances. Monitor and track joint venture GLS against key metrics, and recommend adjustments to improve accuracy of the information. Coordinates the standard costing and cash cost by product update with plant accounting manager. Prepare and analysis to investigate variation from previous year / budget / Forecast.Supporting on performing ad hoc reporting on monthly variance and trend analysis, reports on actual versus budget variances and works with cement finance team to identify and implement opportunities for cost savings, operating efficiencies, and best practices. Prepare various financial statements and/or reports.Work with the head office corporate finance staff and local plant management to: (a) establish and monitor system controls, (b) develop procedures to improve existing systems and (c) ensure that Corporate policies and procedures are being adhered to. Collaborate with cross-functional teams (e.g., sales, marketing, operations) to understand business drivers and align financial strategies. \n\nWHAT DO YOU NEED TO SUCCEED?\n\nMinimum four-year business diploma from University or College with minimum five years progressively responsible finance/ accounting experience. Desired candidates that have successfully completed or participating in a recognized professional accounting program; CPA or like curriculum preferred.Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports, memo and correspondence. Ability to speak effectively before groups of customers or employees of organization, strong interpersonal skills, good communicator. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations; have the ability to control accounting administration through practical mathematical accounting principles. Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. Ability to take financial data and controlling data and apply it to practical situations. To perform this job successfully, an individual must have intermediate to advanced skills with MS Office Word, and Power-Point; advanced skills in Excel applications. Experience with SAP R/3 or an Enterprise Resource Software would be a strong plus. Proven management and leadership skills.While performing the duties of this job, the employee is regularly required to sit, stand, walk, talk and hear. The employee is occasionally required to stoop, crouch and/or kneel and climb with some height’s exposure of a moderate level. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.While performing the duties of this Job, the employee is occasionally exposed to inclement weather conditions. The noise level in the office work environment is low with occasional higher levels in non-office areas including need for personal protective equipment as required. Periodic travel required including ability to obtain passport for periodic corporate Toronto office visits as necessary.\n\nWHAT'S IN IT FOR YOU?\n\nBeing part of VCNA is being part of building famous landmarks such as Toronto's CN Tower, Roy Thompson Hall, Maple Leaf Gardens and the Darlington Nuclear Station and Ryerson Centre, St. Regis Chicago and 150 N. Riverside, Louis High-Speed Rail in Chicago and more Opportunities to collaborate with teams around the globe and growth opportunities in different areasTraining, professional developmentTuition reimbursement/assistance Competitive wages, vacation and holiday timeMedical, dental, vision, disability and life insuranceRRSP and DC (CAN) and 401K (U.S.) Lifeworks Employee Assistance Program (EAP): confidential support for you and your family (CAN)Educational scholarship program for dependents of regular salaried employees.Fertility drug coveragePaid Maternity Leave Top UpHybrid work model for certain positions\n\nSalary Range: $98,505.02 - $123,131.28\n\nThis posting is for a vacant position.\n\nOUR PEOPLE\n\nWe care about people - all people. At VCNA, we take safety, health and wellness seriously. We're dedicated to giving our employees a safe workplace, our neighbors a safe environment and our customers a high-quality and safe product. Safety first -and always!\n\nOur VC Way reflects who we are, inspiring us to unite our culture and be our best: Our Way of Being: ethical and respectful, Our Way of Working: together with excellence and Our Way of Thriving: with the courage to transform.\n\nINCLUSION AND EQUAL OPPORTUNITY EMPLOYMENT\n\nWe have a results-oriented culture that values being open, honest, and authentic. It's part of our DNA. We are continually expanding our diverse and inclusive team by providing opportunities for everyone, regardless of race, ethnicity, age, gender, religion, sexual orientation, gender identity, gender expression, disability or economic status - a workplace where you can express your individuality and be your best self!",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>WELCOME TO VCNA!<br><br></strong>We are St Marys Cement, part of Votorantim Cimentos North America (VCNA),<br><br>As the North American operations of Votorantim Cimentos, a global building materials and sustainability solutions leader in 11 countries, we are helping to make a positive impact and are transforming our world. We have a culture built on solid partnerships, long-lasting relationships, and opportunities for those who want to learn, grow and be part of a diverse and dynamic culture.<br><br>With solutions that include cement, ready-mix concrete and aggregates, we help to build homes, highways, hospitals, buildings, bridges, and schools across the Canadian and U.S. Great Lakes region and Northeast United States. Our commitment to excellence can be seen in those who invest and believe in what we do, those who share their lives with us, those who trust in our deliveries and those committed to innovation and a sustainable future.<br><br>Every day, we have the chance to accomplish something new and you're invited to be part of it.<br><br><strong>WHAT IS THE OPPORTUNITY</strong>?<br><br>The<strong> Financial Analyst</strong> worked closely with Cement Finance team to ensure we deliver accurate and timeliness financial information for strategic decision.<br><br><strong>WHAT WILL YOU DO?<br><br></strong><ul><li>Supporting in consolidation of the annual 5 years Strategic Plan / Budget / Rolling Forecast and Monthly forecast and on-going budget adjustments throughout the year.</li><li>Supporting and coordination in budgeting process for Terminals, SGA, Purchased Finished & other corporate items. </li><li>Preparation of monthly reconciliation and journal entry for general ledger accounts related to Terminals, SG&A & Purchased Finished Products, ensuring timely follow up on any unusual or unexpected variances. </li><li>Monitor and track joint venture GLS against key metrics, and recommend adjustments to improve accuracy of the information. </li><li>Coordinates the standard costing and cash cost by product update with plant accounting manager. Prepare and analysis to investigate variation from previous year / budget / Forecast.</li><li>Supporting on performing ad hoc reporting on monthly variance and trend analysis, reports on actual versus budget variances and works with cement finance team to identify and implement opportunities for cost savings, operating efficiencies, and best practices. Prepare various financial statements and/or reports.</li><li>Work with the head office corporate finance staff and local plant management to: (a) establish and monitor system controls, (b) develop procedures to improve existing systems and (c) ensure that Corporate policies and procedures are being adhered to. Collaborate with cross-functional teams (e.g., sales, marketing, operations) to understand business drivers and align financial strategies. <br><br></li></ul><strong>WHAT DO YOU NEED TO SUCCEED?<br><br></strong><ul><li>Minimum four-year business diploma from University or College with minimum five years progressively responsible finance/ accounting experience. </li><li>Desired candidates that have successfully completed or participating in a recognized professional accounting program; CPA or like curriculum preferred.</li><li>Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports, memo and correspondence. Ability to speak effectively before groups of customers or employees of organization, strong interpersonal skills, good communicator. </li><li>Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations; have the ability to control accounting administration through practical mathematical accounting principles. </li><li>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. Ability to take financial data and controlling data and apply it to practical situations. </li><li>To perform this job successfully, an individual must have intermediate to advanced skills with MS Office Word, and Power-Point; advanced skills in Excel applications. Experience with SAP R/3 or an Enterprise Resource Software would be a strong plus. </li><li>Proven management and leadership skills.</li><li>While performing the duties of this job, the employee is regularly required to sit, stand, walk, talk and hear. The employee is occasionally required to stoop, crouch and/or kneel and climb with some height’s exposure of a moderate level. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.</li><li>While performing the duties of this Job, the employee is occasionally exposed to inclement weather conditions. The noise level in the office work environment is low with occasional higher levels in non-office areas including need for personal protective equipment as required. Periodic travel required including ability to obtain passport for periodic corporate Toronto office visits as necessary.<br><br></li></ul><strong>WHAT'S IN IT FOR YOU?<br><br></strong><ul><li>Being part of VCNA is being part of building famous landmarks such as Toronto's CN Tower, Roy Thompson Hall, Maple Leaf Gardens and the Darlington Nuclear Station and Ryerson Centre, St. Regis Chicago and 150 N. Riverside, Louis High-Speed Rail in Chicago and more </li><li>Opportunities to collaborate with teams around the globe and growth opportunities in different areas</li><li>Training, professional development</li><li>Tuition reimbursement/assistance </li><li>Competitive wages, vacation and holiday time</li><li>Medical, dental, vision, disability and life insurance</li><li>RRSP and DC (CAN) and 401K (U.S.) </li><li>Lifeworks Employee Assistance Program (EAP): confidential support for you and your family (CAN)</li><li>Educational scholarship program for dependents of regular salaried employees.</li><li>Fertility drug coverage</li><li>Paid Maternity Leave Top Up</li><li>Hybrid work model for certain positions<br><br></li></ul>Salary Range: $98,505.02 - $123,131.28<br><br>This posting is for a vacant position.<br><br><strong>OUR PEOPLE<br><br></strong>We care about people - all people. At VCNA, we take safety, health and wellness seriously. We're dedicated to giving our employees a safe workplace, our neighbors a safe environment and our customers a high-quality and safe product. Safety first -and always!<br><br><strong>Our</strong> <strong>VC Way</strong> reflects who we are, inspiring us to unite our culture and be our best: <strong>Our Way of Being:</strong> ethical and respectful, <strong>Our Way of Working:</strong> together with excellence and <strong>Our Way of Thriving:</strong> with the courage to transform.<br><br><strong>INCLUSION AND EQUAL OPPORTUNITY EMPLOYMENT<br><br></strong><em>We have a results-oriented culture that values being open, honest, and authentic. It's part of our DNA. We are continually expanding our diverse and inclusive team by providing opportunities for everyone, regardless of race, ethnicity, age, gender, religion, sexual orientation, gender identity, gender expression, disability or economic status - a workplace where you can express your individuality and be your best self!</em></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:46:28.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Votorantim Cimentos North America (VCNA)",
    "role": "Financial Analyst",
    "location": "East York, Ontario, Canada ",
    "contentPreview": "WELCOME TO VCNA! We are St Marys Cement, part of Votorantim Cimentos North America (VCNA), As the North American operations of Votorantim Cimentos, a global building materials and sustainability solut...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 25,
    "relevanceReason": "The candidate's strong software engineering background in full-stack development, particularly with Typescript, React, and Go, is not relevant to this Financial Analyst role. The job requires financial analysis skills and accounting experience, which are not present in the candidate's profile, and requires working in East York, while the candidate is used to remote work.",
    "recommendation": "Skip",
    "estimatedCompensation": "98k-123k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Finance, Accounting, Excel",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "c2124e09e2d62408f4d610ea3873e9cd",
    "url": "https://ca.linkedin.com/jobs/view/senior-mechanical-design-engineer-at-next-structural-integrity-inc-4291932833",
    "title": "Next Structural Integrity Inc. hiring Senior Mechanical Design Engineer in Greater Toronto Area, Canada ",
    "content_text": "Next Structural Integrity Inc., is a leading engineering company providing essential engineering services and solving complex problems for our clients in the Nuclear and Oil and Gas industries. We are a team of energetic and creative individuals offering the best engineering solutions and consulting services.\nWe strongly believe that every established engineering solution should exhibit the utmost quality and meet regulatory prerequisites. Our level of service not only makes our relationships mutually rewarding but facilitates lasting relationships with the parties involved. The skills that we have developed and the multi-level design and analysis capacity we have acquired while working across various industries inimitably qualify us as your go-to engineering partner.\nOur growing company is seeking energetic, positive, and reliable Senior Mechanical Design Engineer to support our customers.\nResponsibilities:\nResponsible for supervising groups of specialized engineers in the energy sector.Maintaining a project timeline and completing tasks within the allocated time frames.Liaise with other discipline leads, project managers, contractors and clients to facilitate smooth flow of information for use in preparing preliminary and detailed design and provide design clarification solutions throughout the project.Reports and Calculations (test/hydraulic/equipment sizing/stress/FMEA, etc.).Technical Specifications (services/components/equipment, etc.).Demonstrated capability to manage a knowledge-based work unit.Extensive experience in the development of strategies and policies for the planning of programs with significant knowledge and experience in the principles of program/project evaluation, monitoring, measurement & verification, data analysis and report writing.Highly developed analytical, decision making, problem solving and conflict resolution skills, with a history of successfully demonstrating collaboration, teamwork, innovation, organization, coordination and planning skills.Strong leadership and management skills as evidenced by past successful performance, with demonstrated supervisory competencies including the ability to coach, hold accountable, mentor, engage and motivate staff.Demonstrated ability in preparing technical reports and deliverables to successful conclusion.\nQualifications:\nGood knowledge of CANDU nuclear power plant design and operation as well as CANDU reactor components (specifically primary heat transport, feeder, calandria).Understanding of engineering change control process.Experience in compliance with regulatory standards and customer requirements.Experience in piping and equipment design.In depth knowledge of CSA N285.0, N286.7 and N289 as well as ASME Section III Subsections NB, NC, ND, NF, ASME B31.1, B31.3 and ASME Section VIII.Good understanding and experience with Engineering Change Control (ECC) process.Past experience that supports ASME Section III Appendix XXIII Qualification for Design Specification and Overpressure Protection Report is considered an asset.The successful candidate will be recognized by his/her peers for professionalism, superior performance, knowledge, expertise, and ability to work in team environment.Candidates must be pursuing towards P.Eng. designation and valid Nuclear site access.Candidates must be eligible to work in Canada.The knowledge and skills required include successful completion of a university degree, Masters or PhD (Mechanical) and have a minimum of 3-5 years relevant practical experience in a project engineering or field-engineering role.\n\nNSI is particularly interested in people who enjoy working on a variety of work and who are keen to continue to develop their knowledge and expertise.\nIf you believe you have the necessary knowledge, experience, and enthusiasm to succeed in this position, then we would like to hear from you.\nWe thank all applicants for their interest; however only those candidates selected for an interview will be contacted. We are dedicated to maintaining a respectful, fair, and equitable work environment, and welcome submissions from all qualified applicants. We are committed to providing a barrier free workplace. If accommodation is required during the selection or interview process it will be available upon request.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>Next Structural Integrity Inc., is a leading engineering company providing essential engineering services and solving complex problems for our clients in the Nuclear and Oil and Gas industries. We are a team of energetic and creative individuals offering the best engineering solutions and consulting services.</p><p><br></p><p>We strongly believe that every established engineering solution should exhibit the utmost quality and meet regulatory prerequisites. Our level of service not only makes our relationships mutually rewarding but facilitates lasting relationships with the parties involved. The skills that we have developed and the multi-level design and analysis capacity we have acquired while working across various industries inimitably qualify us as your go-to engineering partner.</p><p><br></p><p>Our growing company is seeking energetic, positive, and reliable Senior Mechanical Design Engineer to support our customers.</p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><ul><li>Responsible for supervising groups of specialized engineers in the energy sector.</li><li>Maintaining a project timeline and completing tasks within the allocated time frames.</li><li>Liaise with other discipline leads, project managers, contractors and clients to facilitate smooth flow of information for use in preparing preliminary and detailed design and provide design clarification solutions throughout the project.</li><li>Reports and Calculations (test/hydraulic/equipment sizing/stress/FMEA, etc.).</li><li>Technical Specifications (services/components/equipment, etc.).</li><li>Demonstrated capability to manage a knowledge-based work unit.</li><li>Extensive experience in the development of strategies and policies for the planning of programs with significant knowledge and experience in the principles of program/project evaluation, monitoring, measurement & verification, data analysis and report writing.</li><li>Highly developed analytical, decision making, problem solving and conflict resolution skills, with a history of successfully demonstrating collaboration, teamwork, innovation, organization, coordination and planning skills.</li><li>Strong leadership and management skills as evidenced by past successful performance, with demonstrated supervisory competencies including the ability to coach, hold accountable, mentor, engage and motivate staff.</li><li>Demonstrated ability in preparing technical reports and deliverables to successful conclusion.</li></ul><p><br></p><p><strong>Qualifications:</strong></p><p><br></p><ul><li>Good knowledge of CANDU nuclear power plant design and operation as well as CANDU reactor components (specifically primary heat transport, feeder, calandria).</li><li>Understanding of engineering change control process.</li><li>Experience in compliance with regulatory standards and customer requirements.</li><li>Experience in piping and equipment design.</li><li>In depth knowledge of CSA N285.0, N286.7 and N289 as well as ASME Section III Subsections NB, NC, ND, NF, ASME B31.1, B31.3 and ASME Section VIII.</li><li>Good understanding and experience with Engineering Change Control (ECC) process.</li><li>Past experience that supports ASME Section III Appendix XXIII Qualification for Design Specification and Overpressure Protection Report is considered an asset.</li><li>The successful candidate will be recognized by his/her peers for professionalism, superior performance, knowledge, expertise, and ability to work in team environment.</li><li>Candidates must be pursuing towards P.Eng. designation and valid Nuclear site access.</li><li>Candidates must be eligible to work in Canada.</li><li>The knowledge and skills required include successful completion of a university degree, Masters or PhD (Mechanical) and have a minimum of 3-5 years relevant practical experience in a project engineering or field-engineering role.</li></ul><p><br></p><p><br></p><p>NSI is particularly interested in people who enjoy working on a variety of work and who are keen to continue to develop their knowledge and expertise.</p><p><br></p><p>If you believe you have the necessary knowledge, experience, and enthusiasm to succeed in this position, then we would like to hear from you.</p><p><br></p><p><em>We thank all applicants for their interest; however only those candidates selected for an interview will be contacted. We are dedicated to maintaining a respectful, fair, and equitable work environment, and welcome submissions from all qualified applicants. We are committed to providing a barrier free workplace. If accommodation is required during the selection or interview process it will be available upon request.</em></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:37.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Next Structural Integrity Inc.",
    "role": "Senior Mechanical Design Engineer",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "Next Structural Integrity Inc., is a leading engineering company providing essential engineering services and solving complex problems for our clients in the Nuclear and Oil and Gas industries. We are...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 25,
    "relevanceReason": "The candidate's software engineering experience is not a relevant match for this mechanical design engineering role in the nuclear and oil & gas industries. The job posting requires specific domain knowledge and experience in areas outside of the candidate's software engineering skillset, resulting in a poor match. It also requires experience in CANDU nuclear power plant design, which is not in the candidate's experience.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "3-5",
    "hardSkillsRequired": "CANDU nuclear power plant design, ASME Section III, Piping and equipment design",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "8916ffd620f2724ec7581f75a897ef21",
    "url": "https://ca.linkedin.com/jobs/view/marketing-manager-at-carousel-4292020483",
    "title": "Carousel hiring Marketing Manager in Montreal, Quebec, Canada ",
    "content_text": "We're hiring! Carousel is looking for a creative and driven Marketing Manager to help shape and amplify our brand across digital channels. If you're passionate about crafting compelling content, launching high-impact campaigns, and building a unified brand presence in a fast-paced fintech environment, we’d love to connect.\nAbout Carousel:We help American and Canadian businesses transform their operations by collecting applicant data with unmatched speed. Operating at the intersection of fintech and data infrastructure, our modular ecosystem empowers businesses to build custom workflows that gather identity and financial information—seamlessly, securely, and at scale.\nAbout the Role:As our Marketing Manager, you will be responsible for creating and managing high-impact digital content and campaigns that reflect and strengthen the Carousel brand. This is a hands-on role that blends strategy, creativity, and execution.\nKey Responsibilities:Develop and deliver compelling digital content across channels (copy, visuals, social, web, and product)Own and evolve Carousel's brand identity across all platformsPlan, launch, and optimize digital marketing campaigns (paid and organic) to drive awareness, engagement, and conversionsCollaborate with product, design, and leadership teams to ensure consistent messaging and visual identityAnalyze performance data to generate insights, report on KPIs, and refine marketing strategies accordinglyThis is a hybrid position with in-office days at our Montreal, QC location.\nWhat We’re Looking For:Minimum 5 years of experience in marketing, with a strong focus on digital and content marketingExceptional writing and editing skills, with a strong eye for design and detailProficiency with content and design tools such as Canva, Figma, Adobe Creative Suite, etc.Experience managing campaigns on platforms like Meta Ads (Facebook/Instagram), Google Ads, LinkedIn, etc.Strong understanding of marketing analytics and performance metricsAbility to manage multiple projects and deadlines in a fast-paced environmentCollaborative team player with a proactive mindset\nWhat We Offer:A dynamic and entrepreneurial team environmentCompetitive salary and benefits packageOpportunities for professional growth and developmentA chance to shape the marketing strategy of a growing fintech brandVibrant office space in the heart of TMR\nIf this looks like it would be a good fit for you, we want to hear from you!",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>We're hiring! Carousel is looking for a creative and driven Marketing Manager to help shape and amplify our brand across digital channels. If you're passionate about crafting compelling content, launching high-impact campaigns, and building a unified brand presence in a fast-paced fintech environment, we’d love to connect.</p><p><br></p><p>About Carousel:</p><p>We help American and Canadian businesses transform their operations by collecting applicant data with unmatched speed. Operating at the intersection of fintech and data infrastructure, our modular ecosystem empowers businesses to build custom workflows that gather identity and financial information—seamlessly, securely, and at scale.</p><p><br></p><p>About the Role:</p><p>As our Marketing Manager, you will be responsible for creating and managing high-impact digital content and campaigns that reflect and strengthen the Carousel brand. This is a hands-on role that blends strategy, creativity, and execution.</p><p><br></p><p>Key Responsibilities:</p><ul><li>Develop and deliver compelling digital content across channels (copy, visuals, social, web, and product)</li><li>Own and evolve Carousel's brand identity across all platforms</li><li>Plan, launch, and optimize digital marketing campaigns (paid and organic) to drive awareness, engagement, and conversions</li><li>Collaborate with product, design, and leadership teams to ensure consistent messaging and visual identity</li><li>Analyze performance data to generate insights, report on KPIs, and refine marketing strategies accordingly</li><li>This is a hybrid position with in-office days at our Montreal, QC location.</li></ul><p><br></p><p>What We’re Looking For:</p><ul><li>Minimum 5 years of experience in marketing, with a strong focus on digital and content marketing</li><li>Exceptional writing and editing skills, with a strong eye for design and detail</li><li>Proficiency with content and design tools such as Canva, Figma, Adobe Creative Suite, etc.</li><li>Experience managing campaigns on platforms like Meta Ads (Facebook/Instagram), Google Ads, LinkedIn, etc.</li><li>Strong understanding of marketing analytics and performance metrics</li><li>Ability to manage multiple projects and deadlines in a fast-paced environment</li><li>Collaborative team player with a proactive mindset</li></ul><p><br></p><p>What We Offer:</p><ul><li>A dynamic and entrepreneurial team environment</li><li>Competitive salary and benefits package</li><li>Opportunities for professional growth and development</li><li>A chance to shape the marketing strategy of a growing fintech brand</li><li>Vibrant office space in the heart of TMR</li></ul><p><br></p><p>If this looks like it would be a good fit for you, we want to hear from you!</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:27:27.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Carousel",
    "role": "Marketing Manager",
    "location": "Montreal, Quebec, Canada ",
    "contentPreview": "We're hiring! Carousel is looking for a creative and driven Marketing Manager to help shape and amplify our brand across digital channels. If you're passionate about crafting compelling content, launc...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 25,
    "relevanceReason": "The candidate is a software engineer with strong technical skills in web development, while the job posting is for a Marketing Manager position. There is a significant mismatch in technical skills and role responsibilities, leading to a low score. The job is also in Montreal, and the candidate's location is not specified, but it's not likely that the candidate would consider relocation.",
    "recommendation": "Skip",
    "estimatedCompensation": "Not applicable",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Content Marketing, Digital Marketing, Marketing Analytics",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "59b0272a266c79577d5a8e9833ba52a6",
    "url": "https://ca.linkedin.com/jobs/view/project-manager-at-querentia-4291931797",
    "title": "Querentia hiring Project Manager in Saskatchewan, Canada ",
    "content_text": "We are seeking an experienced Project Manager with a strong background in the Power & Utilities (P&U) sector to support our client, a leading midstream operator with operations in Saskatchewan. This role will focus on identifying and executing cost reduction and revenue enhancement opportunities, with particular emphasis on optimizing power purchase costs through negotiations and commercial arrangements. Key Responsibilities:Lead initiatives aimed at reducing power-related costs through effective contract negotiations and alternative commercial structures.Partner with stakeholders to analyze current power purchase agreements and identify opportunities for savings.Develop and implement commercial strategies aligned with organizational cost-reduction and revenue-enhancement goals.Provide project management oversight to ensure deliverables are executed on time and within scope.Collaborate cross-functionally with operations, finance, and executive leadership to drive outcomes.Prepare recommendations and present findings to leadership teams.\nQualifications & Experience:Proven experience as a Project Manager within the Power & Utilities sector.Strong background in contract negotiation, commercial arrangements, and cost optimization strategies.Experience working with midstream operators or energy companies preferred.Excellent analytical, communication, and stakeholder management skills.Ability to operate effectively in both onsite and remote settings.PMP or equivalent certification is an asset.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>We are seeking an experienced Project Manager with a strong background in the <strong>Power & Utilities (P&U) sector</strong> to support our client, a leading midstream operator with operations in Saskatchewan. This role will focus on identifying and executing cost reduction and revenue enhancement opportunities, with particular emphasis on <strong>optimizing power purchase costs through negotiations and commercial arrangements</strong>.</p><p> </p><p><strong>Key Responsibilities:</strong></p><ul><li>Lead initiatives aimed at reducing power-related costs through effective contract negotiations and alternative commercial structures.</li><li>Partner with stakeholders to analyze current power purchase agreements and identify opportunities for savings.</li><li>Develop and implement commercial strategies aligned with organizational cost-reduction and revenue-enhancement goals.</li><li>Provide project management oversight to ensure deliverables are executed on time and within scope.</li><li>Collaborate cross-functionally with operations, finance, and executive leadership to drive outcomes.</li><li>Prepare recommendations and present findings to leadership teams.</li></ul><p><br></p><p><strong>Qualifications & Experience:</strong></p><ul><li>Proven experience as a <strong>Project Manager</strong> within the Power & Utilities sector.</li><li>Strong background in <strong>contract negotiation, commercial arrangements, and cost optimization strategies</strong>.</li><li>Experience working with midstream operators or energy companies preferred.</li><li>Excellent analytical, communication, and stakeholder management skills.</li><li>Ability to operate effectively in both onsite and remote settings.</li><li>PMP or equivalent certification is an asset.</li></ul><p></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:40:02.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Querentia",
    "role": "Project Manager",
    "location": "Saskatchewan, Canada ",
    "contentPreview": "We are seeking an experienced Project Manager with a strong background in the Power & Utilities (P&U) sector to support our client, a leading midstream operator with operations in Saskatchewan. This r...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 15,
    "relevanceReason": "This job posting is for a Project Manager role in the Power & Utilities sector, which does not align with the candidate's software engineering background and experience. The candidate's skills are primarily in software development, while the job requires experience in contract negotiation, commercial arrangements, and cost optimization strategies within the energy sector. Therefore, this is a poor match.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "ef53d0a9abc3d16f1cd8419657f52218",
    "url": "https://ca.linkedin.com/jobs/view/coordinator-accounts-payable-at-ontario-health-sant%C3%A9-ontario-4292032182",
    "title": "Ontario Health | Santé Ontario hiring Coordinator, Accounts Payable in Toronto, Ontario, Canada ",
    "content_text": "Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la période de dépôt des demandes sera prolongée de trois jours.\n\nTo obtain a French translation of the following job posting, please email careers@ontariohealth.ca. Requests will be addressed within three business days, and the application window will be extended by three business days.\n\nAt Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care.  \n\nWhat Ontario Health offers:  \n\nAchieving your career goals is a priority to us. Benefits of working at Ontario Health may include the following based on employment type: \n\nFully paid medical, dental and vision coverage from your first day  a health care spending or wellness spending account a premium defined benefit pension plan  three personal days and two float days annually  three weeks’ vacation to start (for individual contributors), increasing to four weeks after two years career development opportunities  a collaborative values-based team culture  a wellness program a hybrid working model  participation in Communities of Inclusion   \n\nWant to make a difference in your career?  Consider this opportunity.  \n\nOntario Health is seeking a detail-oriented and proactive Accounts Payable Coordinator to join our dynamic Finance team. Reporting to the Finance Manager, this role is part of a team responsible for processing payments exceeding $4 billion annually to suppliers, health service providers, and individuals.\n\nAs an Accounts Payable Coordinator, you’ll play a key role in ensuring that all payment requests are valid, complete, and compliant with internal policies and controls. You’ll apply professional judgment and skepticism to identify risks and errors, and contribute to maintaining the integrity of Ontario Health’s financial operations. This is a fast-paced, high-impact role where your commitment to accuracy, customer service, and continuous improvement will be highly valued.\n\nHere Is What You Will Be Doing\n\nReview, validate, and enter supplier invoices, ensuring accurate matching with purchase orders and verifying authenticity.Process various non-invoice payments, including honorariums and funding to health service providers and individuals.Assess expense reimbursements for compliance with Ontario Health policies, union agreements, and government directives.Apply sound financial judgment and professional skepticism to detect and escalate potential fraud or errors.Reconcile invoice discrepancies and supplier statements independently, escalating complex issues as needed.Proactively follow up on missing information and educate internal stakeholders on policies and procedures.Support internal and external audits by providing required documentation and insights.Maintain advanced knowledge of Workday ERP functionality and continuously seek opportunities to enhance efficiency.Collaborate across Finance and other departments to resolve issues and improve processes.Deliver excellent service to internal and external clients, building strong working relationships.Perform cross-functional duties and uphold internal controls to prevent and detect fraudulent activity.\n\nEducation And Experience\n\nHere is what you will need to be successful:\n\n1–5 years of experience in Accounts Payable or accounting, preferably in large, complex organizations.College certificate or bachelor’s degree in Accounting, Finance, or Business Administration.Accounting designation (or actively pursuing) is preferred.Experience with Workday ERP is preferred.Familiarity with the Management Board of Cabinet Travel, Meal and Hospitality Expense Directive is an asset.\n\nKnowledge And Skills\n\nStrong financial and business judgment, with a high level of professional skepticism.Exceptional attention to detail and analytical problem-solving abilities.Ability to identify and escalate issues appropriately.Effective communication and interpersonal skills; thrives in team environments.Motivated to meet deadlines and manage multiple priorities in a fast-paced setting.Commitment to continuous improvement and learning.Proficiency in Microsoft Word, Excel, and Outlook.High ethical standards and discretion when handling sensitive information.Strong customer focus and dedication to quality service.\n\n MB1\n\n#OH-IND-DIG \n\nLocation: Ontario (currently hybrid; subject to change)\n\nEmployment Type\n\nPermanent Full time\n\nContract Length\n\nN/A\n\nSalary Band\n\nBand 2\n\nExternal Application Deadline Date\n\nSeptember 10, 2025\n\nAll applicants must be a resident of Ontario to be considered for roles at Ontario Health.\n\nOntario Health encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; members of Black and racialized groups; 2SLGBTQIA+ communities; trans and nonbinary individuals; and people living with disabilities. \n\nOntario Health is an accessible employer, and we offer accommodation in all aspects of employment, including the recruitment process. If you require a disability related accommodation in order to participate in the recruitment process, please email careers@ontariohealth.ca and a member of the team will connect with you within 48 hours.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la période de dépôt des demandes sera prolongée de trois jours.<br><br></strong><strong>To obtain a French translation of the following job posting, please email careers@ontariohealth.ca. Requests will be addressed within three business days, and the application window will be extended by three business days.<br><br></strong>At Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care.  <br><br><strong>What Ontario Health offers: </strong> <br><br><strong>Achieving your career goals is a priority to us. Benefits of working at Ontario Health may include the following based on employment type:</strong> <br><br><ul><li>Fully paid medical, dental and vision coverage from your first day  </li><li>a health care spending or wellness spending account </li><li>a premium defined benefit pension plan  </li><li>three personal days and two float days annually  </li><li>three weeks’ vacation to start (for individual contributors), increasing to four weeks after two years </li><li>career development opportunities  </li><li>a collaborative values-based team culture  </li><li>a wellness program </li><li>a hybrid working model  </li><li>participation in Communities of Inclusion   <br><br></li></ul><strong>Want to make a difference in your career?  Consider this opportunity.</strong>  <br><br>Ontario Health is seeking a detail-oriented and proactive Accounts Payable Coordinator to join our dynamic Finance team. Reporting to the Finance Manager, this role is part of a team responsible for processing payments exceeding $4 billion annually to suppliers, health service providers, and individuals.<br><br>As an Accounts Payable Coordinator, you’ll play a key role in ensuring that all payment requests are valid, complete, and compliant with internal policies and controls. You’ll apply professional judgment and skepticism to identify risks and errors, and contribute to maintaining the integrity of Ontario Health’s financial operations. This is a fast-paced, high-impact role where your commitment to accuracy, customer service, and continuous improvement will be highly valued.<br><br><strong>Here Is What You Will Be Doing<br><br></strong><ul><li>Review, validate, and enter supplier invoices, ensuring accurate matching with purchase orders and verifying authenticity.</li><li>Process various non-invoice payments, including honorariums and funding to health service providers and individuals.</li><li>Assess expense reimbursements for compliance with Ontario Health policies, union agreements, and government directives.</li><li>Apply sound financial judgment and professional skepticism to detect and escalate potential fraud or errors.</li><li>Reconcile invoice discrepancies and supplier statements independently, escalating complex issues as needed.</li><li>Proactively follow up on missing information and educate internal stakeholders on policies and procedures.</li><li>Support internal and external audits by providing required documentation and insights.</li><li>Maintain advanced knowledge of Workday ERP functionality and continuously seek opportunities to enhance efficiency.</li><li>Collaborate across Finance and other departments to resolve issues and improve processes.</li><li>Deliver excellent service to internal and external clients, building strong working relationships.</li><li>Perform cross-functional duties and uphold internal controls to prevent and detect fraudulent activity.<br><br></li></ul><strong>Education And Experience<br><br></strong><strong>Here is what you will need to be successful:<br><br></strong><ul><li>1–5 years of experience in Accounts Payable or accounting, preferably in large, complex organizations.</li><li>College certificate or bachelor’s degree in Accounting, Finance, or Business Administration.</li><li>Accounting designation (or actively pursuing) is preferred.</li><li>Experience with Workday ERP is preferred.</li><li>Familiarity with the Management Board of Cabinet Travel, Meal and Hospitality Expense Directive is an asset.<br><br></li></ul><strong>Knowledge And Skills<br><br></strong><ul><li>Strong financial and business judgment, with a high level of professional skepticism.</li><li>Exceptional attention to detail and analytical problem-solving abilities.</li><li>Ability to identify and escalate issues appropriately.</li><li>Effective communication and interpersonal skills; thrives in team environments.</li><li>Motivated to meet deadlines and manage multiple priorities in a fast-paced setting.</li><li>Commitment to continuous improvement and learning.</li><li>Proficiency in Microsoft Word, Excel, and Outlook.</li><li>High ethical standards and discretion when handling sensitive information.</li><li>Strong customer focus and dedication to quality service.<br><br></li></ul> MB1<br><br>#OH-IND-DIG <br><br><strong>Location:</strong> Ontario (currently hybrid; subject to change)<br><br><strong>Employment Type<br><br></strong>Permanent Full time<br><br><strong>Contract Length<br><br></strong>N/A<br><br><strong>Salary Band<br><br></strong>Band 2<br><br><strong>External Application Deadline Date<br><br></strong>September 10, 2025<br><br><strong>All applicants must be a resident of Ontario to be considered for roles at Ontario Health.<br><br></strong><strong>Ontario Health encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; members of Black and racialized groups; 2SLGBTQIA+ communities; trans and nonbinary individuals; and people living with disabilities. <br><br></strong><strong>Ontario Health is an accessible employer, and we offer accommodation in all aspects of employment, including the recruitment process. If you require a disability related accommodation in order to participate in the recruitment process, please email careers@ontariohealth.ca and a member of the team will connect with you within 48 hours.<br><br></strong></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T19:13:33.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Ontario Health | Santé Ontario",
    "role": "Coordinator, Accounts Payable",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Pour obtenir une traduction en français de l’offre d’emploi suivante, veuillez envoyer un courriel à careers@ontariohealth.ca. Les demandes seront traitées dans un délai de trois jours ouvrables et la...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 10,
    "relevanceReason": "This job posting is for an Accounts Payable Coordinator role, which is completely unrelated to the candidate's experience as a Software Engineer with expertise in full-stack development. There is no overlap in required skills or responsibilities, making this a poor match.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "1",
    "hardSkillsRequired": "Accounting, Finance, Business Administration",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "04f2c71ab3011329ccf80288603e9bb9",
    "url": "https://ca.linkedin.com/jobs/view/accounting-analyst-at-groupe-conseil-uda-inc-4292021880",
    "title": "Groupe Conseil UDA Inc. hiring Accounting Analyst in Saint-Charles-sur-Richelieu, Quebec, Canada ",
    "content_text": "UDA Consulting Group is actively seeking an accounting analyst to join its financial team. This essential role involves the meticulous management of accounting and administrative operations, with a strong emphasis on internal collaboration and rigorous financial reporting.\n\nTeleworking available up to 3 days per week, with the option to work from our offices located in Saint-Charles-sur-Richelieu or Quebec City.\n\nWhy choose us\n\nFor our human-scale work culture and climate, both enjoyable and enriching in terms of developing skills in the environment, agriculture, forestry, and hydrogeology, where people can pursue their passion in varied and stimulating project contexts, and where their contributions are recognized and valued;For our multitude of career opportunities to continue to grow and develop in an environment conducive to professional growth (personalized training plan, development and skills acquisition);For our significant contribution to the success of development projects in Quebec by ensuring compliance with applicable environments and regulations;For our competitive compensation and comprehensive employee-focused benefits package (group insurance plan, pension plan, telemedicine, EFAP, cell phone provided, reimbursement of professional association membership fees, reimbursement of mileage traveled according to internal policy, social club activities, etc.);For our flexible working conditions aimed at balancing our professional and personal lives (teleworking offered up to 100% of the time depending on the position, condensed schedule, annual leave, etc.).\n\nJob Responsibilities\n\nAssist with the financial management of projects in the Daily.Monitor and invoicing between the various group entities, as well as proactively manage customer and supplier accounts.Accurately prepare various annual and periodic financial reports and perform the necessary bank reconciliations.Collaborate closely with project managers to ensure effective monitoring of ongoing projects.Work with the invoicing team to ensure timely and accurate delivery of documents to clients, especially during peak periods.Actively contribute to the development of budgets and financial forecasts, working closely with operational teams.Analyze and present financial metrics and relevant key performance indicators for various business areas.\n\nOther Responsibilities\n\nSupport the monthly accounting closing process and participate in audit preparation. annual.Continuously evaluate accounting processes to make recommendations to improve operational efficiency.Perform other accounting-related tasks.\n\nRequirements And Education\n\nBachelor's degree in Business Administration, Accounting profile.0 to 5 years of relevant experience in a similar position.Excellent proficiency in Office Suite tools, particularly Excel.Ability to work under pressure and coordinate multiple tasks simultaneously, while meeting tight deadlines.Ability to communicate effectively and work in a team.Rigor, proactivity, and attention to detail in work methods.Discretion and respect for confidentiality.Autonomy and ability to learn new skills.Ability to adapt to a constantly changing environment.Results-oriented while fostering collaboration and able to build harmonious relationships with peers, clients, and partners.Integrity, collaboration, accountability, and respect for deadlines.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>UDA Consulting Group is actively seeking an <strong>accounting analyst</strong> to join its financial team. This essential role involves the meticulous management of accounting and administrative operations, with a strong emphasis on internal collaboration and rigorous financial reporting.<br><br><strong>Teleworking available up to 3 days per week, with the option to work from our offices located in Saint-Charles-sur-Richelieu or Quebec City.<br><br></strong><strong>Why choose us<br><br></strong><ul><li>For our human-scale work culture and climate, both enjoyable and enriching in terms of developing skills in the environment, agriculture, forestry, and hydrogeology, where people can pursue their passion in varied and stimulating project contexts, and where their contributions are recognized and valued;</li><li>For our multitude of career opportunities to continue to grow and develop in an environment conducive to professional growth (personalized training plan, development and skills acquisition);</li><li>For our significant contribution to the success of development projects in Quebec by ensuring compliance with applicable environments and regulations;</li><li>For our competitive compensation and comprehensive employee-focused benefits package (group insurance plan, pension plan, telemedicine, EFAP, cell phone provided, reimbursement of professional association membership fees, reimbursement of mileage traveled according to internal policy, social club activities, etc.);</li><li>For our flexible working conditions aimed at balancing our professional and personal lives (teleworking offered up to 100% of the time depending on the position, condensed schedule, annual leave, etc.).<br><br></li></ul>Job Responsibilities<br><br><ul><li>Assist with the financial management of projects in the Daily.</li><li>Monitor and invoicing between the various group entities, as well as proactively manage customer and supplier accounts.</li><li>Accurately prepare various annual and periodic financial reports and perform the necessary bank reconciliations.</li><li>Collaborate closely with project managers to ensure effective monitoring of ongoing projects.</li><li>Work with the invoicing team to ensure timely and accurate delivery of documents to clients, especially during peak periods.</li><li>Actively contribute to the development of budgets and financial forecasts, working closely with operational teams.</li><li>Analyze and present financial metrics and relevant key performance indicators for various business areas.<br><br></li></ul><strong>Other Responsibilities<br><br></strong><ul><li>Support the monthly accounting closing process and participate in audit preparation. annual.</li><li>Continuously evaluate accounting processes to make recommendations to improve operational efficiency.</li><li>Perform other accounting-related tasks.<br><br></li></ul><strong>Requirements And Education<br><br></strong><ul><li>Bachelor's degree in Business Administration, Accounting profile.</li><li>0 to 5 years of relevant experience in a similar position.</li><li>Excellent proficiency in Office Suite tools, particularly Excel.</li><li>Ability to work under pressure and coordinate multiple tasks simultaneously, while meeting tight deadlines.</li><li>Ability to communicate effectively and work in a team.</li><li>Rigor, proactivity, and attention to detail in work methods.</li><li>Discretion and respect for confidentiality.</li><li>Autonomy and ability to learn new skills.</li><li>Ability to adapt to a constantly changing environment.</li><li>Results-oriented while fostering collaboration and able to build harmonious relationships with peers, clients, and partners.</li><li>Integrity, collaboration, accountability, and respect for deadlines.</li></ul></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-27T18:45:38.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Groupe Conseil UDA Inc.",
    "role": "Accounting Analyst",
    "location": "Saint-Charles-sur-Richelieu, Quebec, Canada ",
    "contentPreview": "UDA Consulting Group is actively seeking an accounting analyst to join its financial team. This essential role involves the meticulous management of accounting and administrative operations, with a st...",
    "publishedDate": "2025-08-27",
    "relevanceScore": 10,
    "relevanceReason": "This role is for an Accounting Analyst, which is a completely different field than the candidate's software engineering background. The job posting doesn't mention or require any of the candidate's technical skills. The candidate's experience in software development and related technologies is not relevant to this position.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "",
    "tailoredResume": "",
    "coverLetter": ""
  }
]