[
  {
    "id": "6ca013d63cd2cbb56988385779132bb1",
    "url": "https://ca.linkedin.com/jobs/view/senior-full-stack-software-engineer-at-manulife-4291342561",
    "title": "Manulife hiring Senior Full-Stack Software Engineer in Waterloo, Ontario, Canada ",
    "content_text": "As a market leader, John Hancock is dedicated to delivering an exceptional experience to our customers and end users. Technology is the most important enabler in our ability to provide that experience and generate business.\n\nManulife / John Hancock is seeking a highly skilled and experienced Full Stack Engineer with expertise in ReactJS, JavaScript, .Net/C#, and Cloud Tools (Docker, Kubernetes) to join our dynamic team. The ideal candidate will be leading a team of engineers responsible for designing, developing, and maintaining complex applications. Collaboration with multi-functional teams is essential to delivering high quality, scalable and performant software solutions.\n\nAre you a self-starter who loves technical challenges and looking for your next step as an Engineering Leader? Are you passionate about building high-quality, user-friendly solutions? If so, then we want to hear from you!\n\nResponsibilities\n\nDevelop and maintain clean, well-documented, and efficient code for both the front-end (React, HTML, CSS, JavaScript) and back-end (your preferred server-side language, .NET/C#).Directly manage and mentor a team of engineers, providing guidance on their work and progress.Own your work and the progress of your team, ensuring alignment with project goals and timelines.Work with product managers and other engineers to define technical requirements.Collaborate with designers to curate an idea user experience.Design and build scalable and secure APIs.Implement robust and efficient databases.Solve and debug complex technical issues.Write unit and integration tests to ensure code quality.Pair program with other engineers on the team.Stay up to date on the latest web development technologies and trends.Use leading technologies such as GitHub Copilot to increase efficiency.\n\nRequired Qualifications\n\nBachelor’s degree in computer science, Software Engineering, or a related field (or equivalent experience)Leadership experienceMinimum of 7+ years of experience as a Full Stack Software EngineerStrong understanding of front-end and back-end development principlesExcellent solving and debugging skills with collaborative approach to timely resolution and communication on after actionStrong communication and teamwork skillsAbility to assess requirements and provide technical solutioning options and level of effort estimatesContinuous learning mentality and advocate for positive change\n\nPreferred Qualifications\n\nExperience with Azure, AKS on Azure, or other cloud platforms (e.g., AWS, GCP)Experience with DevOps principles and toolsExperience with version control systems (e.g., Git)Experience with project tracking software (e.g Jira)\n\nWhat Will I Learn on this Job? \n\nYou will learn and thrive as part of a large organization which at the same has the flexibility, transparency, and a “go-getter” culture of a startup.You will have access to best-in-class technology and partners, which is something that comes with being part of an organization this size.You will have an opportunity to develop both technically as well as understand how businesses work.\n\nAbout Manulife And John Hancock\n\nManulife Financial Corporation is a leading international financial services provider, helping people make their decisions easier and lives better. To learn more about us, visit https://www.manulife.com/en/about/our-story.html.\n\nManulife is an Equal Opportunity Employer\n\nAt Manulife/John Hancock, we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour, ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law.\n\nIt is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process. All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies. To request a reasonable accommodation in the application process, contact recruitment@manulife.com.\n\nReferenced Salary Location\n\nWaterloo, Ontario\n\nWorking Arrangement\n\nHybrid\n\nSalary range is expected to be between\n\n$94,220.00 CAD - $174,980.00 CAD\n\nIf you are applying for this role outside of the primary location, please contact recruitment@manulife.com for the salary range for your location. The actual salary will vary depending on local market conditions, geography and relevant job-related factors such as knowledge, skills, qualifications, experience, and education/training. Employees also have the opportunity to participate in incentive programs and earn incentive compensation tied to business and individual performance.\n\nManulife offers eligible employees a wide array of customizable benefits, including health, dental, mental health, vision, short- and long-term disability, life and AD&D insurance coverage, adoption/surrogacy and wellness benefits, and employee/family assistance plans. We also offer eligible employees various retirement savings plans (including pension and a global share ownership plan with employer matching contributions) and financial education and counseling resources. Our generous paid time off program in Canada includes holidays, vacation, personal, and sick days, and we offer the full range of statutory leaves of absence. If you are applying for this role in the U.S., please contact recruitment@manulife.com for more information about U.S.-specific paid time off provisions.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>As a market leader, John Hancock is dedicated to delivering an exceptional experience to our customers and end users. Technology is the most important enabler in our ability to provide that experience and generate business.<br><br>Manulife / John Hancock is seeking a highly skilled and experienced Full Stack Engineer with expertise in ReactJS, JavaScript, .Net/C#, and Cloud Tools (Docker, Kubernetes) to join our dynamic team. The ideal candidate will be leading a team of engineers responsible for designing, developing, and maintaining complex applications. Collaboration with multi-functional teams is essential to delivering high quality, scalable and performant software solutions.<br><br>Are you a self-starter who loves technical challenges and looking for your next step as an Engineering Leader? Are you passionate about building high-quality, user-friendly solutions? If so, then we want to hear from you!<br><br><strong>Responsibilities<br><br></strong><ul><li>Develop and maintain clean, well-documented, and efficient code for both the front-end (React, HTML, CSS, JavaScript) and back-end (your preferred server-side language, .NET/C#).</li><li>Directly manage and mentor a team of engineers, providing guidance on their work and progress.</li><li>Own your work and the progress of your team, ensuring alignment with project goals and timelines.</li><li>Work with product managers and other engineers to define technical requirements.</li><li>Collaborate with designers to curate an idea user experience.</li><li>Design and build scalable and secure APIs.</li><li>Implement robust and efficient databases.</li><li>Solve and debug complex technical issues.</li><li>Write unit and integration tests to ensure code quality.</li><li>Pair program with other engineers on the team.</li><li>Stay up to date on the latest web development technologies and trends.</li><li>Use leading technologies such as GitHub Copilot to increase efficiency.<br><br></li></ul><strong>Required Qualifications<br><br></strong><ul><li>Bachelor’s degree in computer science, Software Engineering, or a related field (or equivalent experience)</li><li>Leadership experience</li><li>Minimum of 7+ years of experience as a Full Stack Software Engineer</li><li>Strong understanding of front-end and back-end development principles</li><li>Excellent solving and debugging skills with collaborative approach to timely resolution and communication on after action</li><li>Strong communication and teamwork skills</li><li>Ability to assess requirements and provide technical solutioning options and level of effort estimates</li><li>Continuous learning mentality and advocate for positive change<br><br></li></ul><strong>Preferred Qualifications<br><br></strong><ul><li>Experience with Azure, AKS on Azure, or other cloud platforms (e.g., AWS, GCP)</li><li>Experience with DevOps principles and tools</li><li>Experience with version control systems (e.g., Git)</li><li>Experience with project tracking software (e.g Jira)<br><br></li></ul><strong>What Will I Learn on this Job? <br><br></strong><ul><li>You will learn and thrive as part of a large organization which at the same has the flexibility, transparency, and a “go-getter” culture of a startup.</li><li>You will have access to best-in-class technology and partners, which is something that comes with being part of an organization this size.</li><li>You will have an opportunity to develop both technically as well as understand how businesses work.<br><br></li></ul><strong>About Manulife And John Hancock<br><br></strong>Manulife Financial Corporation is a leading international financial services provider, helping people make their decisions easier and lives better. To learn more about us, visit https://www.manulife.com/en/about/our-story.html.<br><br><strong>Manulife is an Equal Opportunity Employer<br><br></strong>At Manulife/John Hancock, we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour, ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law.<br><br>It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process. All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies. To request a reasonable accommodation in the application process, contact recruitment@manulife.com.<br><br><strong>Referenced Salary Location<br><br></strong>Waterloo, Ontario<br><br><strong>Working Arrangement<br><br></strong>Hybrid<br><br><strong>Salary range is expected to be between<br><br></strong>$94,220.00 CAD - $174,980.00 CAD<br><br>If you are applying for this role outside of the primary location, please contact recruitment@manulife.com for the salary range for your location. The actual salary will vary depending on local market conditions, geography and relevant job-related factors such as knowledge, skills, qualifications, experience, and education/training. Employees also have the opportunity to participate in incentive programs and earn incentive compensation tied to business and individual performance.<br><br>Manulife offers eligible employees a wide array of customizable benefits, including health, dental, mental health, vision, short- and long-term disability, life and AD&D insurance coverage, adoption/surrogacy and wellness benefits, and employee/family assistance plans. We also offer eligible employees various retirement savings plans (including pension and a global share ownership plan with employer matching contributions) and financial education and counseling resources. Our generous paid time off program in Canada includes holidays, vacation, personal, and sick days, and we offer the full range of statutory leaves of absence. If you are applying for this role in the U.S., please contact recruitment@manulife.com for more information about U.S.-specific paid time off provisions.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T19:01:36.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Manulife",
    "role": "Senior Full-Stack Software Engineer",
    "location": "Waterloo, Ontario, Canada ",
    "contentPreview": "As a market leader, John Hancock is dedicated to delivering an exceptional experience to our customers and end users. Technology is the most important enabler in our ability to provide that experience...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 85,
    "relevanceReason": "The candidate's experience with React, Typescript, and .NET/C# aligns well with the job requirements. Their leadership experience and the specified 7+ years of experience also strongly match the role's demands. Furthermore, the candidate's experience in Azure and cloud technologies is an advantage.",
    "recommendation": "Strongly Recommended",
    "estimatedCompensation": "94k-175k CAD/year",
    "yearsOfExperienceRequired": "7",
    "hardSkillsRequired": "ReactJS, JavaScript, .Net/C#",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, Golang, Postgres, AWS\nKey Achievements:\n• Led end-to-end feature development, including task planning, API and UI design (using technologies such as React and JavaScript), database changes, cloud connections, testing, and documentation.\n• Built and maintained reusable API integrations, streamlining development and customization, which improved engineering efficiency.\n• Ran ten technical interviews and onboarded/mentored three engineers, guiding their work from design to deployment. This included code reviews and pairing to accelerate their contributions.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, Tailwind CSS, CSS, HTML, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing, resulting in an estimated 50% to 100% increase in productivity.\n• Spearheaded the implementation of a new interactive 3D visualization, receiving positive feedback from stakeholders and demonstrating an ability to deliver impressive MVPs.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, Redux, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, enabling faster testing and eliminating deployment errors.\n• Delivered user stories consistently within 40% to 70% of allocated timeframes.\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension for refactoring React components, addressing a problem that other extensions could not fix.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Created a VS Code extension to solve problems with React components refactoring. Gained over 25 GitHub stars and 2800 downloads.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Full-Stack Software Engineer position at Manulife / John Hancock. The opportunity to contribute to a market leader dedicated to exceptional customer experiences resonates deeply with my professional goals. Your commitment to leveraging technology as the key enabler aligns perfectly with my passion for building impactful, high-quality solutions. I am particularly drawn to the prospect of leading a team and contributing to the ongoing evolution of your technology stack.\n\nMy experience aligns well with the requirements outlined. With over four years of full-stack development experience, including direct experience managing and mentoring engineers, I am confident in my ability to provide technical guidance and ensure project success. My background includes building and maintaining complex applications using ReactJS, JavaScript, .NET/C#, and cloud technologies. I am adept at designing scalable APIs and implementing robust databases. For example, I successfully optimized a complex dashboard using React and NextJS, drastically improving performance. My experience at Suger, where I built reusable API integrations, will allow me to quickly contribute to your existing systems. I'm also familiar with DevOps practices such as CI/CD pipelines.\n\nI thrive in collaborative environments and am passionate about continuous improvement. I am eager to stay updated on cutting-edge technologies and have demonstrated this by using tools like GitHub Copilot. I am fluent in English, and my experience leading teams and participating in technical interviews demonstrates my ability to foster a positive team environment. I am excited by the opportunity to join Manulife and contribute to your mission of delivering exceptional experiences. I am eager to discuss how I can contribute to your team and look forward to hearing from you soon."
  },
  {
    "id": "a0c3d1e67ad323320ad923a88207f2ee",
    "url": "https://ca.linkedin.com/jobs/view/senior-full-stack-engineer-toronto-at-fitch-group-inc-4291335661",
    "title": "Fitch Group, Inc. hiring Senior Full Stack Engineer (Toronto) in Toronto, Ontario, Canada ",
    "content_text": "Fitch Group is currently seeking an Senior Software Engineer, Full Stack Engineer based out of our Toronto office. \n\nFitch Group is currently seeking a Senior Software Engineer, Full Stack Programmer based out of our NYC, Chicago, London, or Manchester office.\n\nAbout Fitch Group: As a leading, global financial information services provider, Fitch Group delivers vital credit and risk insights, robust data, and dynamic tools to champion more efficient, transparent financial markets. With over 100 years of experience and colleagues in over 30 countries, Fitch Group’s culture of credibility, independence, and transparency is embedded throughout its structure, which includes Fitch Ratings, one of the world’s top three credit ratings agencies, and Fitch Solutions, a leading provider of insights, data and analytics. With dual headquarters in London and New York, Fitch Group is owned by Hearst.\n\nAbout the Team: Fitch's Technology & Data Team is a dynamic department where innovation meets impact. Driven by investment in cutting-edge technologies like AI and cloud solutions, we’re home to diverse roles united by a passion for leveraging modern technology to drive projects that matter.\n\nHow You’ll Make An Impact\n\n Work as part of an agile team in design, development, and deployment of enterprise-scale web applications.  Build an internal portal application using React, micro-frontend, micro-services, and event-driven architecture.  Develop Java micro-services to support the frontend and produce/consume Kafka topics.  Collaborate with DevOps and other squads on the CI/CD pipeline.  Provide support on production issues and mentor the team on React and micro-frontend developments. \n\nYou May Be a Good Fit If\n\n You hold a Bachelor’s degree in computer science, Software Engineering, or a related field.  You have 5+ years of experience in software engineering.  You possess in-depth knowledge of JavaScript and React.  You have experience with Webpack, Module Federation, and micro-frontend development.  You have experience with relational database technologies such as Oracle, PostgreSQL, or MySQL. \n\nWhat Would Make You Stand Out\n\n Familiarity with AWS services such as EC2, S3, RDS, EKS, or Elasticsearch.  Experience with Kafka and MongoDB.  Experience with Artificial Intelligence (AI) technologies and frameworks. \n\nWhy Choose Fitch\n\n Hybrid Work Environment: 2 to 3 days a week in office required based on your line of business and location  A Culture of Learning & Mobility: Dedicated trainings, leadership development and mentorship programs designed to ensure that your time at Fitch will be a continuous learning opportunity  Investing in Your Future: Retirement planning and tuition reimbursement programs that empower you to achieve your short and long-term goals  Promoting Health & Wellbeing: Comprehensive healthcare offerings that enable physical, mental, financial, social, and occupational wellbeing  Supportive Parenting Policies: Family-friendly policies, including a generous global parental leave plan, designed to help you balance career and family life effectively  Inclusive Work Environment : A collaborative workplace where all voices are valued, with Employee Resource Groups that unite and empower our colleagues around the globe  Dedication to Giving Back: Paid volunteer days, matched funding for donations and ample opportunities to volunteer in your community \n\nFitch is committed to providing global securities markets with objective, timely, independent and forward-looking credit opinions. To protect Fitch’s credibility and reputation, our employees must take every precaution to avoid conflicts of interest or any appearance of a conflict of interest. Should you be successful in the recruitment process at Fitch Ratings you will be asked to declare any securities holdings and other potential conflicts prior to commencing employment. If you, or your immediate family, have any holdings that may conflict with your work responsibilities, you may be asked to divest yourself of them before beginning work.\n\nFitch is proud to be an Equal Opportunity and Affirmative Action Employer. We evaluate qualified applicants without regard to race, color, national origin, religion, sex, sexual orientation, gender identity, disability, protected veteran status, and other statuses protected by law.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Fitch Group is currently seeking an Senior Software Engineer, Full Stack Engineer based out of our Toronto office. <br><br></strong>Fitch Group is currently seeking a Senior Software Engineer, Full Stack Programmer based out of our NYC, Chicago, London, or Manchester office.<br><br><strong>About Fitch Group:</strong> As a leading, global financial information services provider, Fitch Group delivers vital credit and risk insights, robust data, and dynamic tools to champion more efficient, transparent financial markets. With over 100 years of experience and colleagues in over 30 countries, Fitch Group’s culture of credibility, independence, and transparency is embedded throughout its structure, which includes Fitch Ratings, one of the world’s top three credit ratings agencies, and Fitch Solutions, a leading provider of insights, data and analytics. With dual headquarters in London and New York, Fitch Group is owned by Hearst.<br><br><strong>About the Team:</strong> Fitch's Technology & Data Team is a dynamic department where innovation meets impact. Driven by investment in cutting-edge technologies like AI and cloud solutions, we’re home to diverse roles united by a passion for leveraging modern technology to drive projects that matter.<br><br><strong>How You’ll Make An Impact<br><br></strong><ul><li> Work as part of an agile team in design, development, and deployment of enterprise-scale web applications. </li><li> Build an internal portal application using React, micro-frontend, micro-services, and event-driven architecture. </li><li> Develop Java micro-services to support the frontend and produce/consume Kafka topics. </li><li> Collaborate with DevOps and other squads on the CI/CD pipeline. </li><li> Provide support on production issues and mentor the team on React and micro-frontend developments. <br><br></li></ul><strong>You May Be a Good Fit If<br><br></strong><ul><li> You hold a Bachelor’s degree in computer science, Software Engineering, or a related field. </li><li> You have 5+ years of experience in software engineering. </li><li> You possess in-depth knowledge of JavaScript and React. </li><li> You have experience with Webpack, Module Federation, and micro-frontend development. </li><li> You have experience with relational database technologies such as Oracle, PostgreSQL, or MySQL. <br><br></li></ul><strong>What Would Make You Stand Out<br><br></strong><ul><li> Familiarity with AWS services such as EC2, S3, RDS, EKS, or Elasticsearch. </li><li> Experience with Kafka and MongoDB. </li><li> Experience with Artificial Intelligence (AI) technologies and frameworks. <br><br></li></ul><strong>Why Choose Fitch<br><br></strong><ul><li> Hybrid Work Environment: 2 to 3 days a week in office required based on your line of business and location </li><li> A Culture of Learning & Mobility: Dedicated trainings, leadership development and mentorship programs designed to ensure that your time at Fitch will be a continuous learning opportunity </li><li> Investing in Your Future: Retirement planning and tuition reimbursement programs that empower you to achieve your short and long-term goals </li><li> Promoting Health & Wellbeing: Comprehensive healthcare offerings that enable physical, mental, financial, social, and occupational wellbeing </li><li> Supportive Parenting Policies: Family-friendly policies, including a generous global parental leave plan, designed to help you balance career and family life effectively </li><li> Inclusive Work Environment : A collaborative workplace where all voices are valued, with Employee Resource Groups that unite and empower our colleagues around the globe </li><li> Dedication to Giving Back: Paid volunteer days, matched funding for donations and ample opportunities to volunteer in your community <br><br></li></ul>Fitch is committed to providing global securities markets with objective, timely, independent and forward-looking credit opinions. To protect Fitch’s credibility and reputation, our employees must take every precaution to avoid conflicts of interest or any appearance of a conflict of interest. Should you be successful in the recruitment process at Fitch Ratings you will be asked to declare any securities holdings and other potential conflicts prior to commencing employment. If you, or your immediate family, have any holdings that may conflict with your work responsibilities, you may be asked to divest yourself of them before beginning work.<br><br>Fitch is proud to be an Equal Opportunity and Affirmative Action Employer. We evaluate qualified applicants without regard to race, color, national origin, religion, sex, sexual orientation, gender identity, disability, protected veteran status, and other statuses protected by law.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:41:35.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Fitch Group, Inc.",
    "role": "Senior Full Stack Engineer (Toronto)",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Fitch Group is currently seeking an Senior Software Engineer, Full Stack Engineer based out of our Toronto office. Fitch Group is currently seeking a Senior Software Engineer, Full Stack Programmer ba...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 85,
    "relevanceReason": "The candidate's full-stack experience and strong React/TypeScript skills align well with the job requirements. Their experience mentoring and leading teams, coupled with familiarity with AWS, also increases the fit. Although the role does not explicitly state a need for Golang, the candidate's past experience makes them a good match.",
    "recommendation": "Strongly Recommended",
    "estimatedCompensation": "130k-170k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "JavaScript, React, relational database technologies (PostgreSQL, etc.)",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, Golang, AWS\nKey Achievements:\n• Developed and deployed end-to-end features, including APIs and UIs, demonstrating experience in full-stack development.\n• Built and integrated reusable API integrations for various platforms, streamlining development processes.\n• Mentored three engineers, guiding them in feature development from design to deployment, showcasing leadership and team collaboration skills.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, HTML, CSS, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers in the implementation of a 3D visualization project, fostering collaboration and providing tailored feedback to enhance performance, demonstrating leadership abilities.\n• Improved team productivity by an estimated 50% to 100%, as measured by reduced time for delivering user stories, highlighting strong teamwork and project management capabilities.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, CSS, HTML, Redux, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, accelerating testing cycles and eliminating deployment errors, showcasing DevOps knowledge\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, demonstrating ability to meet deadlines\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension that solves a problem that other extensions couldn't. \n• Achieved over 25 Github Stars on the repo and 2800 downloads demonstrating an understanding of React.\n\n",
    "coverLetter": "I am writing to express my strong interest in the Senior Full Stack Engineer position at Fitch Group in Toronto. As a global financial information services provider, Fitch Group’s commitment to delivering vital credit and risk insights resonates deeply with my passion for building impactful and transparent solutions. The opportunity to contribute to innovative projects, especially within a team leveraging cutting-edge technologies like AI and cloud solutions, is incredibly appealing. I'm particularly excited by the prospect of developing an internal portal application and working with micro-frontend and event-driven architecture.\n\nMy experience aligns well with the requirements of this role. With over four years of full-stack engineering experience, including leading teams and end-to-end feature delivery, I am confident in my ability to contribute to the design, development, and deployment of enterprise-scale web applications. My proficiency in JavaScript, React, and related technologies, coupled with my experience building and integrating APIs, will allow me to quickly contribute to the team. Furthermore, my background in optimizing performance and usability, such as my work on industrial data dashboards, demonstrates my ability to tackle complex challenges and deliver high-quality results.\n\nI am a collaborative and results-oriented engineer, and I am eager to join a dynamic team like the one at Fitch Group. My experience mentoring junior engineers, paired with my ability to quickly adapt and learn new technologies, makes me confident I can contribute to a positive and productive work environment. I am enthusiastic about the opportunity to contribute to Fitch Group's mission. I am looking forward to discussing how my skills and experience align with your needs. Thank you for your time and consideration."
  },
  {
    "id": "50368251065b28c622698b1cf8e798c6",
    "url": "https://ca.linkedin.com/jobs/view/senior-software-developer-backend-at-blue-j-4286949151",
    "title": "Blue J hiring Senior Software Developer (Backend) in Ontario, Canada ",
    "content_text": "About Blue JBlue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an exciting product development roadmap to continue to delight our customers and to ensure that our users can generate the very best possible tax research answers in the service of their clients in record time.\nOur company is at the forefront of applying artificial intelligence to tax research. We recently announced our $122M USD Series D raise, to accelerate innovation and deliver even greater value to tax professionals. Since launching our flagship generative AI product, we have blown past our revenue targets quarter over quarter.\nWe're now looking for a skilled Senior Software Developer (backend) who thrives in a fast-paced environment and is passionate about shaping the future of AI-assisted tax research. Your work will directly contribute to enhancing our product and AI capabilities, ensuring our technology remains at the industry's leading edge.\nAbout The Engineering TeamAs a Senior Software Developer (backend), you will be joining a world-class engineering team capable of delivering award-winning products at industry leading levels of speed and quality.\nWe are looking for someone that shares our desire to make an impact and our belief that high quality-standards contribute to our ability to move fast. As relentless learners, we are constantly looking for ways to hone our craft and share our knowledge. We value software design fundamentals and the deep thinking required to ensure we’ll continue to move fast in the future. And fast we are - we ship many of our services through to production many times per day!\nA Note on LocationWe are excited to meet with qualified candidates and are grateful for everyone’s interest, however this is a hybrid position that requires applicants to be within driving distance of Toronto for 1-2 in person meetings a quarter. All candidates must be eligible to work in Canada.\nAbout the RoleWe are looking for a seasoned software developer capable of delivering significant impact directly and indirectly through peer mentorship. You will be responsible for leading the design and implementation of critical systems.\nWe take on a wide variety of challenges. You could be building user-facing product features, designing new strategies for answering questions, implementing new data pipelines for bringing additional content into our system, designing new search algorithms, or extending our internal data-mesh infrastructure.\nWhat You'll be DoingChallenging yourself to design, plan, and deliver new software products, capabilities, and featuresA substantial amount of coding while leading other developers to help you deliver mission critical projects in an iterative and incremental fashion, regularly unlocking customer value along the wayCoaching developers in the craft of writing beautiful code covered by well written automated tests while nurturing the long-term health of the systems we work onGiving impactful feedback in an empathetic manner to those around youHelping elevate our engineering standards, tools, and practices\nYour Skills and ExperienceYou have 8+ years of demonstrable software development experience with a minimum of 2 years experience working with TypeScriptStrong written and verbal communication skillsYou’ve led significant initiatives involving multiple developersYou approach your work with rigour and have an insatiable desire to learn\nTechnologies you can expect to work withNode.js / TypeScript / PythonApache Kafka / Postgres / Pinecone / ElasticSearchOpenAI / LLMsKubernetes / AWS / Docker / DataDogReact / HTML / CSS\nA bit about usWe’re well-funded and offer competitive base salaries and stock options. You’ll play a crucial role in our growth, and it’s important to us that you share in our long-term success.We are taking an exciting, highly anticipated new product into a virtually untapped market at a time when there is a huge amount of buzz around the type of work that we do. You’ll have the opportunity to work at our growing organization, and play a meaningful role in our expansion.We've got great leadership and you'll get to work with and learn from team leaders with a proven track record of success in the technology industry.We’ve got an amazing team. We’re mission-driven and motivated by success, but we’re friendly, we’re collaborative, and we care about each other. We’ve got all the start-up perks you’d expect, and are intentionally building a culture where you can pickleball if you want, feel safe to be yourself at work, and watch your career grow because your team has invested in you.We care about you. You’ll have a healthy work/life balance and colleagues who respect it. We’ve mindfully put together a great benefits package that covers you and your whole family.\nThe core values that define our cultureWe are customer-focusedWe put the team interest before self-interestWe are pleasant and playfulWe are open to better ideasWe deliver on our promisesWe solve the tough problems\nWe respect the people who put time and effort into applying for a job with us, and will do our very best to respond to candidates within 3 weeks of their application.\nWe believe our strength is built on diversity of thought, and encourage candidates from all backgrounds and experiences to apply. We value inclusiveness and are an equal opportunity employer. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nWe strive to create an inclusive and accessible hiring experience for all candidates. If you need any accommodations during the interview process, please let us know in your application. Our team is dedicated to providing the necessary support and making reasonable adjustments to ensure a smooth process for everyone.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>About Blue J</strong></p><p>Blue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an exciting product development roadmap to continue to delight our customers and to ensure that our users can generate the very best possible tax research answers in the service of their clients in record time.</p><p><br></p><p>Our company is at the forefront of applying artificial intelligence to tax research. We recently announced our <strong>$122M USD Series D raise</strong>, to accelerate innovation and deliver even greater value to tax professionals. Since launching our flagship generative AI product, we have blown past our revenue targets quarter over quarter.</p><p><br></p><p>We're now looking for a skilled Senior Software Developer (backend) who thrives in a fast-paced environment and is passionate about shaping the future of AI-assisted tax research. Your work will directly contribute to enhancing our product and AI capabilities, ensuring our technology remains at the industry's leading edge.</p><p><br></p><p><strong>About The Engineering Team</strong></p><p>As a Senior Software Developer (backend), you will be joining a world-class engineering team capable of delivering award-winning products at industry leading levels of speed and quality.</p><p><br></p><p>We are looking for someone that shares our desire to make an impact and our belief that high quality-standards contribute to our ability to move fast. As relentless learners, we are constantly looking for ways to hone our craft and share our knowledge. We value software design fundamentals and the deep thinking required to ensure we’ll continue to move fast in the future. And fast we are - we ship many of our services through to production many times per day!</p><p><br></p><p><strong>A Note on Location</strong></p><p>We are excited to meet with qualified candidates and are grateful for everyone’s interest, however this is a hybrid position that requires applicants to be within driving distance of Toronto for 1-2 in person meetings a quarter. All candidates must be eligible to work in Canada.</p><p><br></p><p><strong>About the Role</strong></p><p>We are looking for a seasoned software developer capable of delivering significant impact directly and indirectly through peer mentorship. You will be responsible for leading the design and implementation of critical systems.</p><p><br></p><p>We take on a wide variety of challenges. You could be building user-facing product features, designing new strategies for answering questions, implementing new data pipelines for bringing additional content into our system, designing new search algorithms, or extending our internal data-mesh infrastructure.</p><p><br></p><p><strong>What You'll be Doing</strong></p><ul><li>Challenging yourself to design, plan, and deliver new software products, capabilities, and features</li><li>A substantial amount of coding while leading other developers to help you deliver mission critical projects in an iterative and incremental fashion, regularly unlocking customer value along the way</li><li>Coaching developers in the craft of writing beautiful code covered by well written automated tests while nurturing the long-term health of the systems we work on</li><li>Giving impactful feedback in an empathetic manner to those around you</li><li>Helping elevate our engineering standards, tools, and practices</li></ul><p><br></p><p><strong>Your Skills and Experience</strong></p><ul><li>You have 8+ years of demonstrable software development experience with a minimum of 2 years experience working with TypeScript</li><li>Strong written and verbal communication skills</li><li>You’ve led significant initiatives involving multiple developers</li><li>You approach your work with rigour and have an insatiable desire to learn</li></ul><p><br></p><p><strong>Technologies you can expect to work with</strong></p><ul><li>Node.js / TypeScript / Python</li><li>Apache Kafka / Postgres / Pinecone / ElasticSearch</li><li>OpenAI / LLMs</li><li>Kubernetes / AWS / Docker / DataDog</li><li>React / HTML / CSS</li></ul><p><br></p><p><strong>A bit about us</strong></p><ul><li>We’re well-funded and offer competitive base salaries and stock options. You’ll play a crucial role in our growth, and it’s important to us that you share in our long-term success.</li><li>We are taking an exciting, highly anticipated new product into a virtually untapped market at a time when there is a huge amount of buzz around the type of work that we do. You’ll have the opportunity to work at our growing organization, and play a meaningful role in our expansion.</li><li>We've got great leadership and you'll get to work with and learn from team leaders with a proven track record of success in the technology industry.</li><li>We’ve got an amazing team. We’re mission-driven and motivated by success, but we’re friendly, we’re collaborative, and we care about each other. We’ve got all the start-up perks you’d expect, and are intentionally building a culture where you can pickleball if you want, feel safe to be yourself at work, and watch your career grow because your team has invested in you.</li><li>We care about you. You’ll have a healthy work/life balance and colleagues who respect it. We’ve mindfully put together a great benefits package that covers you and your whole family.</li></ul><p><br></p><p><strong>The core values that define our culture</strong></p><ul><li>We are customer-focused</li><li>We put the team interest before self-interest</li><li>We are pleasant and playful</li><li>We are open to better ideas</li><li>We deliver on our promises</li><li>We solve the tough problems</li></ul><p><br></p><p>We respect the people who put time and effort into applying for a job with us, and will do our very best to respond to candidates within 3 weeks of their application.</p><p><br></p><p>We believe our strength is built on diversity of thought, and encourage candidates from all backgrounds and experiences to apply. We value inclusiveness and are an equal opportunity employer. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><p><br></p><p>We strive to create an inclusive and accessible hiring experience for all candidates. If you need any accommodations during the interview process, please let us know in your application. Our team is dedicated to providing the necessary support and making reasonable adjustments to ensure a smooth process for everyone.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:34:14.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Blue J",
    "role": "Senior Software Developer (Backend)",
    "location": "Ontario, Canada ",
    "contentPreview": "About Blue JBlue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an excitin...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 85,
    "relevanceReason": "The candidate has a strong technical skills match with experience in TypeScript, Node.js, and Postgres, as well as leadership experience which are all requirements in the job posting. The candidate's experience aligns well with the Senior level requirements.",
    "recommendation": "Strongly Recommended",
    "estimatedCompensation": "120k-180k CAD/year",
    "yearsOfExperienceRequired": "8",
    "hardSkillsRequired": "TypeScript, Node.js, Postgres",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS, Typescript, APIs\nKey Achievements:\n• Engineered and delivered end-to-end features, including API integrations, database changes, and cloud connections, facilitating seamless integration with platforms like Salesforce and HubSpot.\n• Built reusable API integrations, reducing development time and enabling easier customization for integrations.\n• Participated in the hiring process, including interviewing candidates, evaluating projects, and making hiring decisions, contributing to a high-performing engineering team.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n• Spearheaded the implementation of a new interactive 3D visualization, enhancing data contextualization and impressing stakeholders with the MVP's capabilities.\n\n\n\nPROJECTS\nReact Extract (VS Code Extension)\nA VS Code extension for refactoring React components, praised for solving a problem that larger extensions couldn't.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Developed a widely adopted VS Code extension (2800+ downloads, 5/5 review) that enhances developer productivity through improved code refactoring.\n• Demonstrated proficiency in software design and problem-solving by creating a solution that solved an existing problem in the developer community.\n• Utilized Typescript and React for the project, showcasing the ability to work with modern web development tools.\n\n",
    "coverLetter": "I am writing to express my keen interest in the Senior Software Developer (Backend) position at Blue J, as advertised. The opportunity to contribute to a company at the forefront of applying AI to tax research is incredibly exciting. I am particularly drawn to Blue J's ambition to be the world leader and its impressive growth, as demonstrated by your recent Series D raise and rapid revenue expansion. Your commitment to innovation and delivering value to tax professionals deeply resonates with my own passion for developing impactful, cutting-edge solutions.\n\nWith over four years of experience building robust and scalable backend systems, I am confident I can significantly contribute to your team's success. My experience at Suger, building and integrating APIs, aligns perfectly with the needs of enhancing your product and AI capabilities. Furthermore, my expertise in optimizing performance, as demonstrated at Radix Engineering and Software, ensures that I'm well-equipped to contribute to high-quality standards and accelerate your ability to move fast. My experience in leading teams and mentoring engineers will enable me to quickly integrate and contribute to your engineering team.\n\nI am a relentless learner who thrives in fast-paced environments and values high-quality standards, mirroring Blue J's culture. My contributions to open-source projects, such as React Extract, highlight my proactive approach to problem-solving and commitment to community collaboration. I am eager to learn from a world-class engineering team, share my knowledge, and contribute to a culture of continuous improvement. I am available to meet in person in Toronto as required, and I am confident that I can make a significant contribution to Blue J's ongoing success. I look forward to the opportunity to discuss my qualifications further."
  },
  {
    "id": "afc99d95770358c5472a91a99c73b651",
    "url": "https://ca.linkedin.com/jobs/view/senior-software-engineer-at-apex-systems-4291644527",
    "title": "Apex Systems hiring Senior Software Engineer in Toronto, Ontario, Canada ",
    "content_text": "Job#: 2080757\n\nJob Description:\n\nSenior Software Engineer \n\nApex Systems is a global IT services provider, and our staffing practice has an opening in the Online Retail space for a Senior Software Engineer with 5+ years experience in API integration, SQL and Ruby on Rails to place at our client.\n\nStart date:  ASAP.\n\nDuration:  6 months\n\nOffice Location:  Toronto\n\nHybrid:  preferred on weekly basis\n\nApplication Process: It is best to apply via the medium on which you are seeing this posting. If you encounter technical difficulties submitting your resume, please send a Word version of your resume to Mauncho Ogega at [email protected]\n\nAbout Our Client\n\nOur Client is the North American leader in online grocery and one of the fastest-growing companies in e-commerce. Our Client’s same-day delivery and pickup services bring fresh groceries and everyday essentials to busy people and families across the U.S. and Canada in as fast as an hour. Since its founding, Our Client has become an essential service for millions of families, while also serving as an immediate, flexible earnings opportunity for hundreds of thousands of shoppers across North America. The company partners with more than 350 retailers and delivers from more than 25,000 stores across more than 5,500 cities in North America. Today, Our Client is accessible to more than 85% of households in the U.S. and more than 70% of households in Canada.\n\nAbout The Role\n\nTechnology @ Our Client\n\nFrom a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. The technology coupled with operational expertise enables Our Client to deliver fresh groceries in as little as an hour. This is a difficult problem to master and they are making it happen. Every day, they solve incredibly hard problems to create an experience for their customers that is absolutely magical.\n\nSkills: Ruby on Rails, SQL, GoLang, NodeJS, React and Elasticsearch.\n\nAbout Back End At Our Client\n\nThe backend systems power the clients used by millions of customers every year to buy their groceries online. These systems must also support tight integration with the largest retailers in the US and Canada. Backend engineering at Our Client provides the opportunity to work on challenging scaling solutions while also designing the features that will define our industry. Youll have the opportunity to work with an Elasticsearch cluster serving millions of requests per day, a unique order lifecycle system that processes thousands of order per hour, and a recovery system capable of rebuilding the entire platform from scratch.\n\nOur Client’s applications run on Ruby on Rails. They use Postgres, Elasticsearch, and Cassandra as datastores. Memcached and Redis for caching. Kinesis for stream processing. Sidekiq for job processing. As they grow to serve more customers and deepen their relationships with retail partners they are constantly given new opportunities to solve fascinating and rewarding challenges.\n\nResponsibilities\n\n You will be part of a small team, with a large amount of ownership and autonomy for managing things directly.  You will work closely with product managers, other teams, and both internal and external stakeholders, owning a large part of the process from problem understanding to shipping the solution.  You will ship high quality, scalable and robust solutions with a sense of urgency.  You will have the freedom to suggest and drive organization-wide initiatives. \n\nRequirements\n\n Self-motivation and an enjoyment for a startup environment  A strong sense of ownership  Strong knowledge of common back-end Web technologies (such as Ruby on Rails, GoLang, NodeJS, React etc.) in a production environment  An ability to balance a sense of urgency with shipping high quality and pragmatic solutions  Experience working with a large codebase on a cross functional team.  Strong knowledge of SQL  Bachelor’s degree in Computer Science, computer engineering, electrical engineering OR equivalent work experience  5+ years Ruby on Rails  API integration  Integrate with different retailers  Mostly REST sometimes SOAP at times GraphQL \n\nEEO Employer\n\n Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [email protected] or 844-463-6178. \n\nApex Systems is a world-class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico.\n\nApex Benefits Overview: Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on-demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide.\n\nApex Systems is a world-class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico.\n\nApex Benefits Overview: Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on-demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide.\n\nApex Systems is part of the Commercial Segment of ASGN Incorporated.\n\nNYSE: ASGN\n\n4400 Cox Road\n\nSuite 200\n\nGlen Allen, Virginia 23060\n\nApex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [email protected] (Do not submit resumes or solicit consultants to this email address). UnitedHealthcare creates and publishes the Transparency in Coverage Machine-Readable Files on behalf of Apex Systems.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Job#: 2080757<br><br></strong><strong>Job Description:<br><br></strong><strong>Senior Software Engineer <br><br></strong>Apex Systems is a global IT services provider, and our staffing practice has an opening in the Online Retail space for a Senior Software Engineer <strong>with</strong> 5+ years experience in API integration, SQL and Ruby on Rails to place at our client.<br><br><strong>Start date: </strong> ASAP.<br><br><strong>Duration: </strong> 6 months<br><br><strong>Office Location: </strong> Toronto<br><br><strong>Hybrid: </strong> preferred on weekly basis<br><br><strong>Application Process:</strong> It is best to apply via the medium on which you are seeing this posting. If you encounter technical difficulties submitting your resume, please send a Word version of your resume to Mauncho Ogega at [email protected]<br><br><strong>About Our Client<br><br></strong>Our Client is the North American leader in online grocery and one of the fastest-growing companies in e-commerce. Our Client’s same-day delivery and pickup services bring fresh groceries and everyday essentials to busy people and families across the U.S. and Canada in as fast as an hour. Since its founding, Our Client has become an essential service for millions of families, while also serving as an immediate, flexible earnings opportunity for hundreds of thousands of shoppers across North America. The company partners with more than 350 retailers and delivers from more than 25,000 stores across more than 5,500 cities in North America. Today, Our Client is accessible to more than 85% of households in the U.S. and more than 70% of households in Canada.<br><br><strong>About The Role<br><br></strong><strong>Technology @ Our Client<br><br></strong>From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. The technology coupled with operational expertise enables Our Client to deliver fresh groceries in as little as an hour. This is a difficult problem to master and they are making it happen. Every day, they solve incredibly hard problems to create an experience for their customers that is absolutely magical.<br><br><strong>Skills:</strong> Ruby on Rails, SQL, GoLang, NodeJS, React and Elasticsearch.<br><br><strong>About Back End At Our Client<br><br></strong>The backend systems power the clients used by millions of customers every year to buy their groceries online. These systems must also support tight integration with the largest retailers in the US and Canada. Backend engineering at Our Client provides the opportunity to work on challenging scaling solutions while also designing the features that will define our industry. Youll have the opportunity to work with an Elasticsearch cluster serving millions of requests per day, a unique order lifecycle system that processes thousands of order per hour, and a recovery system capable of rebuilding the entire platform from scratch.<br><br>Our Client’s applications run on Ruby on Rails. They use Postgres, Elasticsearch, and Cassandra as datastores. Memcached and Redis for caching. Kinesis for stream processing. Sidekiq for job processing. As they grow to serve more customers and deepen their relationships with retail partners they are constantly given new opportunities to solve fascinating and rewarding challenges.<br><br><strong>Responsibilities<br><br></strong><ul><li> You will be part of a small team, with a large amount of ownership and autonomy for managing things directly. </li><li> You will work closely with product managers, other teams, and both internal and external stakeholders, owning a large part of the process from problem understanding to shipping the solution. </li><li> You will ship high quality, scalable and robust solutions with a sense of urgency. </li><li> You will have the freedom to suggest and drive organization-wide initiatives. <br><br></li></ul><strong>Requirements<br><br></strong><ul><li> Self-motivation and an enjoyment for a startup environment </li><li> A strong sense of ownership </li><li> Strong knowledge of common back-end Web technologies (such as Ruby on Rails, GoLang, NodeJS, React etc.) in a production environment </li><li> An ability to balance a sense of urgency with shipping high quality and pragmatic solutions </li><li> Experience working with a large codebase on a cross functional team. </li><li> Strong knowledge of SQL </li><li> Bachelor’s degree in Computer Science, computer engineering, electrical engineering OR equivalent work experience </li><li> 5+ years Ruby on Rails </li><li> API integration </li><li> Integrate with different retailers </li><li> Mostly REST sometimes SOAP at times GraphQL <br><br></li></ul>EEO Employer<br><br><ul><li> Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [email protected] or 844-463-6178. <br><br></li></ul>Apex Systems is a world-class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico.<br><br><strong>Apex Benefits Overview: </strong>Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on-demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide.<br><br>Apex Systems is a world-class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico.<br><br><strong>Apex Benefits Overview: </strong>Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on-demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide.<br><br>Apex Systems is part of the Commercial Segment of ASGN Incorporated.<br><br>NYSE: ASGN<br><br>4400 Cox Road<br><br>Suite 200<br><br>Glen Allen, Virginia 23060<br><br>Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [email protected] (Do not submit resumes or solicit consultants to this email address). UnitedHealthcare creates and publishes the Transparency in Coverage Machine-Readable Files on behalf of Apex Systems.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T19:07:18.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Apex Systems",
    "role": "Senior Software Engineer",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Job#: 2080757 Job Description: Senior Software Engineer Apex Systems is a global IT services provider, and our staffing practice has an opening in the Online Retail space for a Senior Software Enginee...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 78,
    "relevanceReason": "The candidate's experience in full-stack development, TypeScript, and Golang aligns well with the role's requirements. The role's focus on Ruby on Rails presents a gap, but the candidate's strong experience and adaptability make this a good match. The role is located in Toronto, where the candidate could work with a hybrid work arrangement.",
    "recommendation": "Good match, recommended",
    "estimatedCompensation": "130k-170k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Ruby on Rails, SQL, API Integration",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS, Typescript, Vue\nKey Achievements:\n• Built and incremented reusable API integrations, contributing to easier and faster integrations with platforms like Salesforce, HubSpot, and NetSuite, demonstrating expertise in API development.\n• Planned and delivered features end-to-end, encompassing task planning, API development, database changes, and cloud connections, showcasing full-stack proficiency.\n• Onboarded and mentored three engineers, facilitating their rapid contribution to projects and effectively leading them in the development of larger features.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL, ThreeJS\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, workflow organization, and continuous testing resulting in an estimated 50% to 100% increase in team productivity and faster delivery of user stories.\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization, having left stakeholders impressed by the MVP and wanting to expand its features, demonstrating ability to deliver innovative solutions.\n• Demonstrated expertise in leading a team and driving project success, achieving significant gains in productivity and feature delivery\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library, demonstrating strong problem solving and efficiency.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes, showcasing efficient development and adherence to deadlines.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, with over 25 Github Stars on the repo, 2800 downloads and a 5/5 review grade on the VS Code Marketplace, praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: React, Typescript, VS Code API\nKey Achievements:\n• Developed a VS Code extension that addresses a critical need within the React development community, as evidenced by strong user engagement and positive reviews, underscoring an ability to create valuable developer tools.\n• Demonstrated proficiency in React and Typescript and API development\n\n",
    "coverLetter": "I am writing to express my keen interest in the Senior Software Engineer position at Apex Systems, as advertised. The opportunity to contribute to a company that is revolutionizing the online grocery space, as a leader in North America, is genuinely exciting. Your client's mission to provide fast and efficient grocery delivery resonates deeply with my passion for building impactful and user-centric solutions. I am particularly drawn to the challenge of working on a platform that handles millions of real-time transactions. \n\nWith over four years of experience in full-stack development, including API integration, SQL, and experience with GoLang and NodeJS, I am confident in my ability to contribute to your client's success. I have a proven track record of delivering features end-to-end and optimizing performance. In my previous role at Suger, I built reusable API integrations that improved efficiency and customization, which would be beneficial to a company partnering with over 350 retailers. My experience also includes leading teams and mentoring engineers, showcasing my ability to collaborate effectively and contribute to a supportive environment.\n\nI am eager to join a team that is dedicated to solving complex problems and creating a magical customer experience. My background in delivering projects within aggressive timelines, and my commitment to continuous improvement, aligns perfectly with the fast-paced environment. My experience in full-stack development, and my enthusiasm for learning new technologies, such as Ruby on Rails, would enable me to contribute to the team immediately. I'm looking forward to the opportunity to contribute to your client's continued growth and success. Thank you for your time and consideration. I am available for an interview at your earliest convenience."
  },
  {
    "id": "46442f32b8654fe201ca7bcb590bd7fe",
    "url": "https://ca.linkedin.com/jobs/view/senior-backend-engineer-at-jerry-4289625627",
    "title": "Jerry hiring Senior Backend Engineer in London, Ontario, Canada ",
    "content_text": "🚗 Why us? \n\nJerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious plan to become a $10B company, we’re looking for driven individuals to help scale our product.\n\n2024 was a milestone year for Jerry.ai. We delivered nearly 50% year-over-year revenue growth while reaching profitability for the first time in our history.\n\nJoin a talented team with leaders from NVIDIA, Robinhood, Amazon, Meta, ByteDance, Square, and more, and build one of the most exciting startups in the industry.\n\nAnd we're just getting started! Our growth is driven by forward-thinking technology; Harvard Business Review covered the success of our chatbot less than a year after its launch and Jerry.ai is getting mentioned in many conversations about our use of GenAI, such as this Forbes article.\n\n💻 About The Opportunity\n\nWe are seeking a purpose-driven Senior Backend Engineer to work on a critical, stealth project on our DriveShield™ team to enhance driver safety and make a real-world impact on the lives of millions.\n\nYou will play a key role in building scalable and high-performance backend systems that power Jerry.ai’s explosive growth. This is an exciting opportunity to be part of the team that that helps us go from 5M to 50M customers and disrupt a $2T market while driving innovation at scale.\n\n🫵 How you will make an impact\n\nFocus more on the non-functional requirements of backend applications, including service availability, scalability, reliability (fault tolerance), and possibly observability and securityOversee system design and architecture to ensure robust and scalable solutionsDevelop and optimize real-time data processing applications using Kafka and FlinkProfile and optimize application performanceFocus on the application side, collaborating with data scientists to deploy and integrate models in productionHandle data processing, sanitization, validation, and data QA\n\n🚀 Requirements\n\n5+ years of software engineering experienceProficient in at least one core language (e.g., Java, Python, Go, JavaScript)Expertise in Kafka Streams, Flink or similar real-time data processing frameworks Experience building real-time data processing applicationsYou are known for shipping products and features lightning-fastStartup experience at a high-growth company (nice to have)Bonus if you have previous knowledge of working with geospatial data\n\nOur tech stack \n\nJava and sometimes PythonStream processing: Kafka and FlinkHosting infra: AWS\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>🚗 Why us? <br><br></strong>Jerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious plan to become a $10B company, we’re looking for driven individuals to help scale our product.<br><br>2024 was a milestone year for Jerry.ai. We delivered nearly 50% year-over-year revenue growth while reaching profitability for the first time in our history.<br><br>Join a talented team with leaders from <strong>NVIDIA, Robinhood, Amazon, Meta, ByteDance, Square, </strong>and more, and build one of the most exciting startups in the industry.<br><br>And we're just getting started! Our growth is driven by forward-thinking technology; Harvard Business Review covered the success of our chatbot less than a year after its launch and Jerry.ai is getting mentioned in many conversations about our use of GenAI, such as this Forbes article.<br><br><strong>💻 About The Opportunity<br><br></strong>We are seeking a purpose-driven <strong>Senior Backend Engineer</strong> to work on a critical, stealth project on our <strong>DriveShield™ team</strong> to enhance driver safety and make a real-world impact on the lives of millions.<br><br>You will play a key role in building scalable and high-performance backend systems that power Jerry.ai’s explosive growth. This is an exciting opportunity to be part of the team that that helps us go from 5M to 50M customers and disrupt a $2T market while driving innovation at scale.<br><br>🫵 <strong>How you will make an impact<br><br></strong><ul><li>Focus more on the non-functional requirements of backend applications, including service availability, scalability, reliability (fault tolerance), and possibly observability and security</li><li>Oversee system design and architecture to ensure robust and scalable solutions</li><li>Develop and optimize real-time data processing applications using Kafka and Flink</li><li>Profile and optimize application performance</li><li>Focus on the application side, collaborating with data scientists to deploy and integrate models in production</li><li>Handle data processing, sanitization, validation, and data QA<br><br></li></ul>🚀 <strong>Requirements<br><br></strong><ul><li>5+ years of software engineering experience</li><li>Proficient in at least one core language (e.g., Java, Python, Go, JavaScript)</li><li>Expertise in Kafka Streams, Flink or similar real-time data processing frameworks </li><li>Experience building real-time data processing applications</li><li>You are known for shipping products and features lightning-fast</li><li>Startup experience at a high-growth company (nice to have)</li><li>Bonus if you have previous knowledge of working with geospatial data<br><br></li></ul><strong>Our tech stack <br><br></strong><ul><li>Java and sometimes Python</li><li>Stream processing: Kafka and Flink</li><li>Hosting infra: AWS<br><br></li></ul><em>While we appreciate your interest and application, only applicants under consideration will be contacted.<br><br></em><em>Jerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. <br><br></em><em>Jerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at </em><em>recruiting@jerry.ai<br><br></em><strong>About Jerry.ai<br><br></strong>Jerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.<br><br>Backed by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.<br><br>We are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.<br><br>Jerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.<br><br>Join our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T19:00:51.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Jerry",
    "role": "Senior Backend Engineer",
    "location": "London, Ontario, Canada ",
    "contentPreview": "🚗 Why us? Jerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious p...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 78,
    "relevanceReason": "João's experience with Typescript and Javascript aligns well with the role's needs. His backend experience is slightly limited as the role requires expertise in Go or Java, which is not extensively present in his resume, however his experience in Typescript and general engineering skills make him a good fit. His experience leading and mentoring teams also aligns with the senior level.",
    "recommendation": "Consider",
    "estimatedCompensation": "120k-160k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Java, Python, Go, Kafka, Flink",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS\nKey Achievements:\n• Built and maintained scalable API integrations, contributing to efficient data processing and integration with external services.\n• Implemented end-to-end features, demonstrating experience in the full software development lifecycle, including planning, design, implementation, testing, and deployment.\n• Mentored junior engineers, guiding them on feature development and providing code reviews, thus ensuring code quality and knowledge transfer.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization project, demonstrating strong leadership and ability to deliver impactful solutions.\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing, resulting in an estimated 50% to 100% increase in productivity.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes.\n\n\n\nPROJECTS\n",
    "coverLetter": "I'm incredibly excited by the opportunity at Jerry.ai! The mission to revolutionize the car ownership industry and the impressive growth trajectory, especially the recent profitability, immediately caught my attention. The prospect of contributing to a pre-IPO startup with such ambitious goals, alongside a team composed of leaders from prominent tech companies, is a thrilling prospect, particularly on the DriveShield™ team making a real-world impact on driver safety.\n\nWith over four years of experience building scalable and high-performance backend systems, I'm confident I can significantly contribute to Jerry.ai's growth. My experience in optimizing application performance, particularly optimizing performance, like I did with Radix Engineering and Software, directly aligns with the role's focus on non-functional requirements. I'm adept at developing real-time data processing applications and integrating models in production, skills that are directly transferable. I have experience with Kafka, and I can adapt fast to new technologies.\n\nI'm drawn to Jerry.ai's forward-thinking approach and commitment to innovation, reflected in its use of GenAI. As someone who enjoys working with highly driven teams and thriving in fast-paced environments, I'm confident I'll fit well into the company culture. I'm eager to contribute my skills to help Jerry.ai achieve its goal of scaling from 5M to 50M customers. I am available for an interview at your earliest convenience and look forward to discussing how I can contribute to your team's success."
  },
  {
    "id": "9ab692fd378762dd257c51d91c1655e0",
    "url": "https://ca.linkedin.com/jobs/view/senior-software-engineer-mobile-at-servicetitan-4291636820",
    "title": "ServiceTitan hiring Senior Software Engineer, Mobile in Greater Toronto Area, Canada ",
    "content_text": "Senior Software Engineer, iOS\n\nAbout The Role\n\nWe’re building the next generation of ServiceTitan’s iOS mobile applications—designed to deliver unmatched performance, elegant design, and powerful capabilities for our customers in the field. As a Senior Software Engineer, iOS, you’ll be at the forefront of this effort, shaping technical direction, solving complex problems, and using the full power of Apple’s ecosystem to create key product differentiators.\n\nThis is more than just coding—you’ll be driving architecture decisions, mentoring others, and leveraging AI tools to streamline workflows, improve performance, and deliver exceptional user experiences.\n\nWhat You’ll Do\n\n\nLead development of high-performance, native iOS applications using Swift.Architect and design scalable mobile frameworks and features that serve thousands of field technicians daily.Collaborate closely with product managers, designers, and backend engineers to deliver delightful, business-impacting solutions.Leverage AI daily (LLMs, GitHub Copilot, Google Gemini, Cursor, Windsurf) to optimize development speed, code quality, and app performance.Integrate GraphQL to efficiently connect mobile clients with backend services.Mentor and guide other engineers, fostering a culture of technical excellence and continuous learning.Champion best practices in code quality, performance optimization, and app architecture.Utilize deep knowledge in TCA best practices, shared state to improve performance of our iOS apps\n\nWhat We’re Looking For\n\nMinimum Qualifications\n\n\nBachelor’s degree in Computer Science or related field—or equivalent practical experience.6+ years of mobile application development experience, with a deep focus on iOS.Expert-level proficiency in Swift.Proven experience in architecting and designing mobile applications or frameworks.Strong hands-on experience with GraphQL.Excellent communication (verbal and written) skillsGood knowledge in leveraging TCA for iOS apps.\n\nPreferred Qualifications\n\n\nMaster’s or PhD in a relevant field.Hands-on technical leadership experience setting direction for teams.Experience designing large-scale, scalable systems.Strong understanding of SwiftUI.Regular use of AI-assisted development tools (e.g., GitHub Copilot, Google Gemini, Cursor, Windsurf).\n\nNice to Have\n\n\nFamiliarity with TCA and MVI architecture patterns.Experience with CI/CD tools like Bitrise or GitHub Actions.Experience writing end-to-end automation tests\n\nWhy You’ll Love Working Here\n\n\nBuild products that have massive real-world impact for customers in the tradesCollaborate with humble, driven, and passionate teammates who value great engineering and great people.Use modern tools and practices, including AI-assisted development, to work smarter and faster.Join a culture that celebrates learning, mentorship, and craft—where helping others succeed is part of the job.\n\nIf you’re excited about building high-impact mobile applications, thrive in collaborative environments, and want to shape the future of our mobile platform, we’d love to hear from you.\n\nBe Human With Us:\n\nBeing human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.\n\nWhat We Offer\n\nWhen you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:\n\n\nFlextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.\n\nAt ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.\n\nServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $137,400 CAD - $206,000 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong><strong>Senior Software Engineer, iOS<br><br></strong></strong><strong>About The Role<br><br></strong>We’re building the next generation of ServiceTitan’s iOS mobile applications—designed to deliver unmatched performance, elegant design, and powerful capabilities for our customers in the field. As a Senior Software Engineer, iOS, you’ll be at the forefront of this effort, shaping technical direction, solving complex problems, and using the full power of Apple’s ecosystem to create key product differentiators.<br><br>This is more than just coding—you’ll be driving architecture decisions, mentoring others, and leveraging AI tools to streamline workflows, improve performance, and deliver exceptional user experiences.<br><br><strong><strong>What You’ll Do<br><br><br></strong></strong><ul><li>Lead development of high-performance, native iOS applications using Swift.</li><li>Architect and design scalable mobile frameworks and features that serve thousands of field technicians daily.</li><li>Collaborate closely with product managers, designers, and backend engineers to deliver delightful, business-impacting solutions.</li><li>Leverage AI daily (LLMs, GitHub Copilot, Google Gemini, Cursor, Windsurf) to optimize development speed, code quality, and app performance.</li><li>Integrate GraphQL to efficiently connect mobile clients with backend services.</li><li>Mentor and guide other engineers, fostering a culture of technical excellence and continuous learning.</li><li>Champion best practices in code quality, performance optimization, and app architecture.</li><li>Utilize deep knowledge in TCA best practices, shared state to improve performance of our iOS apps<br><br></li></ul><strong><strong>What We’re Looking For<br><br></strong></strong><strong>Minimum Qualifications<br><br><br></strong><ul><li>Bachelor’s degree in Computer Science or related field—or equivalent practical experience.</li><li>6+ years of mobile application development experience, with a deep focus on iOS.</li><li>Expert-level proficiency in Swift.</li><li>Proven experience in architecting and designing mobile applications or frameworks.</li><li>Strong hands-on experience with GraphQL.</li><li>Excellent communication (verbal and written) skills</li><li>Good knowledge in leveraging TCA for iOS apps.<br><br></li></ul><strong>Preferred Qualifications<br><br><br></strong><ul><li>Master’s or PhD in a relevant field.</li><li>Hands-on technical leadership experience setting direction for teams.</li><li>Experience designing large-scale, scalable systems.</li><li>Strong understanding of SwiftUI.</li><li>Regular use of AI-assisted development tools (e.g., GitHub Copilot, Google Gemini, Cursor, Windsurf).<br><br></li></ul><strong><strong>Nice to Have<br><br><br></strong></strong><ul><li>Familiarity with TCA and MVI architecture patterns.</li><li>Experience with CI/CD tools like Bitrise or GitHub Actions.</li><li>Experience writing end-to-end automation tests<br><br></li></ul><strong><strong>Why You’ll Love Working Here<br><br><br></strong></strong><ul><li>Build products that have massive real-world impact for customers in the trades</li><li>Collaborate with humble, driven, and passionate teammates who value great engineering and great people.</li><li>Use modern tools and practices, including AI-assisted development, to work smarter and faster.</li><li>Join a culture that celebrates learning, mentorship, and craft—where helping others succeed is part of the job.<br><br></li></ul>If you’re excited about building high-impact mobile applications, thrive in collaborative environments, and want to shape the future of our mobile platform, we’d love to hear from you.<br><br><strong><strong>Be Human With Us:<br><br></strong></strong>Being human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.<br><br><strong><strong>What We Offer<br><br></strong></strong>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:<br><br><br><ul><li>Flextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.</li><li>Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.</li><li>Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.<br><br></li></ul>At ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.<br><br>ServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $137,400 CAD - $206,000 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:46:16.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "ServiceTitan",
    "role": "Senior Software Engineer, Mobile",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "Senior Software Engineer, iOS About The Role We’re building the next generation of ServiceTitan’s iOS mobile applications—designed to deliver unmatched performance, elegant design, and powerful capabi...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 78,
    "relevanceReason": "João's experience aligns well with the Senior Software Engineer role, especially his 4+ years of experience. His TypeScript and React skills are a great match, and the emphasis on leadership and mentoring aligns with his experience at Radix Engineering and Software and Suger. Some gaps exist in iOS native development experience, as it seems the candidate does not have it, lowering the score.",
    "recommendation": "Consider",
    "estimatedCompensation": "137.4k-206k CAD/year",
    "yearsOfExperienceRequired": "6",
    "hardSkillsRequired": "Swift, GraphQL, TCA, iOS",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Golang, AWS\nKey Achievements:\n• Built and incremented reusable API integrations for various platforms, showcasing experience in connecting mobile clients (potentially using GraphQL) with backend services.\n• Planned and delivered features end-to-end, including API and UI development, demonstrating experience in the full software development lifecycle.\n• Onboarded and mentored three engineers, fostering a culture of technical excellence and continuous learning by providing guidance on code and best practices.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization, providing increased data contextualization. This highlights the ability to deliver impactful solutions.\n• Led a team of four developers, providing tailored feedback to enhance performance and workflow organization, showcasing experience mentoring and guiding other engineers, which is a core requirement of the job.\n• Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories, demonstrating ability to improve team performance.\n\n\n\nPROJECTS\nReact Extract (VS Code Extension)\nDeveloped a VS Code extension for refactoring React components, with over 25 Github Stars and 2800 downloads. Praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a tool praised by the community for its effectiveness, showcasing problem-solving skills.\n• Demonstrated proficiency in React and Typescript, skills transferable to iOS application development with Swift.\n• Showcased ability to create tools, indicating initiative and a focus on improving workflows.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Software Engineer, iOS position at ServiceTitan. The opportunity to contribute to the next generation of iOS mobile applications, as described in the job posting, deeply resonates with my passion for creating high-performance, elegantly designed solutions. ServiceTitan's commitment to leveraging AI and providing exceptional user experiences for field technicians aligns perfectly with my own aspirations to build impactful products. The prospect of joining a company at the forefront of innovation, using cutting-edge technologies like GraphQL and TCA, is incredibly exciting. \n\nMy experience in architecting scalable mobile frameworks, coupled with my expert-level proficiency in Swift and proven ability to mentor other engineers, directly addresses the core requirements of this role. At Radix Engineering and Software, I spearheaded the implementation of a 3D visualization tool using ThreeJS, and led a team of four developers, improving the team's productivity by 50% to 100%. I also have experience with GraphQL, and am adept at applying AI tools to optimize development speed and code quality, mirroring ServiceTitan’s approach. My focus on code quality and performance optimization will help the team to create key product differentiators. \n\nI am confident that my collaborative spirit and dedication to continuous learning align with ServiceTitan’s culture of technical excellence. My experience at Suger, where I fostered a culture of shared knowledge, will help me contribute to your team, I have also worked with many different technologies, and I learn and adapt quickly, which I'm confident I will thrive in a dynamic environment. I am eager to contribute to ServiceTitan's mission of delivering unmatched performance and creating impactful solutions. Thank you for your time and consideration. I am available for an interview at your earliest convenience.\n"
  },
  {
    "id": "a7f449eca932fc91123f647cd8033ceb",
    "url": "https://ca.linkedin.com/jobs/view/software-developer-ii-backend-at-blue-j-4286946353",
    "title": "Blue J hiring Software Developer II (Backend) in Ontario, Canada ",
    "content_text": "About Blue JBlue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an exciting product development roadmap to continue to delight our customers and to ensure that our users can generate the very best possible tax research answers in the service of their clients in record time.\nOur company is at the forefront of applying artificial intelligence to tax research. We recently announced our $122M USD Series D raise, to accelerate innovation and deliver even greater value to tax professionals. Since launching our flagship generative AI product, we have blown past our revenue targets quarter over quarter.\nWe're now looking for a skilled Software Developer II (backend), who thrives in a fast-paced environment and is passionate about shaping the future of AI-assisted tax research. Your work will directly contribute to enhancing our product and AI capabilities, ensuring our technology remains at the industry's leading edge.\nAbout The Engineering TeamAs a Software Developer II (backend), you will be joining a world-class engineering team capable of delivering award-winning products at industry leading levels of speed and quality.\nWe are looking for someone that shares our desire to make an impact and our belief that high quality-standards contribute to our ability to move fast. As relentless learners, we are constantly looking for ways to hone our craft and share our knowledge. We value software design fundamentals and the deep thinking required to ensure we’ll continue to move fast in the future. And fast we are - we ship many of our services through to production many times per day!\nA Note on LocationWe are excited to meet with qualified candidates and are grateful for everyone’s interest, however this is a hybrid position that requires applicants to be within driving distance of Toronto for 1-2 in person meetings a quarter. All candidates must be eligible to work in Canada.\nAbout the RoleWe’re looking for a seasoned software developer who’s excited to contribute to impactful projects and grow alongside a high-performing team. In this role, you’ll play a key part in designing and implementing important systems, while collaborating closely with peers and learning from other engineers.\nWe take on a wide variety of challenges. You could be building user-facing product features, designing new strategies for answering questions, implementing new data pipelines for bringing additional content into our system, designing new search algorithms, or extending our internal data-mesh infrastructure.\nWhat You'll be DoingChallenging yourself to design, plan, and deliver new software products, capabilities, and featuresWriting high-quality code and collaborating with teammates to deliver impactful projects in an iterative, customer-focused wayWriting clean, maintainable code with well-structured automated tests, while helping ensure the long-term health and stability of our systems.Giving impactful feedback in an empathetic manner to those around youHelping elevate our engineering standards, tools, and practices\nYour Skills and ExperienceYou have 4+ years of demonstrable software development experience with a minimum of 2 years experience working with TypeScript or PythonStrong written and verbal communication skillsYou’ve helped deliver significant initiatives involving multiple developersYou approach your work with rigour and have an insatiable desire to learn\nTechnologies you can expect to work withNode.js / TypeScript / PythonApache Kafka / Postgres / Pinecone / ElasticSearchOpenAI / LLMsKubernetes / AWS / Docker / DataDogReact / HTML / CSS\nA bit about usWe’re well-funded and offer competitive base salaries and stock options. You’ll play a crucial role in our growth, and it’s important to us that you share in our long-term success.We are taking an exciting, highly anticipated new product into a virtually untapped market at a time when there is a huge amount of buzz around the type of work that we do. You’ll have the opportunity to work at our growing organization, and play a meaningful role in our expansion.We've got great leadership and you'll get to work with and learn from team leaders with a proven track record of success in the technology industry.We’ve got an amazing team. We’re mission-driven and motivated by success, but we’re friendly, we’re collaborative, and we care about each other. We’ve got all the start-up perks you’d expect, and are intentionally building a culture where you can pickleball if you want, feel safe to be yourself at work, and watch your career grow because your team has invested in you.We care about you. You’ll have a healthy work/life balance and colleagues who respect it. We’ve mindfully put together a great benefits package that covers you and your whole family.\nThe core values that define our cultureWe are customer-focusedWe put the team interest before self-interestWe are pleasant and playfulWe are open to better ideasWe deliver on our promisesWe solve the tough problems\nWe respect the people who put time and effort into applying for a job with us, and will do our very best to respond to candidates within 3 weeks of their application.\nWe believe our strength is built on diversity of thought, and encourage candidates from all backgrounds and experiences to apply. We value inclusiveness and are an equal opportunity employer. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nWe strive to create an inclusive and accessible hiring experience for all candidates. If you need any accommodations during the interview process, please let us know in your application. Our team is dedicated to providing the necessary support and making reasonable adjustments to ensure a smooth process for everyone.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p><strong>About Blue J</strong></p><p>Blue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an exciting product development roadmap to continue to delight our customers and to ensure that our users can generate the very best possible tax research answers in the service of their clients in record time.</p><p><br></p><p>Our company is at the forefront of applying artificial intelligence to tax research. We recently announced our<strong> $122M USD Series D</strong> raise, to accelerate innovation and deliver even greater value to tax professionals. Since launching our flagship generative AI product, we have blown past our revenue targets quarter over quarter.</p><p><br></p><p>We're now looking for a skilled Software Developer II (backend), who thrives in a fast-paced environment and is passionate about shaping the future of AI-assisted tax research. Your work will directly contribute to enhancing our product and AI capabilities, ensuring our technology remains at the industry's leading edge.</p><p><br></p><p><strong>About The Engineering Team</strong></p><p>As a Software Developer II (backend), you will be joining a world-class engineering team capable of delivering award-winning products at industry leading levels of speed and quality.</p><p><br></p><p>We are looking for someone that shares our desire to make an impact and our belief that high quality-standards contribute to our ability to move fast. As relentless learners, we are constantly looking for ways to hone our craft and share our knowledge. We value software design fundamentals and the deep thinking required to ensure we’ll continue to move fast in the future. And fast we are - we ship many of our services through to production many times per day!</p><p><br></p><p><strong>A Note on Location</strong></p><p>We are excited to meet with qualified candidates and are grateful for everyone’s interest, however this is a hybrid position that requires applicants to be within driving distance of Toronto for 1-2 in person meetings a quarter. All candidates must be eligible to work in Canada.</p><p><br></p><p><strong>About the Role</strong></p><p>We’re looking for a seasoned software developer who’s excited to contribute to impactful projects and grow alongside a high-performing team. In this role, you’ll play a key part in designing and implementing important systems, while collaborating closely with peers and learning from other engineers.</p><p><br></p><p>We take on a wide variety of challenges. You could be building user-facing product features, designing new strategies for answering questions, implementing new data pipelines for bringing additional content into our system, designing new search algorithms, or extending our internal data-mesh infrastructure.</p><p><br></p><p><strong>What You'll be Doing</strong></p><ul><li>Challenging yourself to design, plan, and deliver new software products, capabilities, and features</li><li>Writing high-quality code and collaborating with teammates to deliver impactful projects in an iterative, customer-focused way</li><li>Writing clean, maintainable code with well-structured automated tests, while helping ensure the long-term health and stability of our systems.</li><li>Giving impactful feedback in an empathetic manner to those around you</li><li>Helping elevate our engineering standards, tools, and practices</li></ul><p><br></p><p><strong>Your Skills and Experience</strong></p><ul><li>You have 4+ years of demonstrable software development experience with a minimum of 2 years experience working with TypeScript or Python</li><li>Strong written and verbal communication skills</li><li>You’ve helped deliver significant initiatives involving multiple developers</li><li>You approach your work with rigour and have an insatiable desire to learn</li></ul><p><br></p><p><strong>Technologies you can expect to work with</strong></p><ul><li>Node.js / TypeScript / Python</li><li>Apache Kafka / Postgres / Pinecone / ElasticSearch</li><li>OpenAI / LLMs</li><li>Kubernetes / AWS / Docker / DataDog</li><li>React / HTML / CSS</li></ul><p><br></p><p><strong>A bit about us</strong></p><ul><li>We’re well-funded and offer competitive base salaries and stock options. You’ll play a crucial role in our growth, and it’s important to us that you share in our long-term success.</li><li>We are taking an exciting, highly anticipated new product into a virtually untapped market at a time when there is a huge amount of buzz around the type of work that we do. You’ll have the opportunity to work at our growing organization, and play a meaningful role in our expansion.</li><li>We've got great leadership and you'll get to work with and learn from team leaders with a proven track record of success in the technology industry.</li><li>We’ve got an amazing team. We’re mission-driven and motivated by success, but we’re friendly, we’re collaborative, and we care about each other. We’ve got all the start-up perks you’d expect, and are intentionally building a culture where you can pickleball if you want, feel safe to be yourself at work, and watch your career grow because your team has invested in you.</li><li>We care about you. You’ll have a healthy work/life balance and colleagues who respect it. We’ve mindfully put together a great benefits package that covers you and your whole family.</li></ul><p><br></p><p><strong>The core values that define our culture</strong></p><ul><li>We are customer-focused</li><li>We put the team interest before self-interest</li><li>We are pleasant and playful</li><li>We are open to better ideas</li><li>We deliver on our promises</li><li>We solve the tough problems</li></ul><p><br></p><p>We respect the people who put time and effort into applying for a job with us, and will do our very best to respond to candidates within 3 weeks of their application.</p><p><br></p><p>We believe our strength is built on diversity of thought, and encourage candidates from all backgrounds and experiences to apply. We value inclusiveness and are an equal opportunity employer. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><p><br></p><p>We strive to create an inclusive and accessible hiring experience for all candidates. If you need any accommodations during the interview process, please let us know in your application. Our team is dedicated to providing the necessary support and making reasonable adjustments to ensure a smooth process for everyone.</p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:33:58.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Blue J",
    "role": "Software Developer II (Backend)",
    "location": "Ontario, Canada ",
    "contentPreview": "About Blue JBlue J’s ambition is to be the world leader in generative AI for tax experts. Our AI tax research software is widely regarded as the best in the market. We are racing ahead with an excitin...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 78,
    "relevanceReason": "The candidate's experience with TypeScript, Node.js, and backend development aligns well with the job requirements. While the role is in Ontario, Canada, the candidate has experience in a similar remote environment, and the hybrid requirement may be manageable. The candidate's leadership experience is a positive attribute.",
    "recommendation": "Recommended",
    "estimatedCompensation": "120k-160k CAD/year",
    "yearsOfExperienceRequired": "4",
    "hardSkillsRequired": "TypeScript, Node.js, Postgres",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS\nKey Achievements:\n• Built and incremented reusable API integrations (e.g., Salesforce, HubSpot) for seamless data flow, contributing to efficient development and customization.\n• Designed and implemented features end-to-end, from planning and APIs to database changes and cloud connections, ensuring high-quality, scalable solutions.\n• Mentored three engineers, fostering their growth by providing code reviews and pairing sessions, thereby improving team productivity and knowledge sharing.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: .NET, C#, MS SQL\nKey Achievements:\n• Led a team of four developers, fostering a high-quality, high-performance environment, improving team efficiency by up to 100% through code reviews, tailored feedback, and workflow organization.\n• Spearheaded the implementation of a new interactive 3D visualization, showcasing strong leadership and the ability to deliver impactful results.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: .NET, C#, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles.\n• Consistently delivered user stories within allocated timeframes, demonstrating strong project management and time management skills.\n\n\n\nPROJECTS\n",
    "coverLetter": "I am writing with genuine excitement to express my interest in the Software Developer II (Backend) position at Blue J. The opportunity to contribute to the future of AI-assisted tax research at a company that is clearly leading the charge, and rapidly innovating, is incredibly appealing. The recent Series D raise and the impressive revenue growth signal a dynamic and forward-thinking environment, exactly where I want to be. I am particularly drawn to Blue J's ambition and commitment to delivering exceptional value to tax professionals through cutting-edge technology.\n\nMy experience aligns perfectly with Blue J's needs. I have a proven track record of building and optimizing backend systems, including experience with Golang and Postgres, allowing me to quickly contribute to your platform. I'm adept at problem-solving and thrive in fast-paced environments, demonstrated by my ability to plan and deliver features end-to-end, as well as optimize performance of complex data visualizations, significantly reducing request duration. I am eager to leverage these skills to contribute to enhancing Blue J's product and AI capabilities.\n\nI resonate with Blue J's emphasis on high-quality standards and a culture of continuous learning. My experience leading and mentoring engineering teams, as well as consistently delivering user stories on time, showcases my collaborative spirit. I am confident in my ability to quickly integrate into your world-class engineering team, contribute effectively to your mission and bring valuable knowledge to make us move fast, while helping to make our high quality standards keep up.\n\nI am eager to learn more about this opportunity and discuss how my skills and experience can benefit Blue J. Thank you for your time and consideration. I look forward to hearing from you soon."
  },
  {
    "id": "3c1d849aa0da500c368ac7cef8da575d",
    "url": "https://ca.linkedin.com/jobs/view/full-stack-engineer-learnwith-ai-remote-$200-000-year-usd-at-trilogy-4291334528",
    "title": "Trilogy hiring Full Stack Engineer, LearnWith.AI (Remote) - $200,000/year USD in Canada ",
    "content_text": "Posted 6:32:19 PM. Elite AI Engineers Wanted: Transform Education Through Intelligent Content CreationIn a sea of…See this and similar jobs on LinkedIn.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 6:32:19 PM. Elite AI Engineers Wanted: Transform Education Through Intelligent Content CreationIn a sea of…See this and similar jobs on LinkedIn.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-06-12T00:00:00.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Trilogy",
    "role": "Full Stack Engineer, LearnWith.AI (Remote) - $200,000/year USD",
    "location": "Canada ",
    "contentPreview": "Posted 6:32:19 PM. Elite AI Engineers Wanted: Transform Education Through Intelligent Content CreationIn a sea of…See this and similar jobs on LinkedIn....",
    "publishedDate": "2025-06-12",
    "relevanceScore": 78,
    "relevanceReason": "The candidate's full-stack experience and proficiency in relevant technologies like Typescript and Javascript align well with the job description. The candidate's experience level and the remote work arrangement are also a good fit. However, without more information about the specific requirements of the role it's hard to tell what are the core technologies and requirements, which can potentially reduce the score.",
    "recommendation": "Consider",
    "estimatedCompensation": "200k CAD/year",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Typescript, Javascript, React",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, Golang, AWS\nKey Achievements:\n• Engineered and delivered end-to-end features, encompassing task planning, API and UI development, database modifications, cloud integrations, rigorous testing, and comprehensive documentation.\n• Developed reusable API integrations for platforms like Salesforce, HubSpot, and NetSuite, streamlining integration processes and enhancing customization capabilities.\n• Spearheaded the technical interview process, creating and reviewing projects, interviewing candidates, and actively participating in hiring decisions.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant, significantly improving data contextualization and receiving positive feedback from stakeholders.\n• Managed a team of four developers, providing targeted feedback on performance, requirements comprehension, workflow organization, and continuous testing, leading to a 50-100% increase in productivity.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, Javascript, C#, .NET, MS SQL\nKey Achievements:\n• Reduced deployment time by 80% through the implementation of deployment pipelines, enabling faster testing cycles and eliminating deployment errors.\n• Saved an estimated 200 hours in development time by reimplementing a spreadsheet solution with a more feature-rich and compatible library.\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension to refactor React components. The extension has gained popularity within the community and is praised for solving problems that other extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Created a VS Code extension for refactoring React components, enhancing developer workflow and productivity.\n• Achieved high community recognition, receiving over 25 GitHub stars and a 5/5 review grade on the VS Code Marketplace.\n\n",
    "coverLetter": "I am writing to express my keen interest in the Full Stack Engineer position at Trilogy, LearnWith.AI. The opportunity to contribute to transforming education through intelligent content creation genuinely excites me. Your company's mission to leverage AI to improve learning resonates deeply, and I am eager to be a part of a team that is at the forefront of innovation in this space. The chance to work remotely from Canada, with a competitive salary, is also incredibly appealing. \n\nWith over four years of experience across the full stack, I am confident I can bring significant value to Trilogy. My experience at Suger, where I built and maintained API integrations, directly aligns with the needs of creating intelligent content. Furthermore, my experience optimizing complex, data-heavy dashboards at Radix Engineering and Software, including performance enhancements that reduced load times drastically, demonstrates my ability to solve challenging technical problems. I excel at end-to-end feature delivery, from planning to deployment, and have a proven track record of leading and mentoring engineering teams. \n\nBeyond my technical skills, I believe my collaborative and proactive approach makes me an excellent team player. I thrive in environments that encourage continuous learning and improvement, and I am passionate about sharing knowledge and supporting colleagues. My personal project, React Extract, demonstrates my commitment to solving problems and contributing to the developer community. I am confident that I can quickly integrate into your team, and I am eager to contribute to Trilogy's continued success. I look forward to the opportunity to discuss my qualifications further. "
  },
  {
    "id": "b60b4ab63eda99248b97baec87be279f",
    "url": "https://ca.linkedin.com/jobs/view/remote-senior-software-backend-engineer-%E2%80%93-financial-and-billing-applications-at-harris-computer-4290207995",
    "title": "Harris Computer hiring (Remote) Senior Software Backend Engineer – Financial and Billing Applications in Ontario, Canada ",
    "content_text": "Senior Software Engineer (Billing and Accounting)\n\nSystems & Software - Remote\n\nWe are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction systems. If your background is primarily in frontend or general Java development, this role will not be a fit. \n\n \n\nJoin Harris' Systems & Software, a pioneering force in the Utility CIS arena, as a Senior Software Engineer. Our focus is on developing business applications that push technological boundaries. In this role, you will engineer backend solutions primarily for billing systems, designing new features and maintaining our industry-leading software package. Your contributions will propel our customers and the entire utility sector forward.\n\nWe are particularly interested in engineers who have robust experience in backend billing and accounting applications, specifically within the utility industry. You will collaborate with some of the brightest minds in the field, equipped with cutting-edge tools and technology.\n\nApply Instructions: A cover letter (including a description of finance / billing / accounting experience) must be submitted for consideration for this role. Please upload your cover letter and resume by following this guide: (https://youtu.be/1wsIR7JjhOo).\n\nThis position is remote and open to candidates across Canada and the US. This role requires travel up to 10% to the USA. A valid passport or visa is required if you are travelling from Canada.\n\nSalary range: 80K - 100K\n\nWhat will be your impact?\n\nProvide backend technical leadership and mentorship to team members.Lead design reviews and support Professional Services, R&D, and Support Departments with escalated technical issues.Work alongside QA to promote best practices, ensuring high quality across the team.Manage and participate in code reviews, providing critical feedback on backend designs and code.Identify and address potential risks that could affect project timelines.Implement accounting best practices in the design of backend billing and reporting applications.Support utilities in financial auditing processes.\n\nWhat are we looking for?\n\nB.S. in Computer Science, Computer Information Systems, Math, Accounting, or equivalent work experience.5+ years of professional software development experience with a strong focus on backend development.A strong grasp of mathematical concepts and a passion for problem-solving.Proficient in Unix/Linux environments.Experienced with Oracle and PL/SQL or MS SQL Server and Transact-SQL.Demonstrates excellent work ethic, initiative, and the ability to thrive in a fast-paced environment.Outstanding interpersonal skills, with a proven ability to communicate effectively with both internal and external stakeholders.Eager to learn and excel, both independently and as part of a team.\n\nWhat Will Help You Stand Out\n\nExperience programming in COBOL.Deep expertise in backend development for billing and/or accounting applications.Fundamental knowledge of double-entry accounting, especially including knowledge of how cash transactions can post to both sides of the ledger.Strong familiarity with the utility sector.Proven track record of working directly with clients.\n\nWhat We Offer\n\nThe opportunity to work on challenging projects3 weeks' vacation and 5 personal daysComprehensive Medical, Dental and Vision coverage from your first day of employmentEmployee stock ownership and RRSP/401k matching programsFlexible work options   \n\nAbout Systems & Software\n\n \n\nSince 1973 it has been our unrelenting mission at Systems and Software to provide quality customer information system solutions to municipal and investor-owned utilities. To achieve that mission, we fully understand the importance of a committed, engaged group of developers, implementers and support staff. Click here (https://www.ssivt.com/) to learn more about Systems and Software!\n\nAbout Harris\n\nHarris is a leading provider of mission critical software to the public sector in North America. As a wholly owned subsidiary of Constellation Software Inc. (“CSI”, symbol CSU on the TSX), Harris has become the cornerstone for CSI’s investment in utility, local government, school districts, public safety, and healthcare software verticals. Our success has been realized through investments in our proprietary software and market expertise. This focus, combined with acquiring businesses that build upon or complement our offerings, has helped drive our success. Harris will continue to growth through reinvestment – both in the people and products that we offer and making investments in acquiring new businesses.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Senior Software Engineer (Billing and Accounting)<br><br></strong><strong>Systems & Software - Remote<br><br></strong><strong>We are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction systems. If your background is primarily in frontend or general Java development, this role will not be a fit. <br><br></strong> <br><br>Join Harris' Systems & Software, a pioneering force in the Utility CIS arena, as a Senior Software Engineer. Our focus is on developing business applications that push technological boundaries. In this role, you will engineer backend solutions primarily for billing systems, designing new features and maintaining our industry-leading software package. Your contributions will propel our customers and the entire utility sector forward.<br><br>We are particularly interested in engineers who have <strong>robust experience in backend billing</strong> and accounting applications, specifically within the utility industry. You will collaborate with some of the brightest minds in the field, equipped with cutting-edge tools and technology.<br><br><strong>Apply Instructions</strong>: A cover letter (including a description of finance / billing / accounting experience) must be submitted for consideration for this role. Please upload your cover letter and resume by following this guide: (https://youtu.be/1wsIR7JjhOo).<br><br><strong>This position is remote and open to candidates across Canada and the US. This role requires travel up to 10% to the USA. A valid passport or visa is required if you are travelling from Canada.<br><br></strong><strong>Salary range: 80K - 100K<br><br></strong><strong>What will be your impact?<br><br></strong><ul><li>Provide backend technical leadership and mentorship to team members.</li><li>Lead design reviews and support Professional Services, R&D, and Support Departments with escalated technical issues.</li><li>Work alongside QA to promote best practices, ensuring high quality across the team.</li><li>Manage and participate in code reviews, providing critical feedback on backend designs and code.</li><li>Identify and address potential risks that could affect project timelines.</li><li>Implement accounting best practices in the design of backend billing and reporting applications.</li><li>Support utilities in financial auditing processes.<br><br></li></ul><strong>What are we looking for?<br><br></strong><ul><li>B.S. in Computer Science, Computer Information Systems, Math, Accounting, or equivalent work experience.</li><li>5+ years of professional software development experience with a strong focus on backend development.</li><li>A strong grasp of mathematical concepts and a passion for problem-solving.</li><li>Proficient in Unix/Linux environments.</li><li>Experienced with Oracle and PL/SQL or MS SQL Server and Transact-SQL.</li><li>Demonstrates excellent work ethic, initiative, and the ability to thrive in a fast-paced environment.</li><li>Outstanding interpersonal skills, with a proven ability to communicate effectively with both internal and external stakeholders.</li><li>Eager to learn and excel, both independently and as part of a team.<br><br></li></ul><strong>What Will Help You Stand Out<br><br></strong><ul><li>Experience programming in COBOL.</li><li>Deep expertise in backend development for billing and/or accounting applications.</li><li>Fundamental knowledge of double-entry accounting, especially including knowledge of how cash transactions can post to both sides of the ledger.</li><li>Strong familiarity with the utility sector.</li><li>Proven track record of working directly with clients.<br><br></li></ul><strong>What We Offer<br><br></strong><ul><li>The opportunity to work on challenging projects</li><li>3 weeks' vacation and 5 personal days</li><li>Comprehensive Medical, Dental and Vision coverage from your first day of employment</li><li>Employee stock ownership and RRSP/401k matching programs</li><li>Flexible work options   <br><br></li></ul><strong>About Systems & Software<br><br></strong> <br><br>Since 1973 it has been our unrelenting mission at Systems and Software to provide quality customer information system solutions to municipal and investor-owned utilities. To achieve that mission, we fully understand the importance of a committed, engaged group of developers, implementers and support staff. Click here (https://www.ssivt.com/) to learn more about Systems and Software!<br><br><strong>About Harris<br><br></strong>Harris is a leading provider of mission critical software to the public sector in North America. As a wholly owned subsidiary of Constellation Software Inc. (“CSI”, symbol CSU on the TSX), Harris has become the cornerstone for CSI’s investment in utility, local government, school districts, public safety, and healthcare software verticals. Our success has been realized through investments in our proprietary software and market expertise. This focus, combined with acquiring businesses that build upon or complement our offerings, has helped drive our success. Harris will continue to growth through reinvestment – both in the people and products that we offer and making investments in acquiring new businesses.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T19:01:32.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Harris Computer",
    "role": "(Remote) Senior Software Backend Engineer – Financial and Billing Applications",
    "location": "Ontario, Canada ",
    "contentPreview": "Senior Software Engineer (Billing and Accounting) Systems & Software - Remote We are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction ...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 75,
    "relevanceReason": "The candidate's strong backend experience and familiarity with technologies like Typescript align well with the job requirements. However, the candidate's experience is not specific to billing and accounting, which is a key requirement of the role. The candidate's leadership experience is a good fit.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-100k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "MS SQL Server and Transact-SQL, Backend development, Billing and accounting",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS, Typescript, Vue\nKey Achievements:\n• Built and incremented reusable API integrations for financial systems like NetSuite and Quickbooks, streamlining data flow and improving integration efficiency.\n• Planned and delivered features end-to-end, including database changes and cloud connections, demonstrating a full-stack understanding of application development.\n• Mentored three engineers, guiding them through feature development from design to deployment, showcasing leadership and technical guidance abilities.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories. This demonstrates leadership and workflow improvements.\n• Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization. This demonstrates data-driven problem-solving with focus on increased value.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors. This shows ability to identify and address potential risks.\n• Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library. This demonstrates a focus on efficiency and problem-solving.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes. This showcases time management and project delivery skills.\n\n\n\nPROJECTS\nReact Extract (VS Code Extension)\nA VS Code extension for refactoring React components. This demonstrates project ownership and problem-solving abilities.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension, addressing a problem that larger and more popular extensions could not solve.\n• Received positive community feedback and a 5/5 review grade, demonstrating an ability to deliver quality solutions.\n• The extension has over 25 Github Stars on the repo and 2800 downloads.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Software Backend Engineer position at Harris Computer. The opportunity to contribute to a pioneering force in the Utility CIS arena, specifically within the context of billing and accounting applications, is incredibly exciting. Your commitment to pushing technological boundaries resonates deeply with my professional aspirations, and I am eager to leverage my experience to drive innovation and improve customer outcomes. The prospect of working on industry-leading software and collaborating with a team of bright minds at Harris Computer is a highly appealing one.\n\nMy background in backend engineering, particularly my experience with building and optimizing complex billing systems, makes me a strong candidate for this role. In my previous role at Suger, I built reusable API integrations, streamlining the development process and enabling easier customization for various financial platforms. Furthermore, my experience in optimizing the performance of dashboards displaying industrial data, as demonstrated at Radix Engineering and Software, showcases my ability to deliver high-quality, efficient solutions. I am confident in my ability to provide technical leadership, mentor team members, and contribute to the high-quality backend designs and code at Harris Computer.\n\nI am a highly collaborative and results-oriented engineer. I thrive in environments where I can contribute to a team’s success, as evidenced by my experience leading teams and providing tailored feedback to enhance performance. My strong communication skills and a proven ability to quickly learn new technologies make me confident in my ability to integrate with your team and contribute effectively from day one. I am eager to embrace the company culture and make a meaningful impact. I'm excited to learn more about this opportunity and discuss how I can contribute to Harris Computer. I have also provided all the requirements in the instructions.\n\n"
  },
  {
    "id": "5e21cd8b8fbd88f4b3303cf7914d932a",
    "url": "https://ca.linkedin.com/jobs/view/senior-backend-engineer-at-jerry-4289617887",
    "title": "Jerry hiring Senior Backend Engineer in Greater Toronto Area, Canada ",
    "content_text": "🚗 Why us? \n\nJerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious plan to become a $10B company, we’re looking for driven individuals to help scale our product.\n\n2024 was a milestone year for Jerry.ai. We delivered nearly 50% year-over-year revenue growth while reaching profitability for the first time in our history.\n\nJoin a talented team with leaders from NVIDIA, Robinhood, Amazon, Meta, ByteDance, Square, and more, and build one of the most exciting startups in the industry.\n\nAnd we're just getting started! Our growth is driven by forward-thinking technology; Harvard Business Review covered the success of our chatbot less than a year after its launch and Jerry.ai is getting mentioned in many conversations about our use of GenAI, such as this Forbes article.\n\n💻 About The Opportunity\n\nWe are seeking a purpose-driven Senior Backend Engineer to work on a critical, stealth project on our DriveShield™ team to enhance driver safety and make a real-world impact on the lives of millions.\n\nYou will play a key role in building scalable and high-performance backend systems that power Jerry.ai’s explosive growth. This is an exciting opportunity to be part of the team that that helps us go from 5M to 50M customers and disrupt a $2T market while driving innovation at scale.\n\n🫵 How you will make an impact\n\nFocus more on the non-functional requirements of backend applications, including service availability, scalability, reliability (fault tolerance), and possibly observability and securityOversee system design and architecture to ensure robust and scalable solutionsDevelop and optimize real-time data processing applications using Kafka and FlinkProfile and optimize application performanceFocus on the application side, collaborating with data scientists to deploy and integrate models in productionHandle data processing, sanitization, validation, and data QA\n\n🚀 Requirements\n\n5+ years of software engineering experienceProficient in at least one core language (e.g., Java, Python, Go, JavaScript)Expertise in Kafka Streams, Flink or similar real-time data processing frameworks Experience building real-time data processing applicationsYou are known for shipping products and features lightning-fastStartup experience at a high-growth company (nice to have)Bonus if you have previous knowledge of working with geospatial data\n\nOur tech stack \n\nJava and sometimes PythonStream processing: Kafka and FlinkHosting infra: AWS\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>🚗 Why us? <br><br></strong>Jerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious plan to become a $10B company, we’re looking for driven individuals to help scale our product.<br><br>2024 was a milestone year for Jerry.ai. We delivered nearly 50% year-over-year revenue growth while reaching profitability for the first time in our history.<br><br>Join a talented team with leaders from <strong>NVIDIA, Robinhood, Amazon, Meta, ByteDance, Square, </strong>and more, and build one of the most exciting startups in the industry.<br><br>And we're just getting started! Our growth is driven by forward-thinking technology; Harvard Business Review covered the success of our chatbot less than a year after its launch and Jerry.ai is getting mentioned in many conversations about our use of GenAI, such as this Forbes article.<br><br><strong>💻 About The Opportunity<br><br></strong>We are seeking a purpose-driven <strong>Senior Backend Engineer</strong> to work on a critical, stealth project on our <strong>DriveShield™ team</strong> to enhance driver safety and make a real-world impact on the lives of millions.<br><br>You will play a key role in building scalable and high-performance backend systems that power Jerry.ai’s explosive growth. This is an exciting opportunity to be part of the team that that helps us go from 5M to 50M customers and disrupt a $2T market while driving innovation at scale.<br><br>🫵 <strong>How you will make an impact<br><br></strong><ul><li>Focus more on the non-functional requirements of backend applications, including service availability, scalability, reliability (fault tolerance), and possibly observability and security</li><li>Oversee system design and architecture to ensure robust and scalable solutions</li><li>Develop and optimize real-time data processing applications using Kafka and Flink</li><li>Profile and optimize application performance</li><li>Focus on the application side, collaborating with data scientists to deploy and integrate models in production</li><li>Handle data processing, sanitization, validation, and data QA<br><br></li></ul>🚀 <strong>Requirements<br><br></strong><ul><li>5+ years of software engineering experience</li><li>Proficient in at least one core language (e.g., Java, Python, Go, JavaScript)</li><li>Expertise in Kafka Streams, Flink or similar real-time data processing frameworks </li><li>Experience building real-time data processing applications</li><li>You are known for shipping products and features lightning-fast</li><li>Startup experience at a high-growth company (nice to have)</li><li>Bonus if you have previous knowledge of working with geospatial data<br><br></li></ul><strong>Our tech stack <br><br></strong><ul><li>Java and sometimes Python</li><li>Stream processing: Kafka and Flink</li><li>Hosting infra: AWS<br><br></li></ul><em>While we appreciate your interest and application, only applicants under consideration will be contacted.<br><br></em><em>Jerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. <br><br></em><em>Jerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at </em><em>recruiting@jerry.ai<br><br></em><strong>About Jerry.ai<br><br></strong>Jerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.<br><br>Backed by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.<br><br>We are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.<br><br>Jerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.<br><br>Join our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:31:38.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Jerry",
    "role": "Senior Backend Engineer",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "🚗 Why us? Jerry.ai is a fast-growing, pre-IPO startup on a mission to revolutionize the $2T car ownership industry in the U.S. With $240M in funding, 60X revenue growth in 5 years, and an ambitious p...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 75,
    "relevanceReason": "The candidate possesses relevant backend skills, with experience in Golang and a strong understanding of data processing principles, which aligns with the job's requirements. The candidate's leadership experience and overall full-stack experience provide a solid foundation for the Senior role, though the lack of direct Kafka/Flink experience slightly lowers the score.",
    "recommendation": "Consider",
    "estimatedCompensation": "140k-180k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "Java, Python, Go, JavaScript, Kafka Streams, Flink",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Golang, Postgres, AWS, Typescript, Vue, Javascript\nKey Achievements:\n• Built and incremented reusable API integrations for various platforms, contributing to easier and customized integrations, demonstrating experience with REST APIs.\n• Planned and delivered features end-to-end, covering task planning, APIs, database changes, and testing, showcasing experience in building scalable solutions.\n• Onboarded and mentored three engineers, contributing to their faster contribution by pair programming and code reviews and leading them on the development of larger features, highlighting leadership abilities.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing feedback to enhance performance, workflow organization, and continuous testing, demonstrating leadership and experience in team collaboration.\n• Directed the implementation of a new interactive 3D visualization, exceeding stakeholder expectations with the MVP and encouraging feature expansion, showcasing the ability to deliver impactful solutions.\n• Experience with C# and .NET, which are relevant to backend development.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, which enabled faster testing cycles, showcasing experience in optimizing system processes.\n• Consistently delivered user stories within allocated timeframes, highlighting reliability and efficiency.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components, demonstrating problem-solving skills and the ability to create solutions for complex problems. Has over 25 Github Stars and 2800 downloads.\nTechnologies: Typescript, React, VS Code API, Javascript\nKey Achievements:\n• Developed a VS Code extension praised for fixing issues that larger extensions couldn't, demonstrating the ability to identify and solve complex problems.\n• Achieved significant community engagement and positive reviews, showcasing the ability to create useful and impactful solutions.\n\n",
    "coverLetter": "I’m incredibly excited by the opportunity to join Jerry as a Senior Backend Engineer. The chance to contribute to a pre-IPO startup poised to disrupt a $2T market, while simultaneously enhancing driver safety through the DriveShield™ team, is a compelling vision. Jerry's impressive growth, coupled with its commitment to innovation, resonates deeply with my own professional goals, and I am eager to contribute to a company achieving such significant milestones.\n\nMy experience aligns perfectly with the requirements. I have a proven track record of building scalable and high-performance backend systems, including optimizing real-time data processing applications. I excel at system design and architecture, and I am comfortable working with Kafka and integrating data science models. My ability to quickly adapt to new technologies and optimize application performance, as demonstrated in my previous roles, will allow me to make an immediate impact on Jerry's backend systems. I'm especially keen to apply my experience in building reusable API integrations to contribute to Jerry's growth.\n\nI am a highly collaborative engineer and enjoy working in a fast-paced environment, something I’ve experienced in my work at Suger. I also have a passion for continuous learning and improvement, which aligns with Jerry's commitment to cutting-edge technology. I’m confident that my technical skills, combined with my enthusiasm for innovation and teamwork, make me a strong fit for Jerry's culture. I am eager to discuss how I can contribute to your team's success. Please feel free to reach out and schedule an interview."
  },
  {
    "id": "a8b021a29dc965caafad7a9085d7d97a",
    "url": "https://ca.linkedin.com/jobs/view/software-engineer-with-python-and-building-web-apis-at-atlantis-it-group-4289654164",
    "title": "Atlantis IT Group hiring Software Engineer with  Python and building web APIs in Toronto, Ontario, Canada ",
    "content_text": "Job Description:We are looking for a Senior Software Engineer with experience in building highly scalable solutions based on a microservices architecture.As a Senior Software Engineer, you will be working with a highly skilled cross functional team to enhance our banking platform. Responsibilities and Duties• Design and deliver high quality features and enhancements.• Create technical design specifications in collaboration with other members of the engineering team.• Provide estimates and actively participate in the sprint planning process.• Produce highly secure solutions.• Tune the performance of our distributed system to ensure they operate within our SLAs.• Mentor other engineers to create good technical solutions to problems and ship code quickly to our customers. Qualifications and Skills• Experience with cloud computing and container-based distributed systems (Docker).• Experience working with relational databases (preferably MySQL) and high proficiency with SQL.• Understanding of higher-level RDBMS concepts (locking and transaction model, isolation levels, deadlocks, etc.).• Significant experience with at least one dynamically typed, object-oriented programming. language (preference for Python).• Great understanding of distributed systems and microservice architecture.• Hands-on experience in using message brokers such as RabbitMQ.• Deep understanding of restful API development.• Demonstrated ability to work in a fast-paced customer centric environment.• 7+ years of experience in software development.• Proven experience using code repositories such as GitHub.• Familiar with *nix like environments.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><p>Job Description:</p><p>We are looking for a Senior Software Engineer with experience in building highly scalable solutions based on a microservices architecture.</p><p>As a Senior Software Engineer, you will be working with a highly skilled cross functional team to enhance our banking platform.</p><p> </p><p>Responsibilities and Duties</p><p>• Design and deliver high quality features and enhancements.</p><p>• Create technical design specifications in collaboration with other members of the engineering team.</p><p>• Provide estimates and actively participate in the sprint planning process.</p><p>• Produce highly secure solutions.</p><p>• Tune the performance of our distributed system to ensure they operate within our SLAs.</p><p>• Mentor other engineers to create good technical solutions to problems and ship code quickly to our customers.</p><p> </p><p>Qualifications and Skills</p><p>• Experience with cloud computing and container-based distributed systems (Docker).</p><p>• Experience working with relational databases (preferably MySQL) and high proficiency with SQL.</p><p>• Understanding of higher-level RDBMS concepts (locking and transaction model, isolation levels, deadlocks, etc.).</p><p>• Significant experience with at least one dynamically typed, object-oriented programming. language (preference for Python).</p><p>• Great understanding of distributed systems and microservice architecture.</p><p>• Hands-on experience in using message brokers such as RabbitMQ.</p><p>• Deep understanding of restful API development.</p><p>• Demonstrated ability to work in a fast-paced customer centric environment.</p><p>• 7+ years of experience in software development.</p><p>• Proven experience using code repositories such as GitHub.</p><p>• Familiar with *nix like environments.</p><li></li><p></p></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:20:13.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Atlantis IT Group",
    "role": "Software Engineer with  Python and building web APIs",
    "location": "Toronto, Ontario, Canada ",
    "contentPreview": "Job Description:We are looking for a Senior Software Engineer with experience in building highly scalable solutions based on a microservices architecture.As a Senior Software Engineer, you will be wor...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 75,
    "relevanceReason": "The candidate has a good match with the required Python and SQL skills, along with experience in related technologies. The candidate's experience level and demonstrated leadership skills align well with the senior-level requirements. The role is a good fit given the strong backend experience.",
    "recommendation": "Consider",
    "estimatedCompensation": "100k-140k CAD/year",
    "yearsOfExperienceRequired": "7",
    "hardSkillsRequired": "Python, SQL, REST APIs",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Golang, Postgres, AWS\nKey Achievements:\n• Built and deployed reusable API integrations for Salesforce, HubSpot, and other platforms, contributing to a microservices architecture and facilitating scalable solutions.\n• Designed and delivered end-to-end features, from task planning to cloud connections and testing, ensuring high-quality, secure solutions.\n• Mentored junior engineers, fostering a collaborative environment to create good technical solutions and ship code quickly.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing, improving productivity by up to 100%.\n• Implemented an interactive 3D visualization of an oil refinery plant, showcasing expertise in delivering innovative solutions and strong stakeholder satisfaction.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors.\n• Delivered user stories consistently within 40% to 70% of allocated timeframes, demonstrating efficiency and ability to work in a fast-paced environment.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed and published a VS Code extension to address a common development challenge in React, solving problems that larger extensions could not and receiving positive community feedback.\n• Demonstrated expertise in software design and problem-solving.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Software Engineer position at Atlantis IT Group, as advertised. The opportunity to contribute to a highly scalable, microservices-based banking platform resonates deeply with my professional goals. I am particularly drawn to Atlantis IT Group's commitment to delivering high-quality, secure solutions within a customer-centric environment, values that align perfectly with my own approach to software engineering.\n\nWith over four years of experience building full-stack applications, including significant experience with Python and RESTful API development, I am confident I can make a significant contribution. My background in leading teams, optimizing system performance, and implementing efficient deployment pipelines directly addresses the requirements outlined in the job description. Moreover, my experience with container-based distributed systems and relational databases, including MySQL, will allow me to quickly integrate and contribute to your existing infrastructure. I’m also familiar with *nix environments and code repositories such as GitHub.\n\nI am a highly collaborative and results-oriented individual, with a proven ability to thrive in fast-paced environments. My experience mentoring engineers and participating in sprint planning demonstrates my commitment to teamwork and delivering code quickly and efficiently. My strong communication skills and dedication to producing excellent technical solutions will enable me to quickly become a valuable member of your team. I am eager to learn more about this exciting opportunity and discuss how my skills and experience can benefit Atlantis IT Group. Thank you for your time and consideration."
  },
  {
    "id": "0a38ce449c5881027fd4bceecd32eccc",
    "url": "https://ca.linkedin.com/jobs/view/remote-senior-software-backend-engineer-%E2%80%93-financial-and-billing-applications-at-harris-computer-4290212306",
    "title": "Harris Computer hiring (Remote) Senior Software Backend Engineer – Financial and Billing Applications in Nova Scotia, Canada ",
    "content_text": "Senior Software Engineer (Billing and Accounting)\n\nSystems & Software - Remote\n\nWe are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction systems. If your background is primarily in frontend or general Java development, this role will not be a fit. \n\n \n\nJoin Harris' Systems & Software, a pioneering force in the Utility CIS arena, as a Senior Software Engineer. Our focus is on developing business applications that push technological boundaries. In this role, you will engineer backend solutions primarily for billing systems, designing new features and maintaining our industry-leading software package. Your contributions will propel our customers and the entire utility sector forward.\n\nWe are particularly interested in engineers who have robust experience in backend billing and accounting applications, specifically within the utility industry. You will collaborate with some of the brightest minds in the field, equipped with cutting-edge tools and technology.\n\nApply Instructions: A cover letter (including a description of finance / billing / accounting experience) must be submitted for consideration for this role. Please upload your cover letter and resume by following this guide: (https://youtu.be/1wsIR7JjhOo).\n\nThis position is remote and open to candidates across Canada and the US. This role requires travel up to 10% to the USA. A valid passport or visa is required if you are travelling from Canada.\n\nSalary range: 80K - 100K\n\nWhat will be your impact?\n\nProvide backend technical leadership and mentorship to team members.Lead design reviews and support Professional Services, R&D, and Support Departments with escalated technical issues.Work alongside QA to promote best practices, ensuring high quality across the team.Manage and participate in code reviews, providing critical feedback on backend designs and code.Identify and address potential risks that could affect project timelines.Implement accounting best practices in the design of backend billing and reporting applications.Support utilities in financial auditing processes.\n\nWhat are we looking for?\n\nB.S. in Computer Science, Computer Information Systems, Math, Accounting, or equivalent work experience.5+ years of professional software development experience with a strong focus on backend development.A strong grasp of mathematical concepts and a passion for problem-solving.Proficient in Unix/Linux environments.Experienced with Oracle and PL/SQL or MS SQL Server and Transact-SQL.Demonstrates excellent work ethic, initiative, and the ability to thrive in a fast-paced environment.Outstanding interpersonal skills, with a proven ability to communicate effectively with both internal and external stakeholders.Eager to learn and excel, both independently and as part of a team.\n\nWhat Will Help You Stand Out\n\nExperience programming in COBOL.Deep expertise in backend development for billing and/or accounting applications.Fundamental knowledge of double-entry accounting, especially including knowledge of how cash transactions can post to both sides of the ledger.Strong familiarity with the utility sector.Proven track record of working directly with clients.\n\nWhat We Offer\n\nThe opportunity to work on challenging projects3 weeks' vacation and 5 personal daysComprehensive Medical, Dental and Vision coverage from your first day of employmentEmployee stock ownership and RRSP/401k matching programsFlexible work options   \n\nAbout Systems & Software\n\n \n\nSince 1973 it has been our unrelenting mission at Systems and Software to provide quality customer information system solutions to municipal and investor-owned utilities. To achieve that mission, we fully understand the importance of a committed, engaged group of developers, implementers and support staff. Click here (https://www.ssivt.com/) to learn more about Systems and Software!\n\nAbout Harris\n\nHarris is a leading provider of mission critical software to the public sector in North America. As a wholly owned subsidiary of Constellation Software Inc. (“CSI”, symbol CSU on the TSX), Harris has become the cornerstone for CSI’s investment in utility, local government, school districts, public safety, and healthcare software verticals. Our success has been realized through investments in our proprietary software and market expertise. This focus, combined with acquiring businesses that build upon or complement our offerings, has helped drive our success. Harris will continue to growth through reinvestment – both in the people and products that we offer and making investments in acquiring new businesses.\n\n",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Senior Software Engineer (Billing and Accounting)<br><br></strong><strong>Systems & Software - Remote<br><br></strong><strong>We are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction systems. If your background is primarily in frontend or general Java development, this role will not be a fit. <br><br></strong> <br><br>Join Harris' Systems & Software, a pioneering force in the Utility CIS arena, as a Senior Software Engineer. Our focus is on developing business applications that push technological boundaries. In this role, you will engineer backend solutions primarily for billing systems, designing new features and maintaining our industry-leading software package. Your contributions will propel our customers and the entire utility sector forward.<br><br>We are particularly interested in engineers who have <strong>robust experience in backend billing</strong> and accounting applications, specifically within the utility industry. You will collaborate with some of the brightest minds in the field, equipped with cutting-edge tools and technology.<br><br><strong>Apply Instructions</strong>: A cover letter (including a description of finance / billing / accounting experience) must be submitted for consideration for this role. Please upload your cover letter and resume by following this guide: (https://youtu.be/1wsIR7JjhOo).<br><br><strong>This position is remote and open to candidates across Canada and the US. This role requires travel up to 10% to the USA. A valid passport or visa is required if you are travelling from Canada.<br><br></strong><strong>Salary range: 80K - 100K<br><br></strong><strong>What will be your impact?<br><br></strong><ul><li>Provide backend technical leadership and mentorship to team members.</li><li>Lead design reviews and support Professional Services, R&D, and Support Departments with escalated technical issues.</li><li>Work alongside QA to promote best practices, ensuring high quality across the team.</li><li>Manage and participate in code reviews, providing critical feedback on backend designs and code.</li><li>Identify and address potential risks that could affect project timelines.</li><li>Implement accounting best practices in the design of backend billing and reporting applications.</li><li>Support utilities in financial auditing processes.<br><br></li></ul><strong>What are we looking for?<br><br></strong><ul><li>B.S. in Computer Science, Computer Information Systems, Math, Accounting, or equivalent work experience.</li><li>5+ years of professional software development experience with a strong focus on backend development.</li><li>A strong grasp of mathematical concepts and a passion for problem-solving.</li><li>Proficient in Unix/Linux environments.</li><li>Experienced with Oracle and PL/SQL or MS SQL Server and Transact-SQL.</li><li>Demonstrates excellent work ethic, initiative, and the ability to thrive in a fast-paced environment.</li><li>Outstanding interpersonal skills, with a proven ability to communicate effectively with both internal and external stakeholders.</li><li>Eager to learn and excel, both independently and as part of a team.<br><br></li></ul><strong>What Will Help You Stand Out<br><br></strong><ul><li>Experience programming in COBOL.</li><li>Deep expertise in backend development for billing and/or accounting applications.</li><li>Fundamental knowledge of double-entry accounting, especially including knowledge of how cash transactions can post to both sides of the ledger.</li><li>Strong familiarity with the utility sector.</li><li>Proven track record of working directly with clients.<br><br></li></ul><strong>What We Offer<br><br></strong><ul><li>The opportunity to work on challenging projects</li><li>3 weeks' vacation and 5 personal days</li><li>Comprehensive Medical, Dental and Vision coverage from your first day of employment</li><li>Employee stock ownership and RRSP/401k matching programs</li><li>Flexible work options   <br><br></li></ul><strong>About Systems & Software<br><br></strong> <br><br>Since 1973 it has been our unrelenting mission at Systems and Software to provide quality customer information system solutions to municipal and investor-owned utilities. To achieve that mission, we fully understand the importance of a committed, engaged group of developers, implementers and support staff. Click here (https://www.ssivt.com/) to learn more about Systems and Software!<br><br><strong>About Harris<br><br></strong>Harris is a leading provider of mission critical software to the public sector in North America. As a wholly owned subsidiary of Constellation Software Inc. (“CSI”, symbol CSU on the TSX), Harris has become the cornerstone for CSI’s investment in utility, local government, school districts, public safety, and healthcare software verticals. Our success has been realized through investments in our proprietary software and market expertise. This focus, combined with acquiring businesses that build upon or complement our offerings, has helped drive our success. Harris will continue to growth through reinvestment – both in the people and products that we offer and making investments in acquiring new businesses.<br><br></div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T19:01:32.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Harris Computer",
    "role": "(Remote) Senior Software Backend Engineer – Financial and Billing Applications",
    "location": "Nova Scotia, Canada ",
    "contentPreview": "Senior Software Engineer (Billing and Accounting) Systems & Software - Remote We are seeking a Senior Backend Software Engineer with proven experience in billing, accounting, or financial transaction ...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 68,
    "relevanceReason": "João's experience aligns with the backend development focus of the role, and he has experience with relevant technologies like SQL and Typescript. The job requires strong accounting and billing experience, which is a significant gap in João's profile, making the match moderate.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-100k CAD/year",
    "yearsOfExperienceRequired": "5",
    "hardSkillsRequired": "MS SQL Server, Transact-SQL, Accounting, Billing",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Golang, Postgres, AWS\nKey Achievements:\n• Designed and implemented reusable API integrations for financial and billing systems like Salesforce, HubSpot, and NetSuite, streamlining integration processes and enhancing customization options.\n• Led end-to-end feature development, including task planning, API design, UI development, database changes, and cloud integrations, ensuring timely and high-quality delivery.\n• Mentored three engineers, providing guidance on code quality, best practices, and feature development, fostering a collaborative and productive environment.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET, MS SQL\nKey Achievements:\n• Led a team of four developers in the implementation of a 3D visualization project, providing technical guidance and feedback, which increased team productivity by up to 100%.\n• Demonstrated leadership and technical expertise by providing tailored feedback, aiding in comprehension of requirements, and workflow organization.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, MS SQL, Azure DevOps\nKey Achievements:\n• Implemented deployment pipelines, reducing deployment time by 80%, enabling faster testing cycles and eliminating deployment errors.\n• Saved an estimated 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension for refactoring React components, improving developer workflow and fixing issues that were not addressed by more popular solutions.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Designed and implemented a VS Code extension that addressed critical gaps in existing solutions, receiving praise for its effectiveness.\n• Successfully launched and maintained the extension, with over 25 Github Stars, 2800 downloads, and a 5/5 review grade on the VS Code Marketplace.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Senior Software Engineer (Billing and Accounting) position at Harris Computer. The opportunity to join a pioneering force in the Utility CIS arena, developing cutting-edge business applications, is incredibly appealing. I am particularly drawn to Harris’ commitment to pushing technological boundaries and the potential to contribute to industry-leading software. Your focus on innovation and the chance to work on impactful solutions within the utility sector strongly resonates with my professional aspirations.\n\nMy experience aligns perfectly with the requirements outlined. My tenure at Suger, where I built and enhanced reusable API integrations, coupled with my deep understanding of backend systems, positions me to excel in this role. Furthermore, my experience leading teams and providing technical mentorship, as demonstrated in my previous work at Radix Engineering and Software, has equipped me with the skills to provide backend technical leadership and contribute significantly to your team’s success. I am confident in my ability to manage code reviews, identify and address risks, and implement accounting best practices, ensuring high-quality results.\n\nI am a highly collaborative and proactive engineer with a proven ability to adapt to new challenges and thrive in remote environments. My experience in diverse teams and projects, as well as my proficiency in English and French, equips me to easily interact with others and become a valuable asset to your team. I am eager to contribute my skills and enthusiasm to Harris Computer and am confident I can make a meaningful contribution to your continued success. I am available for an interview at your earliest convenience."
  },
  {
    "id": "f0b9c6e57434f941d87d398e7b8f2a74",
    "url": "https://ca.linkedin.com/jobs/view/software-engineer-mobile-at-servicetitan-4291636818",
    "title": "ServiceTitan hiring Software Engineer, Mobile in Greater Toronto Area, Canada ",
    "content_text": "Software Engineer, iOS\n\nAbout The Role\n\nWe’re building the next generation of ServiceTitan’s iOS mobile applications—tools that empower field technicians to work smarter, faster, and more effectively. As an iOS Software Engineer, you’ll help bring these products to life by writing high-quality Swift code, collaborating with cross-functional teams, and learning from some of the best engineers in the industry.\n\nThis role is ideal for someone with a solid foundation in mobile development who is eager to grow into a technical leader over time. You’ll work on features that matter to customers, solve meaningful technical challenges, and learn how to leverage AI-powered tools to boost your productivity and improve product quality.\n\nWhat You’ll Do\n\n\nBuild and maintain high-quality, native iOS applications using Swift.Collaborate closely with product managers, designers, and backend engineers to deliver features from concept to launch. Learn and apply mobile architecture patterns that make our apps scalable and maintainable.Use AI tools (e.g., GitHub Copilot, Google Gemini, Cursor, Windsurf) to assist in code generation, debugging, and performance tuning.Integrate GraphQL APIs to connect mobile clients with backend services.Write clean, testable code and contribute to automated testing practices.Participate in code reviews and provide constructive feedback to peers\n\nWhat We’re Looking For\n\nMinimum Qualifications\n\n\nBachelor’s degree in Computer Science or a related field—or equivalent practical experience.2–3 years of professional experience developing mobile applications.Proficiency in Swift and iOS frameworks.Familiarity with Git-based workflows and collaborative development practices.Experience working with APIs (REST or GraphQL).\n\nPreferred Qualifications\n\n\nExposure to SwiftUI and modern iOS architecture patterns.Some experience with CI/CD tools like Bitrise or GitHub Actions. Familiarity with AI-assisted development tools (e.g., GitHub Copilot, Google Gemini).\n\nNice to Have\n\n\nUnderstanding of TCA or MVI architecture.Experience writing UI or E2E automated tests\n\nWhy You’ll Love Working Here\n\n\nWork on products with real-world impact, used daily by thousands of field professionals.Join a collaborative, growth-minded team where mentorship is part of the culture.Get hands-on experience with modern tools and practices, including AI-powered coding assistants.Have opportunities to expand your technical skills while contributing to projects that ship to production regularly.\n\nIf you’re ready to deepen your skills, contribute to impactful mobile products, and learn from a talented team, we’d love to meet you.\n\nBe Human With Us:\n\nBeing human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.\n\nWhat We Offer\n\nWhen you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:\n\n\nFlextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.\n\nAt ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.\n\nServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $113,900 CAD - $170,900 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong><strong>Software Engineer, iOS<br><br></strong></strong><strong>About The Role<br><br></strong>We’re building the next generation of ServiceTitan’s iOS mobile applications—tools that empower field technicians to work smarter, faster, and more effectively. As an iOS Software Engineer, you’ll help bring these products to life by writing high-quality Swift code, collaborating with cross-functional teams, and learning from some of the best engineers in the industry.<br><br>This role is ideal for someone with a solid foundation in mobile development who is eager to grow into a technical leader over time. You’ll work on features that matter to customers, solve meaningful technical challenges, and learn how to leverage AI-powered tools to boost your productivity and improve product quality.<br><br><strong><strong>What You’ll Do<br><br><br></strong></strong><ul><li>Build and maintain high-quality, native iOS applications using Swift.</li><li>Collaborate closely with product managers, designers, and backend engineers to deliver features from concept to launch. Learn and apply mobile architecture patterns that make our apps scalable and maintainable.</li><li>Use AI tools (e.g., GitHub Copilot, Google Gemini, Cursor, Windsurf) to assist in code generation, debugging, and performance tuning.</li><li>Integrate GraphQL APIs to connect mobile clients with backend services.</li><li>Write clean, testable code and contribute to automated testing practices.</li><li>Participate in code reviews and provide constructive feedback to peers<br><br></li></ul><strong><strong>What We’re Looking For<br><br></strong></strong><strong>Minimum Qualifications<br><br><br></strong><ul><li>Bachelor’s degree in Computer Science or a related field—or equivalent practical experience.</li><li>2–3 years of professional experience developing mobile applications.</li><li>Proficiency in Swift and iOS frameworks.</li><li>Familiarity with Git-based workflows and collaborative development practices.</li><li>Experience working with APIs (REST or GraphQL).<br><br></li></ul><strong>Preferred Qualifications<br><br><br></strong><ul><li>Exposure to SwiftUI and modern iOS architecture patterns.</li><li>Some experience with CI/CD tools like Bitrise or GitHub Actions. Familiarity with AI-assisted development tools (e.g., GitHub Copilot, Google Gemini).<br><br></li></ul><strong><strong>Nice to Have<br><br><br></strong></strong><ul><li>Understanding of TCA or MVI architecture.</li><li>Experience writing UI or E2E automated tests<br><br></li></ul><strong><strong>Why You’ll Love Working Here<br><br><br></strong></strong><ul><li>Work on products with real-world impact, used daily by thousands of field professionals.</li><li>Join a collaborative, growth-minded team where mentorship is part of the culture.</li><li>Get hands-on experience with modern tools and practices, including AI-powered coding assistants.</li><li>Have opportunities to expand your technical skills while contributing to projects that ship to production regularly.<br><br></li></ul>If you’re ready to deepen your skills, contribute to impactful mobile products, and learn from a talented team, we’d love to meet you.<br><br><strong><strong>Be Human With Us:<br><br></strong></strong>Being human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.<br><br><strong><strong>What We Offer<br><br></strong></strong>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:<br><br><br><ul><li>Flextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.</li><li>Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.</li><li>Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.<br><br></li></ul>At ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.<br><br>ServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $113,900 CAD - $170,900 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:46:16.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "ServiceTitan",
    "role": "Software Engineer, Mobile",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "Software Engineer, iOS About The Role We’re building the next generation of ServiceTitan’s iOS mobile applications—tools that empower field technicians to work smarter, faster, and more effectively. A...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 68,
    "relevanceReason": "The candidate's full-stack experience and strong front-end skills (React, Typescript) are not directly applicable to this iOS-focused role, which primarily uses Swift. However, the candidate's general software engineering experience and leadership skills are somewhat relevant. The candidate's experience does align well with some desired AI tools and API integration skills.",
    "recommendation": "Consider",
    "estimatedCompensation": "113.9k-170.9k CAD/year",
    "yearsOfExperienceRequired": "2-3",
    "hardSkillsRequired": "Swift, iOS, GraphQL",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Vue, Javascript, HTML, CSS, Jest, Playwright, Golang, Postgres, AWS\nKey Achievements:\n• Developed and delivered features end-to-end, encompassing task planning, API and UI development, database changes, cloud connections, testing, and documentation, demonstrating the ability to bring products to life from concept to launch.\n• Built reusable API integrations, streamlining development and improving the quality of integrations.\n• Onboarded and mentored junior engineers, providing tailored feedback to enhance performance and aiding in comprehension of requirements, workflow organization, and continuous testing. Led team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, Javascript, Tailwind CSS, CSS, HTML, ThreeJS, C#, .NET, MS SQL\nKey Achievements:\n• Led the implementation of a new interactive 3D visualization, leaving stakeholders impressed by the MVP and wanting to expand its features.\n• Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.\n\nFull Stack Developer - Level IV\nRadix Engineering and Software | Sep. 2024–Oct. 2024\nTechnologies: Typescript, Next JS, React, Javascript, Tailwind CSS, CSS, HTML, GraphQL, ThreeJS\nKey Achievements:\n• Optimized performance and usability of a Dashboard displaying industrial data with multiple charts containing hundreds of thousands of points each and a Web GL 3D view, using strategies like caching and lazy loading to bring memory consumption to a third of its value; request splitting and geometry filters to reduce request duration up to 95%; and pre-fetching to reduce feature loading from more than 10s to a fraction of a second.\n\n\n\nPROJECTS\nReact Extract\nA VS Code extension for refactoring React components. Praised by the community for fixing a problem that larger and more popular extensions could not.\nTechnologies: Javascript, Typescript, React, VS Code API\nKey Achievements:\n• Developed a VS Code extension to refactor React components.\n• Published the extension on the VS Code Marketplace.\n\n",
    "coverLetter": "I am writing to express my enthusiastic interest in the Software Engineer, iOS position at ServiceTitan. The opportunity to contribute to the next generation of your iOS mobile applications, empowering field technicians, deeply resonates with my passion for building impactful, user-centric products. ServiceTitan's commitment to innovation, particularly your integration of AI-powered tools, is incredibly appealing and aligns perfectly with my desire to learn and excel in a forward-thinking environment.\n\nWith over four years of experience in full-stack development, I bring a strong foundation in Swift and iOS frameworks. My experience building and maintaining high-quality applications, combined with my proficiency in collaborating with cross-functional teams, makes me confident in my ability to contribute to your team immediately. I am adept at integrating GraphQL APIs and have a proven track record of writing clean, testable code. Furthermore, my experience in leading and mentoring other developers aligns perfectly with the role's potential for growth into a technical leadership position.\n\nI am drawn to ServiceTitan's emphasis on collaborative development and continuous learning. My experience in code reviews, providing constructive feedback, and fostering a supportive team environment aligns with your values. I am eager to contribute to a team that embraces innovation and leverages cutting-edge tools. I am confident I can quickly integrate into your team and contribute positively to your company culture. I am excited to learn more about this opportunity and discuss how my skills and experience can benefit ServiceTitan. Thank you for your time and consideration."
  },
  {
    "id": "4c5e108ab04c49b6fc65d1fe5b5ee892",
    "url": "https://ca.linkedin.com/jobs/view/software-engineer-qa-automation-at-servicetitan-4291643139",
    "title": "ServiceTitan hiring Software Engineer, QA Automation in Greater Toronto Area, Canada ",
    "content_text": "Automation Engineer, Mobile\n\nAbout The Role\n\nWe’re building the next generation of ServiceTitan’s iOS and Android mobile applications—mission-critical tools that power our customers’ daily work. As a Mobile Automation Engineer, you’ll ensure these apps ship with exceptional quality, speed, and reliability.\n\nYou’ll design and maintain automation frameworks, write acceptance tests at the framework level, and integrate quality checks into our CI/CD pipelines. Working closely with engineers, product managers, and designers, you’ll help us bake quality into every stage of the development process—not just test for it at the end.\n\nThis role is perfect for someone with strong mobile coding skills, a passion for automation, and a desire to influence the future of how we deliver mobile software at scale.\n\nWhat You’ll Do\n\n\nBuild and maintain automation frameworks for iOS (Swift) and/or Android (Kotlin/Java).Write and maintain end-to-end acceptance tests that validate product functionality across platforms.Integrate automated testing into CI/CD pipelines (Bitrise, GitHub Actions, Jenkins).Collaborate with developers to ensure testability is part of every feature design.Partner with product managers to define clear, measurable acceptance criteria.Track and improve quality metrics, using data to drive continuous improvement.Mentor engineers on best practices for automation and test-driven development.\n\nWhat We’re Looking For\n\nMinimum Qualifications\n\n\nBachelor’s degree in Computer Science, Engineering, or equivalent practical experience.3–4 years of experience in automation engineering, mobile app development, or both.Proficiency in Swift, Kotlin, or Java (experience in both iOS and Android is a plus).Hands-on experience with CI/CD systems such as Bitrise or GitHub Actions.Experience building and maintaining UI/E2E automation frameworks (e.g., XCTest, Espresso, Appium, Detox).\n\nPreferred Qualifications\n\n\nExperience testing GraphQL or REST APIs.Familiarity with mobile architecture patterns like TCA, MVVM, or MVI.Exposure to performance and reliability testing.Experience using AI-assisted development tools for automation.\n\nNice to Have\n\n\nExperience leading team-wide quality initiatives or setting quality goals.Familiarity with accessibility testing for mobile apps.\n\nWhy You’ll Love Working Here\n\n\nWork on automation that directly accelerates delivery of high-impact mobile products.Join a team that sees quality as a shared engineering responsibility, not a gatekeeping role.Collaborate with skilled engineers across mobile, backend, and product.Opportunities to expand into architecture, developer productivity, or leadership roles.\n\nIf you want to help build high-quality mobile apps at scale, love solving complex problems with automation, and thrive in a collaborative environment, we’d love to hear from you.\n\nBe Human With Us:\n\nBeing human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.\n\nWhat We Offer\n\nWhen you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:\n\n\nFlextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.\n\nAt ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.\n\nServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $85,700 CAD - $128,500 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong><strong>Automation Engineer, Mobile<br><br></strong></strong><strong>About The Role<br><br></strong>We’re building the next generation of ServiceTitan’s iOS and Android mobile applications—mission-critical tools that power our customers’ daily work. As a Mobile Automation Engineer, you’ll ensure these apps ship with exceptional quality, speed, and reliability.<br><br>You’ll design and maintain automation frameworks, write acceptance tests at the framework level, and integrate quality checks into our CI/CD pipelines. Working closely with engineers, product managers, and designers, you’ll help us bake quality into every stage of the development process—not just test for it at the end.<br><br>This role is perfect for someone with strong mobile coding skills, a passion for automation, and a desire to influence the future of how we deliver mobile software at scale.<br><br><strong><strong>What You’ll Do<br><br><br></strong></strong><ul><li>Build and maintain automation frameworks for iOS (Swift) and/or Android (Kotlin/Java).</li><li>Write and maintain end-to-end acceptance tests that validate product functionality across platforms.</li><li>Integrate automated testing into CI/CD pipelines (Bitrise, GitHub Actions, Jenkins).</li><li>Collaborate with developers to ensure testability is part of every feature design.</li><li>Partner with product managers to define clear, measurable acceptance criteria.</li><li>Track and improve quality metrics, using data to drive continuous improvement.</li><li>Mentor engineers on best practices for automation and test-driven development.<br><br></li></ul><strong><strong>What We’re Looking For<br><br></strong></strong><strong>Minimum Qualifications<br><br><br></strong><ul><li>Bachelor’s degree in Computer Science, Engineering, or equivalent practical experience.</li><li>3–4 years of experience in automation engineering, mobile app development, or both.</li><li>Proficiency in Swift, Kotlin, or Java (experience in both iOS and Android is a plus).</li><li>Hands-on experience with CI/CD systems such as Bitrise or GitHub Actions.</li><li>Experience building and maintaining UI/E2E automation frameworks (e.g., XCTest, Espresso, Appium, Detox).<br><br></li></ul><strong>Preferred Qualifications<br><br><br></strong><ul><li>Experience testing GraphQL or REST APIs.</li><li>Familiarity with mobile architecture patterns like TCA, MVVM, or MVI.</li><li>Exposure to performance and reliability testing.</li><li>Experience using AI-assisted development tools for automation.<br><br></li></ul><strong><strong>Nice to Have<br><br><br></strong></strong><ul><li>Experience leading team-wide quality initiatives or setting quality goals.</li><li>Familiarity with accessibility testing for mobile apps.<br><br></li></ul><strong><strong>Why You’ll Love Working Here<br><br><br></strong></strong><ul><li>Work on automation that directly accelerates delivery of high-impact mobile products.</li><li>Join a team that sees quality as a shared engineering responsibility, not a gatekeeping role.</li><li>Collaborate with skilled engineers across mobile, backend, and product.</li><li>Opportunities to expand into architecture, developer productivity, or leadership roles.<br><br></li></ul>If you want to help build high-quality mobile apps at scale, love solving complex problems with automation, and thrive in a collaborative environment, we’d love to hear from you.<br><br><strong><strong>Be Human With Us:<br><br></strong></strong>Being human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.<br><br><strong><strong>What We Offer<br><br></strong></strong>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:<br><br><br><ul><li>Flextime, recognition, and support for autonomous work: Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.</li><li>Holistic health and wellness benefits: Company-paid medical, dental, and vision for you and your dependents, RSP match, and an employee assistance program.</li><li>Support for Titans at all stages of life: Parental leave and support, up to $20k in adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, financial planning tools, and more.<br><br></li></ul>At ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.<br><br>ServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation. The expected salary range for this role for candidates residing in Canada is between $85,700 CAD - $128,500 CAD. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-08-26T18:46:16.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "ServiceTitan",
    "role": "Software Engineer, QA Automation",
    "location": "Greater Toronto Area, Canada ",
    "contentPreview": "Automation Engineer, Mobile About The Role We’re building the next generation of ServiceTitan’s iOS and Android mobile applications—mission-critical tools that power our customers’ daily work. As a Mo...",
    "publishedDate": "2025-08-26",
    "relevanceScore": 55,
    "relevanceReason": "While João has extensive experience in full-stack development and some overlap with the technologies listed in the job posting, the role specifically targets mobile automation experience (Swift/Kotlin/Java) that is not present in his resume. The role does not mention anything about Vancouver Metro Area, thus João is a moderate match, due to his other skills that could be transferable to a new role.",
    "recommendation": "Consider",
    "estimatedCompensation": "85.7k-128.5k CAD/year",
    "yearsOfExperienceRequired": "3-4",
    "hardSkillsRequired": "Swift, Kotlin, Java",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "bdac101d4bf8a2d2476eadf555d8d124",
    "url": "https://ca.linkedin.com/jobs/view/kotlin-backend-engineer-at-bayone-solutions-4283057405",
    "title": "BayOne Solutions hiring Kotlin Backend Engineer in Canada ",
    "content_text": "Posted 6:15:31 PM. Key Responsibilities:Design and develop backend components using Kotlin.Build and maintain RESTful…See this and similar jobs on LinkedIn.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 6:15:31 PM. Key Responsibilities:Design and develop backend components using Kotlin.Build and maintain RESTful…See this and similar jobs on LinkedIn.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-02-13T00:00:00.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "BayOne Solutions",
    "role": "Kotlin Backend Engineer",
    "location": "Canada ",
    "contentPreview": "Posted 6:15:31 PM. Key Responsibilities:Design and develop backend components using Kotlin.Build and maintain RESTful…See this and similar jobs on LinkedIn....",
    "publishedDate": "2025-02-13",
    "relevanceScore": 55,
    "relevanceReason": "The candidate's strong full-stack experience and proficiency in Typescript, Javascript, and Golang partially align with the Kotlin requirement. However, the lack of Kotlin experience significantly lowers the score. The job posting lacks details about the required experience level, hindering a full assessment.",
    "recommendation": "Consider",
    "estimatedCompensation": "80k-110k CAD/year",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Kotlin",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "cb4d7c100c27a7650970e10f37eb78d3",
    "url": "https://ca.linkedin.com/jobs/view/software-developer-in-test-sdet-at-cribl-4289649550",
    "title": "Cribl hiring Software Developer in Test (SDET) in Canada ",
    "content_text": "Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-07-15T00:00:00.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Cribl",
    "role": "Software Developer",
    "location": "Test (SDET)",
    "contentPreview": "Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn....",
    "publishedDate": "2025-07-15",
    "relevanceScore": 45,
    "relevanceReason": "The job posting lacks sufficient details to assess alignment with the candidate. The candidate's extensive full-stack experience and expertise in relevant technologies like TypeScript, React, and Golang suggest a potential match, but without knowing the specific requirements of the SDET role, it's difficult to evaluate the match.",
    "recommendation": "Skip",
    "estimatedCompensation": "Unspecified",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "b29886eb203f70bd31dfeedf0cb9db50",
    "url": "https://ca.linkedin.com/jobs/view/software-developer-drupal-at-empire-life-4277910780",
    "title": "Empire Life hiring Software Developer - Drupal in Canada ",
    "content_text": "Posted 6:50:15 PM. Software Developer- Drupal Location: Remote- Canada \nEmpire life is looking to hire a Software…See this and similar jobs on LinkedIn.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 6:50:15 PM. Software Developer- Drupal Location: Remote- Canada \nEmpire life is looking to hire a Software…See this and similar jobs on LinkedIn.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-02-13T00:00:00.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Empire Life",
    "role": "Software Developer - Drupal",
    "location": "Canada ",
    "contentPreview": "Posted 6:50:15 PM. Software Developer- Drupal Location: Remote- Canada Empire life is looking to hire a Software…See this and similar jobs on LinkedIn....",
    "publishedDate": "2025-02-13",
    "relevanceScore": 20,
    "relevanceReason": "The job posting mentions Drupal, which is not present in the candidate's skill set. The candidate's expertise lies primarily in Typescript, React, and other modern web technologies. The role's lack of information about the required experience and work location makes it hard to evaluate the match.",
    "recommendation": "Skip",
    "estimatedCompensation": "N/A",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "Drupal",
    "tailoredResume": "",
    "coverLetter": ""
  },
  {
    "id": "8f20de09ef432c7a6dd1d9457dda1ddc",
    "url": "https://ca.linkedin.com/jobs/view/sr-staff-software-engineer-product-platform-backend-at-cribl-4289652440",
    "title": "Cribl hiring Sr Staff Software Engineer, Product Platform (Backend) in Canada ",
    "content_text": "Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn.",
    "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn.</div></div>",
    "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
    "date_published": "2025-06-26T00:00:00.000Z",
    "authors": [
      {
        "name": "LinkedIn"
      }
    ],
    "attachments": [
      {
        "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
      }
    ],
    "company": "Cribl",
    "role": "Sr Staff Software Engineer, Product Platform (Backend)",
    "location": "Canada ",
    "contentPreview": "Posted 6:59:28 PM. Cribl does differently.What does that mean? It means we are a serious company that doesn’t take…See this and similar jobs on LinkedIn....",
    "publishedDate": "2025-06-26",
    "relevanceScore": 0,
    "relevanceReason": "Analysis failed",
    "recommendation": "Skip",
    "estimatedCompensation": "Unknown",
    "yearsOfExperienceRequired": "0",
    "hardSkillsRequired": "",
    "tailoredResume": "RELEVANT EXPERIENCE\nSoftware Engineer\nSuger | Oct. 2024–Jul. 2025\nTechnologies: Typescript, Golang, Postgres, AWS\nKey Achievements:\n• Built and maintained reusable API integrations for platforms such as Salesforce, HubSpot, and NetSuite, streamlining integration processes and improving overall efficiency.\n• Led the end-to-end development of new features, including task planning, API and UI implementation, database changes, cloud connections, testing, and documentation.\n• Mentored three engineers, providing guidance on code reviews, task clarification, and pairing on code, accelerating their contributions to the team and ensuring high-quality code.\n\nFull Stack Developer - Level III\nRadix Engineering and Software | Aug. 2023–Sep. 2024\nTechnologies: Typescript, React, C#, .NET\nKey Achievements:\n• Led a team of four developers in the implementation of a new interactive 3D visualization of an oil refinery plant, providing tailored feedback and helping the team members achieve a 50% to 100% increase in productivity.\n• Provided technical guidance and support to team members, fostering a collaborative environment and ensuring the successful delivery of project goals.\n\nFull Stack Developer - Level II\nRadix Engineering and Software | Aug. 2022–Aug. 2023\nTechnologies: Typescript, React, C#, .NET, Azure DevOps\nKey Achievements:\n• Reduced deployment time by 80% by creating deployment pipelines, enabling faster testing cycles and eliminating deployment errors.\n• Consistently delivered user stories within 40% to 70% of allocated timeframes.\n\n\n\nPROJECTS\nReact Extract\nDeveloped a VS Code extension for refactoring React components, achieving over 25 GitHub stars and 2800 downloads, praised for fixing a problem that larger extensions could not.\nTechnologies: Typescript, React, VS Code API\nKey Achievements:\n• Independently developed a VS Code extension to address a significant pain point for React developers.\n• Successfully published and maintained the extension on the VS Code Marketplace, receiving positive community feedback.\n\n",
    "coverLetter": "I'm incredibly excited by the Sr Staff Software Engineer, Product Platform (Backend) opportunity at Cribl. Your commitment to doing things differently, building serious solutions, and fostering a dynamic environment resonates deeply with my own professional aspirations. The chance to contribute to a platform that empowers observability and data control is particularly appealing, and I'm eager to leverage my skills to make a tangible impact.\n\nMy experience aligns seamlessly with Cribl's needs. In my previous roles, I've consistently demonstrated the ability to build and optimize complex systems, from designing and deploying scalable APIs to improving application performance. For example, I've successfully optimized front-end performance by up to 95% by using request splitting and geometry filters. Furthermore, my experience mentoring and leading teams, and my passion for end-to-end feature development, aligns with the demands of the position. I am confident that I can quickly integrate within your team, take ownership of critical projects, and contribute to Cribl's continued success.\n\nI am confident that I would be a valuable addition to the Cribl team. I thrive in collaborative environments and am adept at communicating technical concepts clearly and concisely. My strong work ethic, proactive approach to problem-solving, and dedication to continuous learning align perfectly with Cribl's culture of innovation and growth. I am keen to learn, share knowledge, and contribute to a team that values excellence. I look forward to the opportunity to discuss how I can contribute to Cribl's mission.\n"
  }
]