{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "45,000+ Software Engineer jobs in United States",
  "home_page_url": "https://www.linkedin.com/jobs/search/?currentJobId=4262882449&f_WT=2%2C3&keywords=software%20engineer&origin=JOB_SEARCH_PAGE_JOB_FILTER",
  "feed_url": "https://rss.app/feeds/v1.1/sUOBma3URjECoaqq.json",
  "favicon": "https://static.licdn.com/aero-v1/sc/h/al2o9zrvru7aqj8e1x2rzsrca",
  "language": "en",
  "description": "Today's top 45,000+ Software Engineer jobs in United States. Leverage your professional network, and get hired. New Software Engineer jobs added daily.",
  "items": [
    {
      "id": "19ee1ff805ff78bd1381d82f93ad15d0",
      "url": "https://www.linkedin.com/jobs/view/full-stack-engineer-at-pearpop-4290965711",
      "title": "Pearpop hiring Full Stack Engineer in Los Angeles, CA ",
      "content_text": "About Pearpop\n\nPearpop is redefining how brands harness creators to reach and inspire new audiences. As a full-service creative partner, we combine creative strategy, creator curation, and media amplification to deliver content that moves culture and drives results. With best-in-class creative, unmatched creator access, and a data-driven approach, we craft strategic, insight-driven campaigns backed by full-stack technology and performance media. Whether acting as a standalone creator solution or an extension of your team, Pearpop ensures every campaign is seamless, impactful, and culturally relevant.\n\nWorking at Pearpop\n\nWe're bringing together a smart and passionate team of creative builders to join us as we are a growth-stage, high-performance startup. In addition to competitive salaries, we have all the good stuff – equity, generous health and dental insurance, 401(k), and unlimited PTO.\n\nThis is a remote position if based outside of LA or hybrid if located in LA; fully stocked with snacks, beverages, cold brew, and all the good stuff!\n\nPosition Overview\n\nAs a Mid-level Full Stack Engineer, you’ll contribute to Pearpop’s platform by developing scalable back-end systems and integrating user-facing interfaces, with a primary focus on server-side applications using Node.js. You’ll design and implement RESTful APIs, optimize database performance, and ensure seamless front-end integration (using React or similar). Working closely with product, design, and talent teams, you’ll help build creator-centric features, troubleshoot issues, and maintain high code quality through code reviews. This role requires a balance of technical expertise, collaboration, and enthusiasm for the creator economy, with opportunities to grow under senior engineering mentorship.\n\nKey Responsibilities\n\nBack-End Development: Develop and maintain server-side applications using Node.js, focusing on performance, scalability, and reliability for creator and brand workflows. API Development: Design and implement RESTful APIs to support front-end services, creator tools, and brand integrations, ensuring low latency and high reliability. Database Management: Work with database systems (MySQL, PostgreSQL, or MongoDB) and ORMs like Sequelize to build and optimize data models for efficient storage and retrieval. Front-End Integration: Collaborate with front-end developers to integrate server-side logic with user-facing elements (JavaScript, HTML5, CSS3), ensuring a cohesive user experience. Performance Optimization: Optimize applications for speed and scalability, leveraging cloud platforms (GCP, AWS) to support high-volume creator interactions. Security Implementation: Apply security and data protection measures (e.g., authentication via Gravitee, encryption) to safeguard user and creator data. Troubleshooting and Debugging: Identify and resolve technical issues across back-end and front-end systems, ensuring optimal platform performance and minimal downtime. Code Quality: Participate in code reviews to maintain high code quality, adhering to best practices and Pearpop’s engineering standards. Collaboration: Work cross-functionally with product, design, and talent teams to translate business requirements into technical solutions aligned with Pearpop’s creator-centric vision. Stay Current: Keep up with industry trends in back-end and full-stack development, incorporating relevant technologies to enhance Pearpop’s platform. \n\nRequirements\n\nExperience: 4+ years in software development, with 2+ years focused on back-end development using Node.js and 1+ years contributing to front-end development (React or similar). Back-End Skills:Proficiency in JavaScript and Node.js frameworks (e.g., Hono). Experience designing and implementing RESTful APIs and microservices. Familiarity with database systems (MySQL, PostgreSQL, SQLite) and ORMs like Sequelize. Knowledge of authentication systems (e.g., Gravitee, OAuth) and basic security practices. Front-End Skills: Basic proficiency in front-end technologies (JavaScript, HTML5, CSS3) for integrating user-facing elements with server-side logic. Version Control: Strong experience with Git and GitHub for version control and collaborative development. Cloud and DevOps: Familiarity with cloud platforms (Google Cloud Platform, AWS, Cloudflare) and containerization (Docker), with basic knowledge of CI/CD pipelines (e.g., GitHub Actions). Problem-Solving: Strong analytical skills to troubleshoot and resolve technical challenges in a fast-paced environment. Collaboration: Experience working with cross-functional teams (e.g., product, design) to deliver cohesive solutions. Cultural Fit: Passion for social media, internet culture, and the creator economy, with a collaborative and proactive mindset. Education: Bachelor’s degree in Computer Science, Engineering, or a related field; equivalent experience accepted. \n\nPreferred Skills\n\nExperience with creator economy, social media, or e-commerce platforms. Familiarity with front-end frameworks like Next.js or state management tools (e.g., Redux). Knowledge of DevOps tools and practices (e.g., Terraform, CloudFormation). Exposure to performance monitoring tools (e.g., New Relic) or observability practices. Basic understanding of agile methodologies and project management tools (e.g., Jira, Asana). Ability to communicate technical concepts to non-technical stakeholders. \n\nWhy Pearpop?\n\nImpactful Role: Build and optimize the technical foundation of Pearpop’s creator platform, driving innovation in the $250B creator economy. Competitive Compensation: $100,000 - $160,000 base salary DOE (Range could be higher for senior level with 7+ years of experience)Innovative Culture: Thrive in a collaborative, fast-paced startup led by a Forbes 30 Under 30 CEO, leveraging cutting-edge tech (GCP, Salesforce, AI-driven insights) to redefine creator partnerships. Growth Opportunities: Grow your skills under senior engineering mentorship, with opportunities to contribute to high-impact projects. \n\nCompensation Range: $100K - $160K\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Pearpop<br><br></strong>Pearpop is redefining how brands harness creators to reach and inspire new audiences. As a full-service creative partner, we combine creative strategy, creator curation, and media amplification to deliver content that moves culture and drives results. With best-in-class creative, unmatched creator access, and a data-driven approach, we craft strategic, insight-driven campaigns backed by full-stack technology and performance media. Whether acting as a standalone creator solution or an extension of your team, Pearpop ensures every campaign is seamless, impactful, and culturally relevant.<br><br><strong>Working at Pearpop<br><br></strong>We're bringing together a smart and passionate team of creative builders to join us as we are a growth-stage, high-performance startup. In addition to competitive salaries, we have all the good stuff – equity, generous health and dental insurance, 401(k), and unlimited PTO.<br><br>This is a remote position if based outside of LA or hybrid if located in LA; fully stocked with snacks, beverages, cold brew, and all the good stuff!<br><br><strong>Position Overview<br><br></strong>As a Mid-level Full Stack Engineer, you’ll contribute to Pearpop’s platform by developing scalable back-end systems and integrating user-facing interfaces, with a primary focus on server-side applications using Node.js. You’ll design and implement RESTful APIs, optimize database performance, and ensure seamless front-end integration (using React or similar). Working closely with product, design, and talent teams, you’ll help build creator-centric features, troubleshoot issues, and maintain high code quality through code reviews. This role requires a balance of technical expertise, collaboration, and enthusiasm for the creator economy, with opportunities to grow under senior engineering mentorship.<br><br><strong>Key Responsibilities<br><br></strong><ul><li>Back-End Development: Develop and maintain server-side applications using Node.js, focusing on performance, scalability, and reliability for creator and brand workflows. </li><li>API Development: Design and implement RESTful APIs to support front-end services, creator tools, and brand integrations, ensuring low latency and high reliability. </li><li>Database Management: Work with database systems (MySQL, PostgreSQL, or MongoDB) and ORMs like Sequelize to build and optimize data models for efficient storage and retrieval. </li><li>Front-End Integration: Collaborate with front-end developers to integrate server-side logic with user-facing elements (JavaScript, HTML5, CSS3), ensuring a cohesive user experience. </li><li>Performance Optimization: Optimize applications for speed and scalability, leveraging cloud platforms (GCP, AWS) to support high-volume creator interactions. </li><li>Security Implementation: Apply security and data protection measures (e.g., authentication via Gravitee, encryption) to safeguard user and creator data. </li><li>Troubleshooting and Debugging: Identify and resolve technical issues across back-end and front-end systems, ensuring optimal platform performance and minimal downtime. </li><li>Code Quality: Participate in code reviews to maintain high code quality, adhering to best practices and Pearpop’s engineering standards. </li><li>Collaboration: Work cross-functionally with product, design, and talent teams to translate business requirements into technical solutions aligned with Pearpop’s creator-centric vision. </li><li>Stay Current: Keep up with industry trends in back-end and full-stack development, incorporating relevant technologies to enhance Pearpop’s platform. <br><br></li></ul><strong>Requirements<br><br></strong><ul><li>Experience: 4+ years in software development, with 2+ years focused on back-end development using Node.js and 1+ years contributing to front-end development (React or similar). </li><li>Back-End Skills:</li><ul><li>Proficiency in JavaScript and Node.js frameworks (e.g., Hono). </li><li>Experience designing and implementing RESTful APIs and microservices. </li><li>Familiarity with database systems (MySQL, PostgreSQL, SQLite) and ORMs like Sequelize. </li><li>Knowledge of authentication systems (e.g., Gravitee, OAuth) and basic security practices. </li></ul><li>Front-End Skills: Basic proficiency in front-end technologies (JavaScript, HTML5, CSS3) for integrating user-facing elements with server-side logic. </li><li>Version Control: Strong experience with Git and GitHub for version control and collaborative development. </li><li>Cloud and DevOps: Familiarity with cloud platforms (Google Cloud Platform, AWS, Cloudflare) and containerization (Docker), with basic knowledge of CI/CD pipelines (e.g., GitHub Actions). </li><li>Problem-Solving: Strong analytical skills to troubleshoot and resolve technical challenges in a fast-paced environment. </li><li>Collaboration: Experience working with cross-functional teams (e.g., product, design) to deliver cohesive solutions. </li><li>Cultural Fit: Passion for social media, internet culture, and the creator economy, with a collaborative and proactive mindset. </li><li>Education: Bachelor’s degree in Computer Science, Engineering, or a related field; equivalent experience accepted. <br><br></li></ul><strong>Preferred Skills<br><br></strong><ul><li>Experience with creator economy, social media, or e-commerce platforms. </li><li>Familiarity with front-end frameworks like Next.js or state management tools (e.g., Redux). </li><li>Knowledge of DevOps tools and practices (e.g., Terraform, CloudFormation). </li><li>Exposure to performance monitoring tools (e.g., New Relic) or observability practices. </li><li>Basic understanding of agile methodologies and project management tools (e.g., Jira, Asana). </li><li>Ability to communicate technical concepts to non-technical stakeholders. <br><br></li></ul><strong>Why Pearpop?<br><br></strong><ul><li>Impactful Role: Build and optimize the technical foundation of Pearpop’s creator platform, driving innovation in the $250B creator economy. </li><li>Competitive Compensation: $100,000 - $160,000 base salary DOE (Range could be higher for senior level with 7+ years of experience)</li><li>Innovative Culture: Thrive in a collaborative, fast-paced startup led by a Forbes 30 Under 30 CEO, leveraging cutting-edge tech (GCP, Salesforce, AI-driven insights) to redefine creator partnerships. </li><li>Growth Opportunities: Grow your skills under senior engineering mentorship, with opportunities to contribute to high-impact projects. <br><br></li></ul>Compensation Range: $100K - $160K<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-25T23:00:25.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 85,
      "relevanceReason": "This is a very good match. The candidate's extensive full-stack experience, particularly with React and Node.js, aligns well with the job requirements. The candidate's experience with Typescript, which is not explicitly mentioned in the description, adds to the candidate's value, making him a strong fit for this role.",
      "recommendation": "Strongly Recommended"
    },
    {
      "id": "8655727744c76359a20011b1b4c3f0d9",
      "url": "https://www.linkedin.com/jobs/view/frontend-engineer-all-levels-at-ramp-4290875615",
      "title": "Ramp hiring Frontend Engineer | All Levels in Florida, United States ",
      "content_text": "About Ramp\n\nAt Ramp, we’re rethinking how modern finance teams function in the age of AI. We believe AI isn’t just the next big wave. It’s the new foundation for how business gets done. We’re investing in that future — and in the people bold enough to build it.\n\nRamp is a financial operations platform designed to save companies time and money. Our all-in-one solution combines payments, corporate cards, vendor management, procurement, travel booking, and automated bookkeeping with built-in intelligence to maximize the impact of every dollar and hour spent. But we’re not just building features powered by AI. We’re building a platform where agents can chase receipts, close books, flag risks, and surface insights. This enables teams to reclaim their time and reinvest in what matters.\n\nMore than 40,000 businesses, from family-owned farms to space startups, have saved $10B and 27.5M hours with Ramp. Founded in 2019, Ramp powers the fastest-growing corporate card and bill payment platform in America, and enables over $80 billion in purchases each year.\n\nRamp’s investors include Thrive Capital, Sands Capital, General Catalyst, Founders Fund, Khosla Ventures, Sequoia Capital, Greylock, and Redpoint, among others, in addition to 100+ angel investors who have been founders or executives of leading companies.\n\nRamp has been named to Fast Company’s Most Innovative Companies list and LinkedIn’s Top U.S. Startups for more than 3 years, as well as the Forbes Cloud 100, CNBC Disruptor 50, and TIME Magazine’s 100 Most Influential Companies.\n\nAbout The Role\n\nOur ideal candidate has a deep understanding of JavaScript, a passion for web performance, and can creatively come up with solutions to solve customer's needs. Our tech stack currently involves TypeScript, React, Vite, and Ryu, our in-house design system.\n\nCheck out our Engineering Blog for more on our tech stack, mission and values!\n\nWhat You’ll Do\n\nBuild! Design performant, beautiful, and usable interfaces Collaborate on our technical vision. Lead discussions and implementation of multiple complex projectsFoster a culture of upholding industry-leading UXContinuously improve our engineering processes, tools, and systems that allow us to scale the code base, productivity, and the teamRecruit, interview and develop your own interview questions, while fostering the culture of excellence, velocity and humilityInspire and mentor less experienced engineers and interns\n\nWhat You'll Need\n\nMinimum of 2 years of frontend engineering experience preferredProficiency in JavaScript and ReactKnack for getting the visuals rightTrack record of shipping high-quality products and developing projects at scaleAbility to turn business and product ideas into engineering solutionsDesire to work in a fast-paced environment, continuously grow, and master your craftAlignment with Ramp’s core values of enabling businesses to grow more by spending less\n\nBenefits (for U.S.-based Full-time Employees)\n\n100% medical, dental & vision insurance coverage for youPartially covered for your dependentsOne Medical annual membership401k (including employer match on contributions made while employed by Ramp)Flexible PTOFertility HRA (up to $5,000 per year)WFH stipend to support your home office needsWellness stipendParental LeaveRelocation support to NYC or SF (as needed)Pet insurance\n\nReferral Instructions\n\nIf you are being referred for the role, please contact that person to apply on your behalf.\n\nOther Notices\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nRamp Applicant Privacy Notice",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Ramp<br><br></strong>At Ramp, we’re rethinking how modern finance teams function in the age of AI. We believe AI isn’t just the next big wave. It’s the new foundation for how business gets done. We’re investing in that future — and in the people bold enough to build it.<br><br>Ramp is a financial operations platform designed to save companies time and money. Our all-in-one solution combines payments, corporate cards, vendor management, procurement, travel booking, and automated bookkeeping with built-in intelligence to maximize the impact of every dollar and hour spent. But we’re not just building features powered by AI. We’re building a platform where agents can chase receipts, close books, flag risks, and surface insights. This enables teams to reclaim their time and reinvest in what matters.<br><br>More than 40,000 businesses, from family-owned farms to space startups, have saved $10B and 27.5M hours with Ramp. Founded in 2019, Ramp powers the fastest-growing corporate card and bill payment platform in America, and enables over $80 billion in purchases each year.<br><br>Ramp’s investors include Thrive Capital, Sands Capital, General Catalyst, Founders Fund, Khosla Ventures, Sequoia Capital, Greylock, and Redpoint, among others, in addition to 100+ angel investors who have been founders or executives of leading companies.<br><br>Ramp has been named to Fast Company’s Most Innovative Companies list and LinkedIn’s Top U.S. Startups for more than 3 years, as well as the Forbes Cloud 100, CNBC Disruptor 50, and TIME Magazine’s 100 Most Influential Companies.<br><br><strong>About The Role<br><br></strong>Our ideal candidate has a deep understanding of JavaScript, a passion for web performance, and can creatively come up with solutions to solve customer's needs. Our tech stack currently involves TypeScript, React, Vite, and Ryu, our in-house design system.<br><br>Check out our Engineering Blog for more on our tech stack, mission and values!<br><br>What You’ll Do<br><br><ul><li>Build! </li><li>Design performant, beautiful, and usable interfaces </li><li>Collaborate on our technical vision. Lead discussions and implementation of multiple complex projects</li><li>Foster a culture of upholding industry-leading UX</li><li>Continuously improve our engineering processes, tools, and systems that allow us to scale the code base, productivity, and the team</li><li>Recruit, interview and develop your own interview questions, while fostering the culture of excellence, velocity and humility</li><li>Inspire and mentor less experienced engineers and interns<br><br></li></ul>What You'll Need<br><br><ul><li>Minimum of 2 years of frontend engineering experience preferred</li><li>Proficiency in JavaScript and React</li><li>Knack for getting the visuals right</li><li>Track record of shipping high-quality products and developing projects at scale</li><li>Ability to turn business and product ideas into engineering solutions</li><li>Desire to work in a fast-paced environment, continuously grow, and master your craft</li><li>Alignment with Ramp’s core values of enabling businesses to grow more by spending less<br><br></li></ul><strong>Benefits (for U.S.-based Full-time Employees)<br><br></strong><ul><li>100% medical, dental & vision insurance coverage for you</li><ul><li>Partially covered for your dependents</li><li>One Medical annual membership</li></ul><li>401k (including employer match on contributions made while employed by Ramp)</li><li>Flexible PTO</li><li>Fertility HRA (up to $5,000 per year)</li><li>WFH stipend to support your home office needs</li><li>Wellness stipend</li><li>Parental Leave</li><li>Relocation support to NYC or SF (as needed)</li><li>Pet insurance<br><br></li></ul>Referral Instructions<br><br>If you are being referred for the role, please contact that person to apply on your behalf.<br><br><strong>Other Notices<br><br></strong>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br>Ramp Applicant Privacy Notice</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-25T22:53:12.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 85,
      "relevanceReason": "João's extensive experience with TypeScript and React aligns perfectly with the job requirements. His history of building performant interfaces and leading teams, as demonstrated in his work at Radix Engineering and Suger, makes him a strong candidate for this Frontend Engineer role.",
      "recommendation": "Apply"
    },
    {
      "id": "c94ff0131b6a5eb2df91bd515e229b3d",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-frontend-all-levels-at-zip-4098166100",
      "title": "Zip hiring Software Engineer, Frontend (All Levels) in San Francisco, CA ",
      "content_text": "The simple task of buying software, services, or tools at work has become hopelessly complicated at even the most innovative companies in the world. Today, enterprises spend $120T+ per year globally (>30 times larger than annual consumer e-commerce spend) and rely on vendors more than ever before to run their businesses.\n\nOur cofounders started Zip in 2020 to address this seemingly intractable problem with a purpose-built procurement platform that provides a simple, consumer-grade user experience. Within the last 4 years, Zip has created a new category and developed the leading solution in this $50B+ TAM space. Today, the world’s leading companies like OpenAI, Snowflake, Anthropic, Coinbase, and Prudential rely on Zip to manage billions of dollars in spend.\n\nWe have a world-class team coming from category-defining companies like Airbnb, Meta, Stripe, Salesforce, Apple, and Google. With a $2.2 billion valuation and $370 million in funding from Y Combinator, Tiger Global, BOND, DST Global, and CRV, we’re focused on developing cutting-edge technology, expanding into new global markets, and—above all–driving incredible value for our customers. Join us!\n\nWe’re looking for a passionate Software Engineer, Frontend (Mid-level to Staff) to help us build beautiful, performant, and scalable user-facing experiences. In this role, you’ll take ownership of our core frontend architecture and ship features that have a direct and immediate impact on our customers.\n\nYou'll collaborate closely with a highly skilled, cross-functional team that values thoughtful design, fast iteration, and clean, maintainable code. Our engineers have a high degree of autonomy and are trusted to take features from concept to production, all while contributing towards improving our frontend practices as a company.\n\nYou will\n\nDesign and build highly reliable and resilient products and features.Work closely with cross functional product and customer-facing teams to understand requirements and ship thoughtful solutions.Write high-quality, extensible, and maintainable code.Design and build scalable frontend applications and components.Design and build APIs to drive existing and new features for a web-based application.\n\n\nQualifications\n\n3+ years of experience in modern web app developmentBS or higher, in Computer Science or technical fieldProficiency in React, TypeScript, browser APIs, and performance optimizationExperience with web application and API development in production environments. At Zip, our stack includes Python, Typescript, React, and GraphQL.Experience with industry standard build, test, deploy tools. At Zip, we work with: Kubernetes, Spinnaker, Jenkins, Segment, Github Actions, Datadog, Bugsnag and Fullstory.Ability and interest to quickly learn new frameworks and architecture patterns as neededExperience working at a small company with diverse responsibilities is a bonus, but not required.\n\n\nThe salary range for this role is $150,000 - $220,000. The salary for this position is determined based on a variety of job-related factors that may include location, relevant experience, education, or particular skills and expertise.\n\nPerks & Benefits\n\nAt Zip, we’re committed to providing our employees with everything they need to do their best work.\n\n📈 Start-up equity🦷 Full health, vision & dental coverage🍽️ Catered lunches & dinners for SF employees🚍 Commuter benefit🚠 Team building events & happy hours🌴 Flexible PTO💻 Apple equipment plus home office budget💸 401k plan\n\n\nWe're looking to hire Zipsters and that means hiring people who take ownership, communicate openly, have an underdog mindset, and are excited to increase the pace of innovation for every business in the world. We encourage all candidates to apply even if your experience doesn't exactly match up to our job description. We are committed to building a diverse and inclusive workspace where everyone (regardless of age, religion, ethnicity, gender, sexual orientation, and more) feels like they belong. We look forward to hearing from you!",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>The simple task of buying software, services, or tools at work has become hopelessly complicated at even the most innovative companies in the world. Today, enterprises spend $120T+ per year globally (>30 times larger than annual consumer e-commerce spend) and rely on vendors more than ever before to run their businesses.<br><br>Our cofounders started Zip in 2020 to address this seemingly intractable problem with a purpose-built procurement platform that provides a simple, consumer-grade user experience. Within the last 4 years, Zip has created a new category and developed the leading solution in this $50B+ TAM space. Today, the world’s leading companies like OpenAI, Snowflake, Anthropic, Coinbase, and Prudential rely on Zip to manage billions of dollars in spend.<br><br>We have a world-class team coming from category-defining companies like Airbnb, Meta, Stripe, Salesforce, Apple, and Google. With a $2.2 billion valuation and $370 million in funding from Y Combinator, Tiger Global, BOND, DST Global, and CRV, we’re focused on developing cutting-edge technology, expanding into new global markets, and—above all–driving incredible value for our customers. Join us!<br><br>We’re looking for a passionate <strong>Software Engineer, Frontend (Mid-level to Staff) </strong>to help us build beautiful, performant, and scalable user-facing experiences. In this role, you’ll take ownership of our core frontend architecture and ship features that have a direct and immediate impact on our customers.<br><br>You'll collaborate closely with a highly skilled, cross-functional team that values thoughtful design, fast iteration, and clean, maintainable code. Our engineers have a high degree of autonomy and are trusted to take features from concept to production, all while contributing towards improving our frontend practices as a company.<br><br><strong>You will<br><br></strong><ul><li>Design and build highly reliable and resilient products and features.</li><li>Work closely with cross functional product and customer-facing teams to understand requirements and ship thoughtful solutions.</li><li>Write high-quality, extensible, and maintainable code.</li><li>Design and build scalable frontend applications and components.</li><li>Design and build APIs to drive existing and new features for a web-based application.<br><br><br></li></ul><strong>Qualifications<br><br></strong><ul><li>3+ years of experience in modern web app development</li><li>BS or higher, in Computer Science or technical field</li><li>Proficiency in React, TypeScript, browser APIs, and performance optimization</li><li>Experience with web application and API development in production environments. At Zip, our stack includes Python, Typescript, React, and GraphQL.</li><li>Experience with industry standard build, test, deploy tools. At Zip, we work with: Kubernetes, Spinnaker, Jenkins, Segment, Github Actions, Datadog, Bugsnag and Fullstory.</li><li>Ability and interest to quickly learn new frameworks and architecture patterns as needed</li><li>Experience working at a small company with diverse responsibilities is a bonus, but not required.<br><br><br></li></ul>The salary range for this role is $150,000 - $220,000. The salary for this position is determined based on a variety of job-related factors that may include location, relevant experience, education, or particular skills and expertise.<br><br><strong>Perks & Benefits<br><br></strong>At Zip, we’re committed to providing our employees with everything they need to do their best work.<br><br><ul><li>📈 Start-up equity</li><li>🦷 Full health, vision & dental coverage</li><li>🍽️ Catered lunches & dinners for SF employees</li><li>🚍 Commuter benefit</li><li>🚠 Team building events & happy hours</li><li>🌴 Flexible PTO</li><li>💻 Apple equipment plus home office budget</li><li>💸 401k plan<br><br><br></li></ul><em>We're looking to hire Zipsters and that means hiring people who take ownership, communicate openly, have an underdog mindset, and are excited to increase the pace of innovation for every business in the world. We encourage all candidates to apply even if your experience doesn't exactly match up to our job description. We are committed to building a diverse and inclusive workspace where everyone (regardless of age, religion, ethnicity, gender, sexual orientation, and more) feels like they belong. We look forward to hearing from you!</em></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T12:42:24.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 85,
      "relevanceReason": "João's strong frontend skills, particularly with TypeScript and React, directly align with the job requirements. His experience in full-stack development and his proven ability to optimize performance and lead teams further strengthens his candidacy.",
      "recommendation": "Apply"
    },
    {
      "id": "84deb0c40f56ee50eefeb07e9a38bb97",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-public-api-at-notion-4278551514",
      "title": "Notion hiring Software Engineer, Public API in San Francisco, CA ",
      "content_text": "About Us\n\nNotion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.\n\nIn-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.\n\nAbout The Role\n\nMillions of people use Notion, and tens of thousands of developers are making Notion more powerful for those users (and themselves) by building features, power-ups, and novel new tools on top of Notion’s developer interface.\n\nWe are focusing on extending our API for strategic partnerships and use cases. We need your help to make existing APIs more robust & reliable, while architecting new classes of APIs to cultivate a rich ecosystem of tooling built on top of Notion. You will design and build powerful, scalable, and developer-friendly sets of APIs, enabling partner and customer developers to extend Notion to be even more useful as a connected workspace for the millions of users and teams who rely on us every day.\n\nWhat You'll Achieve\n\nYou’ll help architect new classes of APIs that can be composed together by partner and customer developers to solve users’ needs.You’ll understand the developer use cases and work to ensure that they are all well supported in the APIs you design and implement.You'll improve the usability, performance, reliability and architecture of our externally facing developer APIs service and system.\n\nSkills You'll Need To Bring\n\nExperienced engineer & mentor: You have 8+ years of experience as a software engineer building scalable technology. You’re excited about bringing your pre-existing knowledge and experience to the team. You have experience working with and mentoring other software engineers.Pragmatic and business-oriented: You care about business impact and prioritize projects accordingly. You're not just going after cool stuff—you understand the balance between craft, speed, and the bottom line.External developer API expertise: You have experience building interfaces or tools for external developers to use, or you’re motivated and excited to learn best practices in this domain.Thoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck.Put users first: You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad.Empathetic communication: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed.\n\nNice To Haves\n\nYou have experience working with public APIs either as a developer using, creating, or maintaining those APIs.You have experience driving teams toward shared goals and can balance business priorities with individuals’ strengths, areas of interest, and career development goals.You're proficient with any part of our technology stack: React, TypeScript, Node.js, Memcached, Postgres and Docker.You've heard of computing pioneers like Ada Lovelace, Douglas Engelbart, Alan Kay, and others—and understand why we're big fans of their work.\n\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nNotion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n\nNotion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco, the estimated base salary range for this role is $190,000 - $250,000 per year.\n\nBy clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Us<br><br></strong>Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.<br><br>In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.<br><br><strong>About The Role<br><br></strong>Millions of people use Notion, and tens of thousands of developers are making Notion more powerful for those users (and themselves) by building features, power-ups, and novel new tools on top of Notion’s developer interface.<br><br>We are focusing on extending our API for strategic partnerships and use cases. We need your help to make existing APIs more robust & reliable, while architecting new classes of APIs to cultivate a rich ecosystem of tooling built on top of Notion. You will design and build powerful, scalable, and developer-friendly sets of APIs, enabling partner and customer developers to extend Notion to be even more useful as a connected workspace for the millions of users and teams who rely on us every day.<br><br><strong>What You'll Achieve<br><br></strong><ul><li>You’ll help architect new classes of APIs that can be composed together by partner and customer developers to solve users’ needs.</li><li>You’ll understand the developer use cases and work to ensure that they are all well supported in the APIs you design and implement.</li><li>You'll improve the usability, performance, reliability and architecture of our externally facing developer APIs service and system.<br><br></li></ul><strong>Skills You'll Need To Bring<br><br></strong><ul><li>Experienced engineer & mentor: You have 8+ years of experience as a software engineer building scalable technology. You’re excited about bringing your pre-existing knowledge and experience to the team. You have experience working with and mentoring other software engineers.</li><li>Pragmatic and business-oriented: You care about business impact and prioritize projects accordingly. You're not just going after cool stuff—you understand the balance between craft, speed, and the bottom line.</li><li>External developer API expertise: You have experience building interfaces or tools for external developers to use, or you’re motivated and excited to learn best practices in this domain.</li><li>Thoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck.</li><li>Put users first: You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad.</li><li>Empathetic communication: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed.<br><br></li></ul><strong>Nice To Haves<br><br></strong><ul><li>You have experience working with public APIs either as a developer using, creating, or maintaining those APIs.</li><li>You have experience driving teams toward shared goals and can balance business priorities with individuals’ strengths, areas of interest, and career development goals.</li><li>You're proficient with any part of our technology stack: React, TypeScript, Node.js, Memcached, Postgres and Docker.</li><li>You've heard of computing pioneers like Ada Lovelace, Douglas Engelbart, Alan Kay, and others—and understand why we're big fans of their work.<br><br></li></ul>We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.<br><br>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law.<br><br>Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco, the estimated base salary range for this role is $190,000 - $250,000 per year.<br><br>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T11:35:49.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 82,
      "relevanceReason": "João's experience aligns well with the requirements, especially his full-stack development background and experience with TypeScript, which is a strong match. His experience with API development and mentorship also fits the role's description.",
      "recommendation": "Strongly recommended"
    },
    {
      "id": "858fe0b98f9728571f6ce2ad1ce24d78",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-member-commerce-games-engineering-at-netflix-4208343571",
      "title": "Netflix hiring Software Engineer (L4) - Member, Commerce & Games Engineering in United States ",
      "content_text": "Posted 9:42:27 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:42:27 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 78,
      "relevanceReason": "The candidate has a strong technical foundation in relevant technologies like TypeScript and React, aligning well with potential frontend needs at Netflix. Their experience leading teams and optimizing performance in previous roles is valuable. While the job description is generic, the candidate's experience makes them a good fit.",
      "recommendation": "Recommended"
    },
    {
      "id": "3ce1f4b08de6ffeed4fd86c2ac67d828",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-ai-product-at-notion-4278553000",
      "title": "Notion hiring Software Engineer, AI Product in New York, NY ",
      "content_text": "About Us\n\nNotion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.\n\nIn-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.\n\nAbout The Role\n\nWe're looking for an AI Product Engineer to join the team responsible for Notion's database block— which powers views like tables, galleries, charts, forms, and more. As a strategic partner in shaping Notion's AI vision, you'll help define and build cutting-edge AI-powered features into this core product experience, leveraging LLMs, embeddings, and other AI technologies to make Notion's databases more intelligent and capable.\n\nWhat You’ll Achieve\n\nWork with the team to prototype and experiment with new AI featuresProductionize and launch new AI technology integrations into Notion’s core productCollaborate with cross-functional teams to deliver product features on timeStay up-to-date with the latest AI technologies and trends\n\nSkills You'll Need To Bring\n\nExpertise building and prototyping: You have experience building AI products using LLMs, embeddings and other ML technologies. You understand how parts of a system fit together from UI to data model, are familiar with relational databases like Postgres or MySQL, and have experience building products from ground up.Shipping quality user interfaces: You partner closely with product and design to craft beautiful user experiences for large audiences, leveraging web technologies like HTML, CSS, JavaScript, and a modern UI framework like React.Problem-solving: You approach problems holistically, starting with a clear and accurate understanding of the context. You think critically about the implications of what you're building and how it will impact real people's lives. You can navigate ambiguity flawlessly, decompose complex problems into clean solutions, while also balancing the business impact of what you’re building.Empathetic communication and collaboration: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed. You enjoy collaborating with both fellow engineers and cross-functional partners. You are a lifelong learner and invest in both your own growth and the growth, learning, and development of your teammates.Impact-orientation and user focus: You care about business impact and prioritize projects accordingly. You understand the balance between craft, speed, and the bottom line. You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad. Work isn't a solo endeavor for you, and you enjoy collaborating cross-functionally to accomplish shared goals.\n\nNice To Haves\n\nYou're proficient with any part of our technology stack: React, TypeScript, Node.js, and Postgres.You have experience driving teams toward shared goals and can balance business priorities with individuals’ strengths, areas of interest, and career development goals.You've heard of computing pioneers like Ada Lovelace, Douglas Engelbart, Alan Kay, and others—and understand why we're big fans of their work.You have interests outside of technology, such as in art, history, or social sciences.\n\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nNotion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.\n\nNotion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco and New York, the estimated base salary range for this role is $190,000 - $285,000 per year.\n\nBy clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Us<br><br></strong>Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.<br><br>In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.<br><br><strong>About The Role<br><br></strong>We're looking for an AI Product Engineer to join the team responsible for Notion's database block— which powers views like tables, galleries, charts, forms, and more. As a strategic partner in shaping Notion's AI vision, you'll help define and build cutting-edge AI-powered features into this core product experience, leveraging LLMs, embeddings, and other AI technologies to make Notion's databases more intelligent and capable.<br><br><strong>What You’ll Achieve<br><br></strong><ul><li>Work with the team to prototype and experiment with new AI features</li><li>Productionize and launch new AI technology integrations into Notion’s core product</li><li>Collaborate with cross-functional teams to deliver product features on time</li><li>Stay up-to-date with the latest AI technologies and trends<br><br></li></ul><strong>Skills You'll Need To Bring<br><br></strong><ul><li>Expertise building and prototyping: You have experience building AI products using LLMs, embeddings and other ML technologies. You understand how parts of a system fit together from UI to data model, are familiar with relational databases like Postgres or MySQL, and have experience building products from ground up.</li><li>Shipping quality user interfaces: You partner closely with product and design to craft beautiful user experiences for large audiences, leveraging web technologies like HTML, CSS, JavaScript, and a modern UI framework like React.</li><li>Problem-solving: You approach problems holistically, starting with a clear and accurate understanding of the context. You think critically about the implications of what you're building and how it will impact real people's lives. You can navigate ambiguity flawlessly, decompose complex problems into clean solutions, while also balancing the business impact of what you’re building.</li><li>Empathetic communication and collaboration: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed. You enjoy collaborating with both fellow engineers and cross-functional partners. You are a lifelong learner and invest in both your own growth and the growth, learning, and development of your teammates.</li><li>Impact-orientation and user focus: You care about business impact and prioritize projects accordingly. You understand the balance between craft, speed, and the bottom line. You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad. Work isn't a solo endeavor for you, and you enjoy collaborating cross-functionally to accomplish shared goals.<br><br></li></ul><strong>Nice To Haves<br><br></strong><ul><li>You're proficient with any part of our technology stack: React, TypeScript, Node.js, and Postgres.</li><li>You have experience driving teams toward shared goals and can balance business priorities with individuals’ strengths, areas of interest, and career development goals.</li><li>You've heard of computing pioneers like Ada Lovelace, Douglas Engelbart, Alan Kay, and others—and understand why we're big fans of their work.</li><li>You have interests outside of technology, such as in art, history, or social sciences.<br><br></li></ul>We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.<br><br>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.<br><br>Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco and New York, the estimated base salary range for this role is $190,000 - $285,000 per year.<br><br>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T12:02:36.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 78,
      "relevanceReason": "João's full-stack experience and proficiency in Javascript, HTML, and CSS, along with his cloud experience with AWS and Azure, aligns well with the job requirements. The role's focus on AI product engineering represents a moderate match, as his experience in the field is not explicitly mentioned in his resume but he has the technical skills and the job describes those skills for a person in the position. The mention of Postgres as a database is perfect.",
      "recommendation": "Consider"
    },
    {
      "id": "a67850984b515d2cdbc3a14ae4464b91",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-datastore-at-notion-4278552077",
      "title": "Notion hiring Software Engineer, Datastore in San Francisco, CA ",
      "content_text": "About Us\n\nNotion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.\n\nIn-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.\n\nAbout The Role\n\nDatastore infrastructure is the backbone of any software product, and at Notion, it plays a critical role in ensuring our millions of users have a fast, reliable, and secure experience. Our Datastore Infra Team builds and maintains the systems that power the databases and caches behind every Notion feature. From scaling our relational and NoSQL databases to designing data migration frameworks, we ensure that Notion’s data layer remains robust and future-proof.\n\nAs part of the Datastore Infra Team, you’ll have a unique opportunity to shape how Notion manages and scales its foundational data services, enabling innovation across the company. This role is based out of our New York City or San Francisco office.\n\nWhat You'll Achieve\n\nYou will drive the evolution of our datastore infrastructure to meet the needs of over 100 million global users and support the rapid growth of our product and business. This includes ensuring our systems are reliable, efficient, and scalable, while evaluating and integrating new technologies to keep us ahead of emerging challenges. Your work will empower our engineers to build features with confidence, backed by a strong datastore foundation.You will design and deliver a Datastore Platform that simplifies how teams manage and interact with data at scale. From flexible schema management to migrating hundreds of billions of records, you’ll develop tools and frameworks that make it easier for engineers to innovate while maintaining safety, efficiency, and performance.You will develop the skills and confidence to debug live production systems with minimal disruption, whether replacing components or managing failovers. You will participate in an on-call rotation, responding to incidents to uphold service reliability and quickly restore normal operations.You will partner with product engineers and other infra teams to ensure our datastore infrastructure aligns with evolving business needs and product goals\n\nSkills You'll Need To Bring\n\nFamiliarity with Datastore Systems: You have experience with large scale relational databases, distributed caches, and NoSQL systems. You understand how to design, scale, and optimize them to support growing business needs. Our team utilizes cloud-based datastore solutions like AWS RDS, DynamoDB, and ElastiCache to power our infrastructure.Systems thinker: You understand distributed systems and can design solutions that account for tradeoffs like consistency, latency, and scalability.Pragmatic problem-solver: You prioritize business impact and understand the balance between craft, speed, and long-term maintainability. You’re opinionated but not ideological, and you learn new technologies as you go.Ownership and initiative: You thrive in a fast-moving, unstructured environment and are comfortable taking ownership of ambiguous problems. You act with a bias toward action and focus on results.Customer Empathy: You excel at collaborating across teams, offering guidance and solutions to unblock engineers and support them in building reliable systems. With empathy at the core of your approach, you focus on addressing the needs of those who depend on datastore infrastructure.\n\nNice To Haves\n\nExperience with change data capture tools like Debezium for real-time data replication and migrations.Experience working closely with application developers, understanding their workflows, and building datastore solutions that address their challenges, such as schema changes, performance, and data access patterns.\n\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nNotion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.\n\nNotion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco. and New York, the estimated base salary range for this role is $130,000 - $240,000 per year.\n\nBy clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Us<br><br></strong>Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.<br><br>In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.<br><br><strong>About The Role<br><br></strong>Datastore infrastructure is the backbone of any software product, and at Notion, it plays a critical role in ensuring our millions of users have a fast, reliable, and secure experience. Our Datastore Infra Team builds and maintains the systems that power the databases and caches behind every Notion feature. From scaling our relational and NoSQL databases to designing data migration frameworks, we ensure that Notion’s data layer remains robust and future-proof.<br><br>As part of the Datastore Infra Team, you’ll have a unique opportunity to shape how Notion manages and scales its foundational data services, enabling innovation across the company. This role is based out of our New York City or San Francisco office.<br><br><strong>What You'll Achieve<br><br></strong><ul><li>You will drive the evolution of our datastore infrastructure to meet the needs of over 100 million global users and support the rapid growth of our product and business. This includes ensuring our systems are reliable, efficient, and scalable, while evaluating and integrating new technologies to keep us ahead of emerging challenges. Your work will empower our engineers to build features with confidence, backed by a strong datastore foundation.</li><li>You will design and deliver a Datastore Platform that simplifies how teams manage and interact with data at scale. From flexible schema management to migrating hundreds of billions of records, you’ll develop tools and frameworks that make it easier for engineers to innovate while maintaining safety, efficiency, and performance.</li><li>You will develop the skills and confidence to debug live production systems with minimal disruption, whether replacing components or managing failovers. You will participate in an on-call rotation, responding to incidents to uphold service reliability and quickly restore normal operations.</li><li>You will partner with product engineers and other infra teams to ensure our datastore infrastructure aligns with evolving business needs and product goals<br><br></li></ul><strong>Skills You'll Need To Bring<br><br></strong><ul><li>Familiarity with Datastore Systems: You have experience with large scale relational databases, distributed caches, and NoSQL systems. You understand how to design, scale, and optimize them to support growing business needs. Our team utilizes cloud-based datastore solutions like AWS RDS, DynamoDB, and ElastiCache to power our infrastructure.</li><li>Systems thinker: You understand distributed systems and can design solutions that account for tradeoffs like consistency, latency, and scalability.</li><li>Pragmatic problem-solver: You prioritize business impact and understand the balance between craft, speed, and long-term maintainability. You’re opinionated but not ideological, and you learn new technologies as you go.</li><li>Ownership and initiative: You thrive in a fast-moving, unstructured environment and are comfortable taking ownership of ambiguous problems. You act with a bias toward action and focus on results.</li><li>Customer Empathy: You excel at collaborating across teams, offering guidance and solutions to unblock engineers and support them in building reliable systems. With empathy at the core of your approach, you focus on addressing the needs of those who depend on datastore infrastructure.<br><br></li></ul><strong>Nice To Haves<br><br></strong><ul><li>Experience with change data capture tools like Debezium for real-time data replication and migrations.</li><li>Experience working closely with application developers, understanding their workflows, and building datastore solutions that address their challenges, such as schema changes, performance, and data access patterns.<br><br></li></ul>We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.<br><br>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.<br><br>Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco. and New York, the estimated base salary range for this role is $130,000 - $240,000 per year.<br><br>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T11:37:56.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 78,
      "relevanceReason": "João's strong experience with full-stack development, particularly in Typescript and React, aligns well with the role's potential requirements. His experience in performance optimization and team leadership provides a good fit for the responsibilities described, but lacks specific datastore experience.",
      "recommendation": "Consider"
    },
    {
      "id": "426d8f4ba0fb66f816801999bd26e9fc",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-datastore-at-notion-4278552078",
      "title": "Notion hiring Software Engineer, Datastore in New York, NY ",
      "content_text": "About Us\n\nNotion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.\n\nIn-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.\n\nAbout The Role\n\nDatastore infrastructure is the backbone of any software product, and at Notion, it plays a critical role in ensuring our millions of users have a fast, reliable, and secure experience. Our Datastore Infra Team builds and maintains the systems that power the databases and caches behind every Notion feature. From scaling our relational and NoSQL databases to designing data migration frameworks, we ensure that Notion’s data layer remains robust and future-proof.\n\nAs part of the Datastore Infra Team, you’ll have a unique opportunity to shape how Notion manages and scales its foundational data services, enabling innovation across the company. This role is based out of our New York City or San Francisco office.\n\nWhat You'll Achieve\n\nYou will drive the evolution of our datastore infrastructure to meet the needs of over 100 million global users and support the rapid growth of our product and business. This includes ensuring our systems are reliable, efficient, and scalable, while evaluating and integrating new technologies to keep us ahead of emerging challenges. Your work will empower our engineers to build features with confidence, backed by a strong datastore foundation.You will design and deliver a Datastore Platform that simplifies how teams manage and interact with data at scale. From flexible schema management to migrating hundreds of billions of records, you’ll develop tools and frameworks that make it easier for engineers to innovate while maintaining safety, efficiency, and performance.You will develop the skills and confidence to debug live production systems with minimal disruption, whether replacing components or managing failovers. You will participate in an on-call rotation, responding to incidents to uphold service reliability and quickly restore normal operations.You will partner with product engineers and other infra teams to ensure our datastore infrastructure aligns with evolving business needs and product goals\n\nSkills You'll Need To Bring\n\nFamiliarity with Datastore Systems: You have experience with large scale relational databases, distributed caches, and NoSQL systems. You understand how to design, scale, and optimize them to support growing business needs. Our team utilizes cloud-based datastore solutions like AWS RDS, DynamoDB, and ElastiCache to power our infrastructure.Systems thinker: You understand distributed systems and can design solutions that account for tradeoffs like consistency, latency, and scalability.Pragmatic problem-solver: You prioritize business impact and understand the balance between craft, speed, and long-term maintainability. You’re opinionated but not ideological, and you learn new technologies as you go.Ownership and initiative: You thrive in a fast-moving, unstructured environment and are comfortable taking ownership of ambiguous problems. You act with a bias toward action and focus on results.Customer Empathy: You excel at collaborating across teams, offering guidance and solutions to unblock engineers and support them in building reliable systems. With empathy at the core of your approach, you focus on addressing the needs of those who depend on datastore infrastructure.\n\nNice To Haves\n\nExperience with change data capture tools like Debezium for real-time data replication and migrations.Experience working closely with application developers, understanding their workflows, and building datastore solutions that address their challenges, such as schema changes, performance, and data access patterns.\n\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nNotion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.\n\nNotion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco. and New York, the estimated base salary range for this role is $130,000 - $240,000 per year.\n\nBy clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Us<br><br></strong>Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.<br><br>In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.<br><br><strong>About The Role<br><br></strong>Datastore infrastructure is the backbone of any software product, and at Notion, it plays a critical role in ensuring our millions of users have a fast, reliable, and secure experience. Our Datastore Infra Team builds and maintains the systems that power the databases and caches behind every Notion feature. From scaling our relational and NoSQL databases to designing data migration frameworks, we ensure that Notion’s data layer remains robust and future-proof.<br><br>As part of the Datastore Infra Team, you’ll have a unique opportunity to shape how Notion manages and scales its foundational data services, enabling innovation across the company. This role is based out of our New York City or San Francisco office.<br><br><strong>What You'll Achieve<br><br></strong><ul><li>You will drive the evolution of our datastore infrastructure to meet the needs of over 100 million global users and support the rapid growth of our product and business. This includes ensuring our systems are reliable, efficient, and scalable, while evaluating and integrating new technologies to keep us ahead of emerging challenges. Your work will empower our engineers to build features with confidence, backed by a strong datastore foundation.</li><li>You will design and deliver a Datastore Platform that simplifies how teams manage and interact with data at scale. From flexible schema management to migrating hundreds of billions of records, you’ll develop tools and frameworks that make it easier for engineers to innovate while maintaining safety, efficiency, and performance.</li><li>You will develop the skills and confidence to debug live production systems with minimal disruption, whether replacing components or managing failovers. You will participate in an on-call rotation, responding to incidents to uphold service reliability and quickly restore normal operations.</li><li>You will partner with product engineers and other infra teams to ensure our datastore infrastructure aligns with evolving business needs and product goals<br><br></li></ul><strong>Skills You'll Need To Bring<br><br></strong><ul><li>Familiarity with Datastore Systems: You have experience with large scale relational databases, distributed caches, and NoSQL systems. You understand how to design, scale, and optimize them to support growing business needs. Our team utilizes cloud-based datastore solutions like AWS RDS, DynamoDB, and ElastiCache to power our infrastructure.</li><li>Systems thinker: You understand distributed systems and can design solutions that account for tradeoffs like consistency, latency, and scalability.</li><li>Pragmatic problem-solver: You prioritize business impact and understand the balance between craft, speed, and long-term maintainability. You’re opinionated but not ideological, and you learn new technologies as you go.</li><li>Ownership and initiative: You thrive in a fast-moving, unstructured environment and are comfortable taking ownership of ambiguous problems. You act with a bias toward action and focus on results.</li><li>Customer Empathy: You excel at collaborating across teams, offering guidance and solutions to unblock engineers and support them in building reliable systems. With empathy at the core of your approach, you focus on addressing the needs of those who depend on datastore infrastructure.<br><br></li></ul><strong>Nice To Haves<br><br></strong><ul><li>Experience with change data capture tools like Debezium for real-time data replication and migrations.</li><li>Experience working closely with application developers, understanding their workflows, and building datastore solutions that address their challenges, such as schema changes, performance, and data access patterns.<br><br></li></ul>We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.<br><br>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.<br><br>Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco. and New York, the estimated base salary range for this role is $130,000 - $240,000 per year.<br><br>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T11:35:50.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 78,
      "relevanceReason": "João has a strong technical background with experience in relevant technologies like Typescript and Javascript. His experience in optimizing performance and leading teams aligns well with the responsibilities described in the job posting. The role in datastore infrastructure is a good match for his experience.",
      "recommendation": "Recommended"
    },
    {
      "id": "4c48fcc6a11a10e5f6e6c7362f08ef88",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-cloud-infrastructure-at-notion-4278551507",
      "title": "Notion hiring Software Engineer, Cloud Infrastructure in San Francisco, CA ",
      "content_text": "About Us\n\nNotion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.\n\nIn-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.\n\nAbout The Role\n\nMillions of people use Notion — and this number is increasing every day. That means millions of people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion.\n\nThe Cloud Infrastructure team is a unique opportunity within Notion to architect the foundational cloud environment that can scale alongside Notion’s rapid growth. As an engineer on the team, you'll work on the fundamental infrastructure components that all other teams at Notion build upon and guide Notion through the next few years of growth.\n\nWhat You'll Achieve\n\nDrive the future of Cloud Infrastructure at Notion—you’ll lead our strategy and execution across compute, networking, and resource orchestration, ensuring our platform scales reliably and securely to serve 100M+ users worldwide. Including container orchestration, cloud cost efficiency, resilience, global expansion across regions while considering compliance and performance.Hands on in building our next-generation self-service platform, partnering with product engineers to enable rapid, reliable deployment with strong guardrails—while reducing friction and increasing velocity across hundreds of developers. You'll be responsible for maintaining a high-quality bar for everything your team ships.Lead by example in operational excellence—you’ll guide the team through high-severity incidents, eliminate our gaps in observability, improve incident response processes, and uphold reliability standards. You’ll participate in a sustainable on-call rotation and help shape Notion’s reliability culture.\n\nSkills You'll Need To Bring\n\nSoftware Engineer with Cloud Infrastructure Foundation: You are a hands-on software engineer who is an expert in contributing to large codebases and establishing strong patterns in greenfield projects. You bring a test-driven development mindset, carefully consider how your changes will affect production environments, and take steps to validate them. You have expertise with cloud concepts, particularly in networking, compute optimization. You build observability tools to validate changes and programmatically catch regressions.Startup mentality: You are comfortable navigating the fast moving, unstructured nature of a hyper-growth startup. You understand the importance of setting the engineering quality bar for the long term success of our business, but are able to make difficult prioritizations.Pragmatic and business-oriented: You care about business impact and prioritize projects accordingly. You don't just go after cool stuff—you understand the balance between craft, speed, and the bottom line.\n\nNice To Haves\n\nYou have experience working with the following:Cloud Compute and Networking technologies - Cloudflare / AWSCloud Efficiency - capacity planning, cost attributionInfrastructure as Code Technologies - Terraform / Pulumi / TypescriptYou are comfortable using AI tools to accelerate impact\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nNotion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.\n\nNotion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco or New York, the estimated base salary range for this role is $130,000 - $250,000 per year.\n\nBy clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>About Us<br><br></strong>Notion helps you build beautiful tools for your life’s work. In today's world of endless apps and tabs, Notion provides one place for teams to get everything done, seamlessly connecting docs, notes, projects, calendar, and email—with AI built in to find answers and automate work. Millions of users, from individuals to large organizations like Toyota, Figma, and OpenAI, love Notion for its flexibility and choose it because it helps them save time and money.<br><br>In-person collaboration is essential to Notion's culture. We require all team members to work from our offices on Mondays and Thursdays, our designated Anchor Days. Certain teams or positions may require additional in-office workdays.<br><br><strong>About The Role<br><br></strong>Millions of people use Notion — and this number is increasing every day. That means millions of people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion.<br><br>The Cloud Infrastructure team is a unique opportunity within Notion to architect the foundational cloud environment that can scale alongside Notion’s rapid growth. As an engineer on the team, you'll work on the fundamental infrastructure components that all other teams at Notion build upon and guide Notion through the next few years of growth.<br><br><strong>What You'll Achieve<br><br></strong><ul><li>Drive the future of Cloud Infrastructure at Notion—you’ll lead our strategy and execution across compute, networking, and resource orchestration, ensuring our platform scales reliably and securely to serve 100M+ users worldwide. Including container orchestration, cloud cost efficiency, resilience, global expansion across regions while considering compliance and performance.</li><li>Hands on in building our next-generation self-service platform, partnering with product engineers to enable rapid, reliable deployment with strong guardrails—while reducing friction and increasing velocity across hundreds of developers. You'll be responsible for maintaining a high-quality bar for everything your team ships.</li><li>Lead by example in operational excellence—you’ll guide the team through high-severity incidents, eliminate our gaps in observability, improve incident response processes, and uphold reliability standards. You’ll participate in a sustainable on-call rotation and help shape Notion’s reliability culture.<br><br></li></ul><strong>Skills You'll Need To Bring<br><br></strong><ul><li>Software Engineer with Cloud Infrastructure Foundation: You are a hands-on software engineer who is an expert in contributing to large codebases and establishing strong patterns in greenfield projects. You bring a test-driven development mindset, carefully consider how your changes will affect production environments, and take steps to validate them. You have expertise with cloud concepts, particularly in networking, compute optimization. You build observability tools to validate changes and programmatically catch regressions.</li><li>Startup mentality: You are comfortable navigating the fast moving, unstructured nature of a hyper-growth startup. You understand the importance of setting the engineering quality bar for the long term success of our business, but are able to make difficult prioritizations.</li><li>Pragmatic and business-oriented: You care about business impact and prioritize projects accordingly. You don't just go after cool stuff—you understand the balance between craft, speed, and the bottom line.<br><br></li></ul><strong>Nice To Haves<br><br></strong><ul><li>You have experience working with the following:</li><ul><li>Cloud Compute and Networking technologies - Cloudflare / AWS</li><li>Cloud Efficiency - capacity planning, cost attribution</li><li>Infrastructure as Code Technologies - Terraform / Pulumi / Typescript</li></ul><li>You are comfortable using AI tools to accelerate impact<br></li></ul>We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.<br><br>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation made due to a disability, please let your recruiter know.<br><br>Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco or New York, the estimated base salary range for this role is $130,000 - $250,000 per year.<br><br>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T11:33:15.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 78,
      "relevanceReason": "The candidate's experience aligns well with the cloud infrastructure focus, though the job description is a bit vague on the specific technologies used. The candidate's experience with AWS and general infrastructure concepts is relevant.",
      "recommendation": "Consider"
    },
    {
      "id": "235d38173d59b2231caf69f6cf5af486",
      "url": "https://www.linkedin.com/jobs/view/junior-software-engineer-at-medpace-4116237463",
      "title": "Medpace hiring Junior Software Engineer in Cincinnati, OH ",
      "content_text": "Medpace's Information Technology team is looking for a full-time, office-based Jr. Software Engineer.\n\nJoin us in building the digital capabilities that accelerate the global development of safe and effective medical therapeutics through clinical trials. In this role, you will work on a team that modernizes and supports Medpace's internal systems. Strong attention to detail, desire for process ownership, and interest in implementing new technology are highly valued. Our Catalyst Rotational Onboarding program will set you up for success with the tech skills and industry knowledge to help you excel.\n\nIf you want an exciting career where you use your previous expertise and can develop and grow your career even further, then this is the opportunity for you.\n\nResponsibilities\n\nContribute to software development team(s) for one or multiple software applications or initiatives.Build software applications and features in an Agile environment by following our software development lifecycle (SDLC) process.Develop applications in a hybrid and cloud native setting utilizing development skills that include object-oriented programming (C#), databases (SQL), Entity Framework (EF), Angular, and web applications (ASP.NET).Participate in requirements gathering, design, development, testing, release, and support of applications.Collaborate with team members regarding projects, development, tools, and training.Support high level end-user support including feature training and troubleshooting for applications.Contribute to the software validation process through development, review, and/or execution of test plan/cases/scripts.Learn patterns, approaches, and business practices across multiple development teams\n\nQualifications\n\nBachelor's Degree in Computer Science or closely related.Software development experience using C#, Angular or similar JavaScript framework, HTML5, and CSS3.Prior experience using Entity Framework, GitHub, SQL/NoSQL is a plus.Understanding of software development life cycle (SDLC) including release management is a plus.Excellent analytical, written, and oral communication skills.Excellent computer skills.\n\nMedpace Overview\n\nMedpace is a full-service clinical contract research organization (CRO). We provide Phase I-IV clinical development services to the biotechnology, pharmaceutical and medical device industries. Our mission is to accelerate the global development of safe and effective medical therapeutics through its scientific and disciplined approach. We leverage local regulatory and therapeutic expertise across all major areas including oncology, cardiology, metabolic disease, endocrinology, central nervous system, anti-viral and anti-infective. Headquartered in Cincinnati, Ohio, employing more than 5,000 people across 40+ countries.\n\nWhy Medpace?\n\nPeople. Purpose. Passion. Make a Difference Tomorrow. Join Us Today.\n\nThe work we’ve done over the past 30+ years has positively impacted the lives of countless patients and families who face hundreds of diseases across all key therapeutic areas. The work we do today will improve the lives of people living with illness and disease in the future.\n\nCincinnati Perks\n\nCincinnati Campus OverviewFlexible work environmentCompetitive PTO packages, starting at 20+ daysCompetitive compensation and benefits packageCompany-sponsored employee appreciation eventsEmployee health and wellness initiativesCommunity involvement with local nonprofit organizationsDiscounts on local sports games, fitness gyms and attractionsModern, ecofriendly campus with an on-site fitness centerStructured career paths with opportunities for professional growthDiscounted tuition for UC online programs\n\nAwards\n\nNamed a Top Workplace in 2024 by The Cincinnati EnquirerRecognized by Forbes as one of America's Most Successful Midsize Companies in 2021, 2022, 2023 and 2024Continually recognized with CRO Leadership Awards from Life Science Leader magazine based on expertise, quality, capabilities, reliability, and compatibility\n\nWhat To Expect Next\n\nA Medpace team member will review your qualifications and, if interested, you will be contacted with details for next steps.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Medpace's Information Technology team is looking for a full-time, office-based Jr. Software Engineer.<br><br>Join us in building the digital capabilities that accelerate the global development of safe and effective medical therapeutics through clinical trials. In this role, you will work on a team that modernizes and supports Medpace's internal systems. Strong attention to detail, desire for process ownership, and interest in implementing new technology are highly valued. Our Catalyst Rotational Onboarding program will set you up for success with the tech skills and industry knowledge to help you excel.<br><br>If you want an exciting career where you use your previous expertise and can develop and grow your career even further, then this is the opportunity for you.<br><br><strong>Responsibilities<br><br></strong><ul><li>Contribute to software development team(s) for one or multiple software applications or initiatives.</li><li>Build software applications and features in an Agile environment by following our software development lifecycle (SDLC) process.</li><li>Develop applications in a hybrid and cloud native setting utilizing development skills that include object-oriented programming (C#), databases (SQL), Entity Framework (EF), Angular, and web applications (ASP.NET).</li><li>Participate in requirements gathering, design, development, testing, release, and support of applications.</li><li>Collaborate with team members regarding projects, development, tools, and training.</li><li>Support high level end-user support including feature training and troubleshooting for applications.</li><li>Contribute to the software validation process through development, review, and/or execution of test plan/cases/scripts.</li><li>Learn patterns, approaches, and business practices across multiple development teams<br><br></li></ul><strong>Qualifications<br><br></strong><ul><li>Bachelor's Degree in Computer Science or closely related.</li><li>Software development experience using C#, Angular or similar JavaScript framework, HTML5, and CSS3.</li><li>Prior experience using Entity Framework, GitHub, SQL/NoSQL is a plus.</li><li>Understanding of software development life cycle (SDLC) including release management is a plus.</li><li>Excellent analytical, written, and oral communication skills.</li><li>Excellent computer skills.<br><br></li></ul><strong>Medpace Overview<br><br></strong>Medpace is a full-service clinical contract research organization (CRO). We provide Phase I-IV clinical development services to the biotechnology, pharmaceutical and medical device industries. Our mission is to accelerate the global development of safe and effective medical therapeutics through its scientific and disciplined approach. We leverage local regulatory and therapeutic expertise across all major areas including oncology, cardiology, metabolic disease, endocrinology, central nervous system, anti-viral and anti-infective. Headquartered in Cincinnati, Ohio, employing more than 5,000 people across 40+ countries.<br><br><strong>Why Medpace?<br><br></strong>People. Purpose. Passion. Make a Difference Tomorrow. Join Us Today.<br><br>The work we’ve done over the past 30+ years has positively impacted the lives of countless patients and families who face hundreds of diseases across all key therapeutic areas. The work we do today will improve the lives of people living with illness and disease in the future.<br><br><strong>Cincinnati Perks<br><br></strong><ul><li>Cincinnati Campus Overview</li><li>Flexible work environment</li><li>Competitive PTO packages, starting at 20+ days</li><li>Competitive compensation and benefits package</li><li>Company-sponsored employee appreciation events</li><li>Employee health and wellness initiatives</li><li>Community involvement with local nonprofit organizations</li><li>Discounts on local sports games, fitness gyms and attractions</li><li>Modern, ecofriendly campus with an on-site fitness center</li><li>Structured career paths with opportunities for professional growth</li><li>Discounted tuition for UC online programs<br><br></li></ul><strong>Awards<br><br></strong><ul><li>Named a Top Workplace in 2024 by The Cincinnati Enquirer</li><li>Recognized by Forbes as one of America's Most Successful Midsize Companies in 2021, 2022, 2023 and 2024</li><li>Continually recognized with CRO Leadership Awards from Life Science Leader magazine based on expertise, quality, capabilities, reliability, and compatibility<br><br></li></ul><strong>What To Expect Next<br><br></strong>A Medpace team member will review your qualifications and, if interested, you will be contacted with details for next steps.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T10:06:50.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "The candidate has a good technical skills match with C#, Angular, HTML5, and CSS3 experience, as well as experience with SQL. The role aligns with the candidate's full-stack experience and desired career progression.  However, a lack of explicit .NET experience and the Junior role might be slightly misaligned.",
      "recommendation": "Recommended"
    },
    {
      "id": "d5a64d04697e7fb8f8eda09b55befd8e",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-experimentation-platform-at-netflix-4287188420",
      "title": "Netflix hiring Software Engineer L4 - Experimentation Platform in United States ",
      "content_text": "Posted 1:39:31 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 1:39:31 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "João's extensive experience as a full-stack developer, particularly his proficiency in TypeScript and React, aligns well with the general requirements of a Software Engineer role at Netflix. His experience in performance optimization and team leadership further strengthens the match. The lack of specific details about the Experimentation Platform makes a precise evaluation difficult, but his general skill set is a good fit.",
      "recommendation": "Consider"
    },
    {
      "id": "0d5b332bd5b20f57be69383a5d3661ba",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-ads-at-reddit-inc-4282877161",
      "title": "Reddit, Inc. hiring Software Engineer, Ads in United States ",
      "content_text": "Posted 10:47:43 PM. Reddit is a community of communities. It’s built on shared interests, passion, and trust and is…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 10:47:43 PM. Reddit is a community of communities. It’s built on shared interests, passion, and trust and is…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "The candidate possesses strong full-stack experience with relevant technologies like TypeScript and Javascript. Their experience in leading teams and optimizing performance aligns well with potential responsibilities. However, the job description is vague, making it difficult to assess a perfect fit.",
      "recommendation": "Recommended"
    },
    {
      "id": "5a2f0231a0ee11ae89e47d377be656cc",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l5-member-commerce-games-engineering-at-netflix-4219576591",
      "title": "Netflix hiring Software Engineer (L5) - Member, Commerce & Games Engineering in United States ",
      "content_text": "Posted 9:48:28 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:48:28 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "The candidate has strong technical skills relevant to a Software Engineer role, particularly in full-stack development and Javascript/Typescript. The experience with leading teams and optimizing performance aligns well with potential responsibilities. However, the lack of specific Netflix/entertainment industry experience slightly reduces the score.",
      "recommendation": "Recommended"
    },
    {
      "id": "d41f382949dd54d00ec3e37cca435864",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-at-microsoft-4278530297",
      "title": "Microsoft hiring Software Engineer in United States ",
      "content_text": "Posted 2:11:24 PM. Are you interested in large-scale projects in the heart of Azure? Do you excel in distributed…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 2:11:24 PM. Are you interested in large-scale projects in the heart of Azure? Do you excel in distributed…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "The candidate possesses strong technical skills relevant to the job, particularly in TypeScript and full-stack development. While the specific details about the role within Azure are limited, the candidate's experience with cloud technologies (AWS, Azure) and a track record of leading teams makes this a good match.",
      "recommendation": "Recommended"
    },
    {
      "id": "f30058a3c6d72695b9402bfa1a04f03a",
      "url": "https://www.linkedin.com/jobs/view/frontend-engineer-all-levels-at-ramp-4285933578",
      "title": "Ramp hiring Frontend Engineer | All Levels in United States ",
      "content_text": "Posted 4:52:56 PM. About RampAt Ramp, we’re rethinking how modern finance teams function in the age of AI. We believe…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 4:52:56 PM. About RampAt Ramp, we’re rethinking how modern finance teams function in the age of AI. We believe…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 75,
      "relevanceReason": "The candidate possesses strong frontend skills, including React and TypeScript, which are highly relevant to a frontend engineer role. Their experience in leading teams and optimizing performance aligns well with potential responsibilities, though specific details on Ramp's tech stack are missing for a perfect match.",
      "recommendation": "Recommended"
    },
    {
      "id": "8e911b332b1132e7b96d3b73b32cb8e7",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-api-at-headspace-4203023309",
      "title": "Headspace hiring Software Engineer, API in United States ",
      "content_text": "Posted 9:50:56 AM. About the Software Engineer, API at Headspace:\nHeadspace is seeking a talented Software Engineer to…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:50:56 AM. About the Software Engineer, API at Headspace:\nHeadspace is seeking a talented Software Engineer to…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-24T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "The candidate possesses strong technical skills with experience in TypeScript and relevant frontend/backend technologies. The lack of specific details in the job posting makes it difficult to determine role alignment, but the candidate's experience level suggests a mid-level role would be appropriate. While the posting lacks detail about growth potential or the company's industry, the candidate's background is likely a moderate match.",
      "recommendation": "Consider"
    },
    {
      "id": "2083b16fa136e344ef883ca4e7144e33",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-web-at-plaid-4204412238",
      "title": "Plaid hiring Software Engineer - Web in United States ",
      "content_text": "Posted 11:21:26 AM. We believe that the way people interact with their finances will drastically improve in the next…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 11:21:26 AM. We believe that the way people interact with their finances will drastically improve in the next…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "The candidate possesses strong full-stack experience, particularly with TypeScript and React, which are common in web development. While the job description is vague, the candidate's experience aligns well with a Software Engineer role. However, without specifics on Plaid's tech stack, the match is moderate.",
      "recommendation": "Consider"
    },
    {
      "id": "fd6a11e6bf40c0ebad5a8934a3b36873",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-training-platform-machine-learning-platform-at-netflix-4136621785",
      "title": "Netflix hiring Software Engineer L4 Training Platform, Machine Learning Platform in United States ",
      "content_text": "Posted 9:23:54 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:23:54 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "While the candidate possesses strong full-stack and React/Typescript skills which are valuable for a Software Engineer role, the lack of specific details about the role's requirements in the job description makes it difficult to assess a closer match. Netflix is a top company, so there might be high competition.",
      "recommendation": "Consider"
    },
    {
      "id": "5627ff4bf94b713b720a32b00eb4e575",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-l5-data-and-feature-infrastructure-machine-learning-platform-at-netflix-4118836224",
      "title": "Netflix hiring Software Engineer L4/L5 - Data and Feature Infrastructure, Machine Learning Platform in United States ",
      "content_text": "Posted 9:21:29 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:21:29 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "While the candidate has a strong full-stack background and experience with relevant technologies like Typescript and Javascript, the job's focus on Machine Learning Platform and Data Infrastructure might not align directly with the candidate's core experience. Although the candidate possesses experience in related technologies like AWS, there's no explicit ML experience in the resume.",
      "recommendation": "Consider"
    },
    {
      "id": "b04703809a7bbb8f86adcab3feda1d6c",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-l5-model-serving-systems-machine-learning-platform-at-netflix-4118839018",
      "title": "Netflix hiring Software Engineer L4/L5, Model Serving Systems, Machine Learning Platform in United States ",
      "content_text": "Posted 9:50:27 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:50:27 AM. Netflix is one of the world's leading entertainment services, with 283 million paid memberships in…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "The candidate has a strong foundation in full-stack development with relevant technologies like TypeScript and experience leading teams, aligning well with a Senior Engineer role. However, the job description lacks specific details about required tech, and the candidate's experience with Machine Learning Platforms is not explicitly demonstrated.",
      "recommendation": "Consider"
    },
    {
      "id": "cd5c3992daa0aa53eb7a75dd8c22ff41",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l5-ads-identity-privacy-at-netflix-4240428706",
      "title": "Netflix hiring Software Engineer (L5) - Ads Identity & Privacy in United States ",
      "content_text": "Posted 9:46:29 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:46:29 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 65,
      "relevanceReason": "The candidate possesses strong technical skills, particularly in TypeScript and React, relevant to software engineering roles. However, without specifics on the domain (Ads Identity & Privacy), it's difficult to gauge precise role alignment and experience relevance, which limits the score.",
      "recommendation": "Consider"
    },
    {
      "id": "18e353e5f613f725f877b3638ccaba23",
      "url": "https://www.linkedin.com/jobs/view/full-remote-junior-web-developer-at-joinrs-4279575622",
      "title": "Joinrs hiring [Full Remote] Junior Web Developer in United States ",
      "content_text": "Posted 7:29:30 AM. Our goal is to help every recent graduate worldwide find a job that aligns with their ambitions:…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 7:29:30 AM. Our goal is to help every recent graduate worldwide find a job that aligns with their ambitions:…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-22T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 62,
      "relevanceReason": "While the candidate possesses strong full-stack experience and relevant skills, the job posting lacks sufficient information to assess the technical requirements and role alignment accurately. The 'Junior' level is a potential mismatch, as the candidate's experience is more suited for a mid-level role. Further details about the required technologies and responsibilities would be needed to improve the score.",
      "recommendation": "Consider"
    },
    {
      "id": "da6d39788f8fb7e0ed73972ddc5bdb16",
      "url": "https://www.linkedin.com/jobs/view/bi-developer-at-linkedin-4290222262",
      "title": "LinkedIn hiring BI Developer in Sunnyvale, CA ",
      "content_text": "Company Description\n\nLinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.\n\nJoin us to transform the way the world works.\n\nJob Description\n\nThis role will be based in Sunnyvale, San Francisco, Chicago or New York depending upon which location the applicant chosen for the role is currently residing.\n\nAt LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.\n\nThe ideal candidate will require advanced visualization skills (PowerBI / Tableau) and SQL skills to create impactful data visualizations and insights. This will span all phases of the data asset development lifecycle (e.g., requirements elicitation through development and eventual sunset). The candidate should also have strong analytical skills and be adept at deriving, distilling and articulating actionable business insights from large amounts of data. Using strong communication skills, the role will effectively collaborate with a variety of people and job functions, accomplishing tasks of high complexity and scope, and can perform professionally in a challenging and extremely fast-paced environment.\n\nWhat You’ll Do:\n\nAccountable for publishing and maintaining analytics dashboards and other data assets via Tableau, PowerBI or other Analytics applications (e.g., Retina, Darwin, etc.) Write SQL/Python queries to extract necessary data, analyze the results to generate actionable insights and present the findings either in Tableau, PowerBI, Excel or PowerPoint Collaborate closely with the sales, marketing, engineering and data teams to provide analysis, reporting and tools that inform key stakeholders. Leverage LinkedIn’s unique data to create innovative analyses & dashboards. Work with upstream technology partners to develop and deliver technical solutions. Build cross-functional relationships and partner effectively with other teams to drive project success. Make business recommendations, conveying findings at multiple levels including managers and peers through visual displays of quantitative information. \n\n\nQualifications\n\nBasic Qualifications:\n\n5+ years SQL experience 5+ years of experience with a BI or visualization tool Bachelor’s Degree in Computer Science, Information Systems, Engineering, Data Science, Mathematics, Statistics, Physics, Economics, Cognitive Science, Business Information Technology, or a related technical or quantitative field — or equivalent practical experience \n\n\nPreferred Qualifications:\n\nExperience with PowerBI Strong problem-solving and project management skills Experience presenting data or other technical concepts to senior stakeholders Proven experience managing a large group of stakeholders and independently driving global projects Experience with Sales Operations processes and CRM systems (e.g., SFDC and Dynamics) \n\n\nSuggested Skills:\n\nSQL Power BI Stakeholder Management Problem solving \n\n\nLinkedIn is committed to fair and equitable compensation practices.\n\nThe pay range for this role is $112,000 to $185,000. Actual compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years & depth of experience, certifications and specific office location. This may differ in other locations due to cost of labor considerations.\n\nThe total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For additional information, visit: https://careers.linkedin.com/benefits.\n\nAdditional Information\n\nEqual Opportunity Statement \n\nWe seek candidates with a wide range of perspectives and backgrounds and we are proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nLinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.\n\nIf you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.\n\nReasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:\n\nDocuments in alternate formats or read aloud to youHaving interviews in an accessible locationBeing accompanied by a service dogHaving a sign language interpreter present for the interview\n\n\nA request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.\n\nLinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.\n\nSan Francisco Fair Chance Ordinance \n\nPursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.\n\nPay Transparency Policy Statement \n\nAs a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.\n\nGlobal Data Privacy Notice for Job Candidates \n\nPlease follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.\n\n",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div><strong>Company Description<br><br></strong>LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.<br><br>Join us to transform the way the world works.<br><br><strong>Job Description<br><br></strong>This role will be based in Sunnyvale, San Francisco, Chicago or New York depending upon which location the applicant chosen for the role is currently residing.<br><br>At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.<br><br>The ideal candidate will require advanced visualization skills (PowerBI / Tableau) and SQL skills to create impactful data visualizations and insights. This will span all phases of the data asset development lifecycle (e.g., requirements elicitation through development and eventual sunset). The candidate should also have strong analytical skills and be adept at deriving, distilling and articulating actionable business insights from large amounts of data. Using strong communication skills, the role will effectively collaborate with a variety of people and job functions, accomplishing tasks of high complexity and scope, and can perform professionally in a challenging and extremely fast-paced environment.<br><br>What You’ll Do:<br><br><ul><li>Accountable for publishing and maintaining analytics dashboards and other data assets via Tableau, PowerBI or other Analytics applications (e.g., Retina, Darwin, etc.) </li><li>Write SQL/Python queries to extract necessary data, analyze the results to generate actionable insights and present the findings either in Tableau, PowerBI, Excel or PowerPoint </li><li>Collaborate closely with the sales, marketing, engineering and data teams to provide analysis, reporting and tools that inform key stakeholders. </li><li>Leverage LinkedIn’s unique data to create innovative analyses & dashboards. </li><li>Work with upstream technology partners to develop and deliver technical solutions. </li><li>Build cross-functional relationships and partner effectively with other teams to drive project success. </li><li>Make business recommendations, conveying findings at multiple levels including managers and peers through visual displays of quantitative information. <br><br><br></li></ul><strong>Qualifications<br><br></strong>Basic Qualifications:<br><br><ul><li>5+ years SQL experience </li><li>5+ years of experience with a BI or visualization tool </li><li>Bachelor’s Degree in Computer Science, Information Systems, Engineering, Data Science, Mathematics, Statistics, Physics, Economics, Cognitive Science, Business Information Technology, or a related technical or quantitative field — or equivalent practical experience <br><br><br></li></ul>Preferred Qualifications:<br><br><ul><li>Experience with PowerBI </li><li>Strong problem-solving and project management skills </li><li>Experience presenting data or other technical concepts to senior stakeholders </li><li>Proven experience managing a large group of stakeholders and independently driving global projects </li><li>Experience with Sales Operations processes and CRM systems (e.g., SFDC and Dynamics) <br><br><br></li></ul>Suggested Skills:<br><br><ul><li>SQL </li><li>Power BI </li><li>Stakeholder Management </li><li>Problem solving <br><br><br></li></ul>LinkedIn is committed to fair and equitable compensation practices.<br><br>The pay range for this role is $112,000 to $185,000. Actual compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years & depth of experience, certifications and specific office location. This may differ in other locations due to cost of labor considerations.<br><br>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For additional information, visit: https://careers.linkedin.com/benefits.<br><br><strong>Additional Information<br><br></strong><strong>Equal Opportunity Statement <br><br></strong>We seek candidates with a wide range of perspectives and backgrounds and we are proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.<br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.<br><br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.<br><br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:<br><br><ul><li>Documents in alternate formats or read aloud to you</li><li>Having interviews in an accessible location</li><li>Being accompanied by a service dog</li><li>Having a sign language interpreter present for the interview<br><br><br></li></ul>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br><strong>San Francisco Fair Chance Ordinance <br><br></strong>Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.<br><br><strong>Pay Transparency Policy Statement <br><br></strong>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br><strong>Global Data Privacy Notice for Job Candidates <br><br></strong>Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.<br><br></div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T01:49:41.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 55,
      "relevanceReason": "While João has strong technical skills, particularly in full-stack development, the job posting's focus on BI tools like PowerBI and Tableau presents a significant skills gap. His experience aligns with the desired seniority, but the lack of relevant experience makes this a moderate match.",
      "recommendation": "Consider"
    },
    {
      "id": "5e4e10e8f47f2ca9a70ccccf1e587c59",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-genai-at-samsara-4209166892",
      "title": "Samsara hiring Software Engineer - GenAI in United States ",
      "content_text": "Posted 9:33:03 AM. Who We AreSamsara (NYSE: IOT) is the pioneer of the Connected Operations™ Cloud, which is a…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:33:03 AM. Who We AreSamsara (NYSE: IOT) is the pioneer of the Connected Operations™ Cloud, which is a…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 55,
      "relevanceReason": "The candidate possesses a strong foundation in full-stack development with relevant technologies like TypeScript and React, but the lack of GenAI experience significantly lowers the score. While the candidate's leadership skills are valuable, the limited information about the job's requirements prevents a higher rating.",
      "recommendation": "Consider"
    },
    {
      "id": "25260981b9792183d055bb50e6213a70",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-l4-cloud-network-engineering-at-netflix-4202060410",
      "title": "Netflix hiring Software Engineer (L4) - Cloud Network Engineering in United States ",
      "content_text": "Posted 9:48:57 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.",
      "content_html": "<div><img src=\"https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf\" style=\"width: 100%;\" /><div>Posted 9:48:57 AM. Netflix is one of the world's leading entertainment services, with over 300 million paid…See this and similar jobs on LinkedIn.</div></div>",
      "image": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf",
      "date_published": "2025-08-23T00:00:00.000Z",
      "authors": [
        {
          "name": "LinkedIn"
        }
      ],
      "attachments": [
        {
          "url": "https://static.licdn.com/aero-v1/sc/h/xlk678jv0tjp79pv10kglzkf"
        }
      ],
      "relevanceScore": 45,
      "relevanceReason": "The candidate's full-stack experience and strong skills in TypeScript and React are not a direct match for a Cloud Network Engineering role. The lack of relevant cloud networking skills and experience in the job description results in a low score.",
      "recommendation": "Skip"
    }
  ]
}